*** crates/agent/src/lib.rs:117:9: replace <impl Iterator for JsonlLines<R>>::next -> Option<Self::Item> with None

*** mutation diff:
--- crates/agent/src/lib.rs
+++ replace <impl Iterator for JsonlLines<R>>::next -> Option<Self::Item> with None
@@ -109,29 +109,17 @@
 
 impl<R> Iterator for JsonlLines<R>
 where
     R: BufRead,
 {
     type Item = io::Result<String>;
 
     fn next(&mut self) -> Option<Self::Item> {
-        self.buffer.clear();
-
-        match self.reader.read_line(&mut self.buffer) {
-            Ok(0) => None,
-            Ok(_) => {
-                while self.buffer.ends_with('\n') || self.buffer.ends_with('\r') {
-                    self.buffer.pop();
-                }
-
-                Some(Ok(self.buffer.clone()))
-            }
-            Err(error) => Some(Err(error)),
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug)]
 pub struct JsonlChild {
     child: Child,
     lines: JsonlLines<BufReader<ChildStdout>>,
 }

---- jsonl_lines_yield_newline_trimmed_events stdout ----

thread 'jsonl_lines_yield_newline_trimmed_events' panicked at crates/agent/tests/adapters.rs:126:5:
assertion `left == right` failed
  left: []
 right: ["{\"type\":\"started\"}", "{\"type\":\"finished\"}"]

---- spawned_jsonl_child_iterates_over_stdout_lines stdout ----

thread 'spawned_jsonl_child_iterates_over_stdout_lines' panicked at crates/agent/tests/adapters.rs:162:5:
assertion `left == right` failed
  left: None
 right: Some("{\"type\":\"delta\"}")

---- spawned_jsonl_child_reads_next_line_from_stdout stdout ----

thread 'spawned_jsonl_child_reads_next_line_from_stdout' panicked at crates/agent/tests/adapters.rs:138:5:
assertion `left == right` failed
  left: None
 right: Some("{\"type\":\"started\"}")

failures:
    jsonl_lines_yield_newline_trimmed_events
    spawned_jsonl_child_iterates_over_stdout_lines
    spawned_jsonl_child_reads_next_line_from_stdout

test result: FAILED. 7 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
