*** crates/runtime/src/lib.rs:194:9: replace RuntimeRunner::for_sandbox_runner -> Self with Default::default()

*** mutation diff:
--- crates/runtime/src/lib.rs
+++ replace RuntimeRunner::for_sandbox_runner -> Self with Default::default()
@@ -186,20 +186,17 @@
     pub fn detect() -> Self {
         Self {
             sandbox_runner: SandboxRunner::detect(),
             script_runner: ScriptRunner::default(),
         }
     }
 
     pub fn for_sandbox_runner(sandbox_runner: SandboxRunner) -> Self {
-        Self {
-            sandbox_runner,
-            script_runner: ScriptRunner::default(),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn with_script_runner(mut self, script_runner: ScriptRunner) -> Self {
         self.script_runner = script_runner;
         self
     }
 
     pub fn compile(&self, request: &RuntimeRequest) -> Result<RuntimePlan, RuntimeError> {

---- custom_policy_agent_plan_uses_exact_policy stdout ----

thread 'custom_policy_agent_plan_uses_exact_policy' panicked at crates/runtime/tests/runtime_execution.rs:277:5:
assertion `left == right` failed
  left: MacosSeatbelt
 right: WindowsRestrictedToken

---- read_only_agent_plan_uses_enforced_backend_and_stdin stdout ----

thread 'read_only_agent_plan_uses_enforced_backend_and_stdin' panicked at crates/runtime/tests/runtime_execution.rs:191:5:
assertion `left == right` failed
  left: MacosSeatbelt
 right: LinuxBubblewrap

---- enforced_runtime_does_not_fallback_when_backend_is_missing stdout ----

thread 'enforced_runtime_does_not_fallback_when_backend_is_missing' panicked at crates/runtime/tests/runtime_execution.rs:346:6:

failures:
    custom_policy_agent_plan_uses_exact_policy
    enforced_runtime_does_not_fallback_when_backend_is_missing
    read_only_agent_plan_uses_enforced_backend_and_stdin
    restricted_script_plan_adds_compiled_workspace_read_entry

test result: FAILED. 16 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.44s

*** result: Failure(101)
