*** crates/sandbox-registry/src/lib.rs:108:9: replace SandboxRegistry::insert -> Result<(), SandboxRegistryError> with Ok(())

*** mutation diff:
--- crates/sandbox-registry/src/lib.rs
+++ replace SandboxRegistry::insert -> Result<(), SandboxRegistryError> with Ok(())
@@ -100,22 +100,17 @@
 }
 
 impl SandboxRegistry {
     pub fn new() -> Self {
         Self::default()
     }
 
     pub fn insert(&mut self, definition: SandboxDefinition) -> Result<(), SandboxRegistryError> {
-        if self.definitions.contains_key(definition.id()) {
-            return Err(SandboxRegistryError::DuplicateId(definition.id().clone()));
-        }
-
-        self.definitions.insert(definition.id().clone(), definition);
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn resolve(
         &self,
         id: impl Into<String>,
     ) -> Result<&SandboxDefinition, SandboxRegistryError> {
         let id = SandboxId::new(id).map_err(SandboxRegistryError::InvalidId)?;

---- registry_resolves_named_sandbox_definition stdout ----

thread 'registry_resolves_named_sandbox_definition' panicked at crates/sandbox-registry/tests/registry.rs:22:49:
called `Result::unwrap()` on an `Err` value: UnknownId(SandboxId("readonly"))

---- registry_rejects_duplicate_ids stdout ----

thread 'registry_rejects_duplicate_ids' panicked at crates/sandbox-registry/tests/registry.rs:37:44:
called `Result::unwrap_err()` on an `Ok` value: ()

---- file_store_reloads_saved_registry_from_disk stdout ----

thread 'file_store_reloads_saved_registry_from_disk' panicked at crates/sandbox-registry/tests/registry.rs:85:46:
called `Result::unwrap()` on an `Err` value: UnknownId(SandboxId("read-only"))

failures:
    file_store_reloads_saved_registry_from_disk
    registry_rejects_duplicate_ids
    registry_resolves_named_sandbox_definition

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
