*** crates/agent/src/lib.rs:122:51: replace || with && in <impl Iterator for JsonlLines<R>>::next

*** mutation diff:
--- crates/agent/src/lib.rs
+++ replace || with && in <impl Iterator for JsonlLines<R>>::next
@@ -114,17 +114,17 @@
     type Item = io::Result<String>;
 
     fn next(&mut self) -> Option<Self::Item> {
         self.buffer.clear();
 
         match self.reader.read_line(&mut self.buffer) {
             Ok(0) => None,
             Ok(_) => {
-                while self.buffer.ends_with('\n') || self.buffer.ends_with('\r') {
+                while self.buffer.ends_with('\n') && /* ~ changed by cargo-mutants ~ */ self.buffer.ends_with('\r') {
                     self.buffer.pop();
                 }
 
                 Some(Ok(self.buffer.clone()))
             }
             Err(error) => Some(Err(error)),
         }
     }

---- jsonl_lines_yield_newline_trimmed_events stdout ----

thread 'jsonl_lines_yield_newline_trimmed_events' panicked at crates/agent/tests/adapters.rs:126:5:
assertion `left == right` failed
  left: ["{\"type\":\"started\"}\n", "{\"type\":\"finished\"}\n"]
 right: ["{\"type\":\"started\"}", "{\"type\":\"finished\"}"]

---- spawned_jsonl_child_reads_next_line_from_stdout stdout ----

thread 'spawned_jsonl_child_reads_next_line_from_stdout' panicked at crates/agent/tests/adapters.rs:138:5:
assertion `left == right` failed
  left: Some("{\"type\":\"started\"}\n")
 right: Some("{\"type\":\"started\"}")

---- spawned_jsonl_child_iterates_over_stdout_lines stdout ----

thread 'spawned_jsonl_child_iterates_over_stdout_lines' panicked at crates/agent/tests/adapters.rs:162:5:
assertion `left == right` failed
  left: Some("{\"type\":\"delta\"}\n")
 right: Some("{\"type\":\"delta\"}")

failures:
    jsonl_lines_yield_newline_trimmed_events
    spawned_jsonl_child_iterates_over_stdout_lines
    spawned_jsonl_child_reads_next_line_from_stdout

test result: FAILED. 7 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
