*** crates/sandbox-registry/src/lib.rs:128:9: replace SandboxRegistry::get -> Option<&SandboxDefinition> with None

*** mutation diff:
--- crates/sandbox-registry/src/lib.rs
+++ replace SandboxRegistry::get -> Option<&SandboxDefinition> with None
@@ -120,17 +120,17 @@
         let id = SandboxId::new(id).map_err(SandboxRegistryError::InvalidId)?;
 
         self.definitions
             .get(&id)
             .ok_or(SandboxRegistryError::UnknownId(id))
     }
 
     pub fn get(&self, id: &SandboxId) -> Option<&SandboxDefinition> {
-        self.definitions.get(id)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn len(&self) -> usize {
         self.definitions.len()
     }
 
     pub fn is_empty(&self) -> bool {
         self.definitions.is_empty()

*** result: Success
