*** crates/agent/src/lib.rs:141:9: replace JsonlChild::next_line -> io::Result<Option<String>> with Ok(Some("xyzzy".into()))

*** mutation diff:
--- crates/agent/src/lib.rs
+++ replace JsonlChild::next_line -> io::Result<Option<String>> with Ok(Some("xyzzy".into()))
@@ -133,20 +133,17 @@
 #[derive(Debug)]
 pub struct JsonlChild {
     child: Child,
     lines: JsonlLines<BufReader<ChildStdout>>,
 }
 
 impl JsonlChild {
     pub fn next_line(&mut self) -> io::Result<Option<String>> {
-        match self.lines.next() {
-            Some(line) => line.map(Some),
-            None => Ok(None),
-        }
+        Ok(Some("xyzzy".into())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn wait(mut self) -> io::Result<ExitStatus> {
         self.child.wait()
     }
 }
 
 impl Iterator for JsonlChild {

---- spawned_jsonl_child_reads_next_line_from_stdout stdout ----

thread 'spawned_jsonl_child_reads_next_line_from_stdout' panicked at crates/agent/tests/adapters.rs:138:5:
assertion `left == right` failed
  left: Some("xyzzy")
 right: Some("{\"type\":\"started\"}")

failures:
    spawned_jsonl_child_reads_next_line_from_stdout

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
