*** crates/sandbox-registry/src/lib.rs:136:9: replace SandboxRegistry::is_empty -> bool with true

*** mutation diff:
--- crates/sandbox-registry/src/lib.rs
+++ replace SandboxRegistry::is_empty -> bool with true
@@ -128,17 +128,17 @@
         self.definitions.get(id)
     }
 
     pub fn len(&self) -> usize {
         self.definitions.len()
     }
 
     pub fn is_empty(&self) -> bool {
-        self.definitions.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn iter(&self) -> impl Iterator<Item = &SandboxDefinition> {
         self.definitions.values()
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]

*** result: Success
