*** crates/agent/src/lib.rs:148:9: replace JsonlChild::wait -> io::Result<ExitStatus> with Ok(Default::default())

*** mutation diff:
--- crates/agent/src/lib.rs
+++ replace JsonlChild::wait -> io::Result<ExitStatus> with Ok(Default::default())
@@ -140,17 +140,17 @@
     pub fn next_line(&mut self) -> io::Result<Option<String>> {
         match self.lines.next() {
             Some(line) => line.map(Some),
             None => Ok(None),
         }
     }
 
     pub fn wait(mut self) -> io::Result<ExitStatus> {
-        self.child.wait()
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Iterator for JsonlChild {
     type Item = io::Result<String>;
 
     fn next(&mut self) -> Option<Self::Item> {
         self.lines.next()

---- spawned_jsonl_child_wait_reports_process_exit_status stdout ----

thread 'spawned_jsonl_child_wait_reports_process_exit_status' panicked at crates/agent/tests/adapters.rs:184:5:
assertion failed: !status.success()

failures:
    spawned_jsonl_child_wait_reports_process_exit_status

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
