*** crates/agent/src/lib.rs:156:9: replace <impl Iterator for JsonlChild>::next -> Option<Self::Item> with None

*** mutation diff:
--- crates/agent/src/lib.rs
+++ replace <impl Iterator for JsonlChild>::next -> Option<Self::Item> with None
@@ -148,11 +148,11 @@
         self.child.wait()
     }
 }
 
 impl Iterator for JsonlChild {
     type Item = io::Result<String>;
 
     fn next(&mut self) -> Option<Self::Item> {
-        self.lines.next()
+        None /* ~ changed by cargo-mutants ~ */
     }
 }

---- spawned_jsonl_child_iterates_over_stdout_lines stdout ----

thread 'spawned_jsonl_child_iterates_over_stdout_lines' panicked at crates/agent/tests/adapters.rs:162:5:
assertion `left == right` failed
  left: None
 right: Some("{\"type\":\"delta\"}")

failures:
    spawned_jsonl_child_iterates_over_stdout_lines

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
