*** crates/sandbox-registry/src/lib.rs:136:9: replace SandboxRegistry::is_empty -> bool with false

*** mutation diff:
--- crates/sandbox-registry/src/lib.rs
+++ replace SandboxRegistry::is_empty -> bool with false
@@ -128,17 +128,17 @@
         self.definitions.get(id)
     }
 
     pub fn len(&self) -> usize {
         self.definitions.len()
     }
 
     pub fn is_empty(&self) -> bool {
-        self.definitions.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn iter(&self) -> impl Iterator<Item = &SandboxDefinition> {
         self.definitions.values()
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]

---- file_store_loads_missing_file_as_empty_registry stdout ----

thread 'file_store_loads_missing_file_as_empty_registry' panicked at crates/sandbox-registry/tests/registry.rs:101:5:
assertion failed: registry.is_empty()

failures:
    file_store_loads_missing_file_as_empty_registry

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
