*** crates/sandbox-registry/src/lib.rs:140:9: replace SandboxRegistry::iter -> impl Iterator<Item =&SandboxDefinition> with ::std::iter::empty()

*** mutation diff:
--- crates/sandbox-registry/src/lib.rs
+++ replace SandboxRegistry::iter -> impl Iterator<Item =&SandboxDefinition> with ::std::iter::empty()
@@ -132,17 +132,17 @@
         self.definitions.len()
     }
 
     pub fn is_empty(&self) -> bool {
         self.definitions.is_empty()
     }
 
     pub fn iter(&self) -> impl Iterator<Item = &SandboxDefinition> {
-        self.definitions.values()
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum SandboxRegistryError {
     InvalidId(SandboxIdError),
     DuplicateId(SandboxId),
     UnknownId(SandboxId),

---- file_store_reloads_saved_registry_from_disk stdout ----

thread 'file_store_reloads_saved_registry_from_disk' panicked at crates/sandbox-registry/tests/registry.rs:85:46:
called `Result::unwrap()` on an `Err` value: UnknownId(SandboxId("read-only"))

failures:
    file_store_reloads_saved_registry_from_disk

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
