*** crates/agent/src/lib.rs:51:9: replace AgentCommand::program -> &str with "xyzzy"

*** mutation diff:
--- crates/agent/src/lib.rs
+++ replace AgentCommand::program -> &str with "xyzzy"
@@ -43,17 +43,17 @@
     }
 
     pub fn with_current_dir(mut self, current_dir: impl Into<PathBuf>) -> Self {
         self.current_dir = Some(current_dir.into());
         self
     }
 
     pub fn program(&self) -> &str {
-        &self.program
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn args(&self) -> &[String] {
         &self.args
     }
 
     pub fn current_dir(&self) -> Option<&Path> {
         self.current_dir.as_deref()

---- claude_help_command_uses_cli_help stdout ----

thread 'claude_help_command_uses_cli_help' panicked at crates/agent/tests/adapters.rs:66:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "claude"

---- codex_jsonl_command_uses_exec_json_stream stdout ----

thread 'codex_jsonl_command_uses_exec_json_stream' panicked at crates/agent/tests/adapters.rs:28:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "codex"

---- claude_jsonl_command_uses_print_stream_json stdout ----

thread 'claude_jsonl_command_uses_print_stream_json' panicked at crates/agent/tests/adapters.rs:74:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "claude"

failures:
    claude_help_command_uses_cli_help
    claude_jsonl_command_uses_print_stream_json
    codex_help_command_uses_cli_help
    codex_jsonl_command_uses_exec_json_stream

test result: FAILED. 6 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
