*** crates/sandbox-registry/src/lib.rs:153:9: replace <impl fmt::Display for SandboxRegistryError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/sandbox-registry/src/lib.rs
+++ replace <impl fmt::Display for SandboxRegistryError>::fmt -> fmt::Result with Ok(Default::default())
@@ -145,21 +145,17 @@
 pub enum SandboxRegistryError {
     InvalidId(SandboxIdError),
     DuplicateId(SandboxId),
     UnknownId(SandboxId),
 }
 
 impl fmt::Display for SandboxRegistryError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::InvalidId(error) => write!(f, "{error}"),
-            Self::DuplicateId(id) => write!(f, "duplicate sandbox id: {id}"),
-            Self::UnknownId(id) => write!(f, "unknown sandbox id: {id}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for SandboxRegistryError {}
 
 pub trait SandboxStore {
     fn load(&self) -> Result<SandboxRegistry, SandboxStoreError>;

*** result: Success
