*** crates/sandbox-registry/src/lib.rs:195:12: delete ! in <impl SandboxStore for FileSandboxStore>::load

*** mutation diff:
--- crates/sandbox-registry/src/lib.rs
+++ delete ! in <impl SandboxStore for FileSandboxStore>::load
@@ -187,17 +187,17 @@
 
     pub fn path(&self) -> &Path {
         &self.path
     }
 }
 
 impl SandboxStore for FileSandboxStore {
     fn load(&self) -> Result<SandboxRegistry, SandboxStoreError> {
-        if !self.path.exists() {
+        if  /* ~ changed by cargo-mutants ~ */self.path.exists() {
             return Ok(SandboxRegistry::new());
         }
 
         let contents = fs::read_to_string(&self.path)
             .map_err(|error| SandboxStoreError::io(&self.path, error))?;
         let document: StoredSandboxDocument =
             toml::from_str(&contents).map_err(|error| SandboxStoreError::Decode {
                 path: self.path.clone(),

---- file_store_loads_missing_file_as_empty_registry stdout ----

thread 'file_store_loads_missing_file_as_empty_registry' panicked at crates/sandbox-registry/tests/registry.rs:99:33:
called `Result::unwrap()` on an `Err` value: Io { path: "/var/folders/j9/vyb9gbys5db86cwqm3mld1fw0000gn/T/manual-sandbox-registry-loads-missing-file-1778057813025042000-34095/.manual/sandboxes.toml", message: "No such file or directory (os error 2)" }

---- file_store_reloads_saved_registry_from_disk stdout ----

thread 'file_store_reloads_saved_registry_from_disk' panicked at crates/sandbox-registry/tests/registry.rs:85:46:
called `Result::unwrap()` on an `Err` value: UnknownId(SandboxId("read-only"))

failures:
    file_store_loads_missing_file_as_empty_registry
    file_store_reloads_saved_registry_from_disk

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
