*** crates/agent/src/lib.rs:55:9: replace AgentCommand::args -> &[String] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/agent/src/lib.rs
+++ replace AgentCommand::args -> &[String] with Vec::leak(Vec::new())
@@ -47,17 +47,17 @@
         self
     }
 
     pub fn program(&self) -> &str {
         &self.program
     }
 
     pub fn args(&self) -> &[String] {
-        &self.args
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn current_dir(&self) -> Option<&Path> {
         self.current_dir.as_deref()
     }
 
     pub fn to_std_command(&self) -> Command {
         let mut command = Command::new(&self.program);

---- codex_help_command_uses_cli_help stdout ----

thread 'codex_help_command_uses_cli_help' panicked at crates/agent/tests/adapters.rs:21:5:
assertion `left == right` failed
  left: []
 right: ["-h"]

---- codex_jsonl_command_uses_exec_json_stream stdout ----

thread 'codex_jsonl_command_uses_exec_json_stream' panicked at crates/agent/tests/adapters.rs:29:5:
assertion `left == right` failed
  left: []
 right: ["exec", "--json", "summarize this repository"]

---- claude_help_command_uses_cli_help stdout ----

thread 'claude_help_command_uses_cli_help' panicked at crates/agent/tests/adapters.rs:67:5:
assertion `left == right` failed
  left: []
 right: ["-h"]

failures:
    claude_help_command_uses_cli_help
    claude_jsonl_command_accepts_execution_controls
    claude_jsonl_command_uses_print_stream_json
    codex_help_command_uses_cli_help
    codex_jsonl_command_accepts_execution_controls
    codex_jsonl_command_uses_exec_json_stream

test result: FAILED. 4 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
