*** crates/sandbox-registry/src/lib.rs:195:9: replace <impl SandboxStore for FileSandboxStore>::load -> Result<SandboxRegistry, SandboxStoreError> with Ok(Default::default())

*** mutation diff:
--- crates/sandbox-registry/src/lib.rs
+++ replace <impl SandboxStore for FileSandboxStore>::load -> Result<SandboxRegistry, SandboxStoreError> with Ok(Default::default())
@@ -187,29 +187,17 @@
 
     pub fn path(&self) -> &Path {
         &self.path
     }
 }
 
 impl SandboxStore for FileSandboxStore {
     fn load(&self) -> Result<SandboxRegistry, SandboxStoreError> {
-        if !self.path.exists() {
-            return Ok(SandboxRegistry::new());
-        }
-
-        let contents = fs::read_to_string(&self.path)
-            .map_err(|error| SandboxStoreError::io(&self.path, error))?;
-        let document: StoredSandboxDocument =
-            toml::from_str(&contents).map_err(|error| SandboxStoreError::Decode {
-                path: self.path.clone(),
-                message: error.to_string(),
-            })?;
-
-        document.into_registry()
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn save(&self, registry: &SandboxRegistry) -> Result<(), SandboxStoreError> {
         let document = StoredSandboxDocument::from_registry(registry);
         let contents =
             toml::to_string_pretty(&document).map_err(|error| SandboxStoreError::Encode {
                 message: error.to_string(),
             })?;

---- file_store_reloads_saved_registry_from_disk stdout ----

thread 'file_store_reloads_saved_registry_from_disk' panicked at crates/sandbox-registry/tests/registry.rs:85:46:
called `Result::unwrap()` on an `Err` value: UnknownId(SandboxId("read-only"))

failures:
    file_store_reloads_saved_registry_from_disk

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
