*** crates/sandbox-registry/src/lib.rs:211:9: replace <impl SandboxStore for FileSandboxStore>::save -> Result<(), SandboxStoreError> with Ok(())

*** mutation diff:
--- crates/sandbox-registry/src/lib.rs
+++ replace <impl SandboxStore for FileSandboxStore>::save -> Result<(), SandboxStoreError> with Ok(())
@@ -203,29 +203,17 @@
                 path: self.path.clone(),
                 message: error.to_string(),
             })?;
 
         document.into_registry()
     }
 
     fn save(&self, registry: &SandboxRegistry) -> Result<(), SandboxStoreError> {
-        let document = StoredSandboxDocument::from_registry(registry);
-        let contents =
-            toml::to_string_pretty(&document).map_err(|error| SandboxStoreError::Encode {
-                message: error.to_string(),
-            })?;
-
-        if let Some(parent) = self.path.parent() {
-            if !parent.as_os_str().is_empty() {
-                fs::create_dir_all(parent).map_err(|error| SandboxStoreError::io(parent, error))?;
-            }
-        }
-
-        fs::write(&self.path, contents).map_err(|error| SandboxStoreError::io(&self.path, error))
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum SandboxStoreError {
     Io { path: PathBuf, message: String },
     Decode { path: PathBuf, message: String },
     Encode { message: String },

---- file_store_reloads_saved_registry_from_disk stdout ----

thread 'file_store_reloads_saved_registry_from_disk' panicked at crates/sandbox-registry/tests/registry.rs:85:46:
called `Result::unwrap()` on an `Err` value: UnknownId(SandboxId("read-only"))

failures:
    file_store_reloads_saved_registry_from_disk

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
