*** crates/agent/src/lib.rs:59:9: replace AgentCommand::current_dir -> Option<&Path> with None

*** mutation diff:
--- crates/agent/src/lib.rs
+++ replace AgentCommand::current_dir -> Option<&Path> with None
@@ -51,17 +51,17 @@
         &self.program
     }
 
     pub fn args(&self) -> &[String] {
         &self.args
     }
 
     pub fn current_dir(&self) -> Option<&Path> {
-        self.current_dir.as_deref()
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn to_std_command(&self) -> Command {
         let mut command = Command::new(&self.program);
         command.args(&self.args);
 
         if let Some(current_dir) = &self.current_dir {
             command.current_dir(current_dir);

---- claude_jsonl_command_accepts_execution_controls stdout ----

thread 'claude_jsonl_command_accepts_execution_controls' panicked at crates/agent/tests/adapters.rs:114:5:
assertion `left == right` failed
  left: None
 right: Some("/tmp/manual")

failures:
    claude_jsonl_command_accepts_execution_controls

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
