*** crates/app/src/lib.rs:4:5: replace run -> String with String::new()

*** mutation diff:
--- crates/app/src/lib.rs
+++ replace run -> String with String::new()
@@ -1,11 +1,5 @@
 use manual_core::workspace_descriptor;
 
 pub fn run() -> String {
-    let descriptor = workspace_descriptor();
-
-    format!(
-        "{} app is ready with {} workspace packages",
-        descriptor.name,
-        descriptor.packages.len()
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
