*** crates/sandbox-registry/src/lib.rs:283:9: replace StoredSandboxDocument::into_registry -> Result<SandboxRegistry, SandboxStoreError> with Ok(Default::default())

*** mutation diff:
--- crates/sandbox-registry/src/lib.rs
+++ replace StoredSandboxDocument::into_registry -> Result<SandboxRegistry, SandboxStoreError> with Ok(Default::default())
@@ -275,25 +275,17 @@
             sandboxes: registry
                 .iter()
                 .map(StoredSandboxDefinition::from_definition)
                 .collect(),
         }
     }
 
     fn into_registry(self) -> Result<SandboxRegistry, SandboxStoreError> {
-        let mut registry = SandboxRegistry::new();
-
-        for definition in self.sandboxes {
-            registry
-                .insert(definition.into_definition()?)
-                .map_err(SandboxStoreError::Registry)?;
-        }
-
-        Ok(registry)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, Serialize, Deserialize)]
 struct StoredSandboxDefinition {
     id: String,
     policy: StoredSandboxPolicy,
 }

---- file_store_reloads_saved_registry_from_disk stdout ----

thread 'file_store_reloads_saved_registry_from_disk' panicked at crates/sandbox-registry/tests/registry.rs:85:46:
called `Result::unwrap()` on an `Err` value: UnknownId(SandboxId("read-only"))

failures:
    file_store_reloads_saved_registry_from_disk

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
