*** crates/app/src/main.rs:2:5: replace main with ()

*** mutation diff:
--- crates/app/src/main.rs
+++ replace main with ()
@@ -1,3 +1,3 @@
 fn main() {
-    println!("{}", app::run());
+    () /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
