*** crates/sandbox/src/lib.rs:160:5: replace workspace_entries -> Vec<FilesystemEntry> with vec![]

*** mutation diff:
--- crates/sandbox/src/lib.rs
+++ replace workspace_entries -> Vec<FilesystemEntry> with vec![]
@@ -152,26 +152,17 @@
             network: NetworkPolicy {
                 mode: NetworkMode::Enabled,
             },
         }
     }
 }
 
 fn workspace_entries(workspace_root: PathBuf, access: FilesystemAccess) -> Vec<FilesystemEntry> {
-    let mut entries = vec![FilesystemEntry::new(workspace_root.clone(), access)];
-
-    for protected in PROTECTED_METADATA_DIRS {
-        entries.push(FilesystemEntry::new(
-            workspace_root.join(protected),
-            FilesystemAccess::None,
-        ));
-    }
-
-    entries
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub struct CommandSpec {
     pub program: String,
     pub args: Vec<String>,
     pub current_dir: Option<PathBuf>,
     pub env: BTreeMap<String, String>,

---- compiles_macos_read_only_to_fixed_sandbox_exec_plan stdout ----

thread 'compiles_macos_read_only_to_fixed_sandbox_exec_plan' panicked at crates/sandbox/tests/sandbox_policy.rs:110:5:
assertion failed: plan.args[1].contains("/workspace/.git")

---- compiles_linux_workspace_write_to_bubblewrap_plan stdout ----

thread 'compiles_linux_workspace_write_to_bubblewrap_plan' panicked at crates/sandbox/tests/sandbox_policy.rs:148:5:
assertion failed: plan.args.windows(2).any(|pair| pair == ["--bind", "/workspace"])

---- compiles_windows_workspace_write_to_restricted_token_plan stdout ----

thread 'compiles_windows_workspace_write_to_restricted_token_plan' panicked at crates/sandbox/tests/sandbox_policy.rs:193:5:
assertion failed: plan.args.iter().any(|arg| arg == "--allow-write")

failures:
    compiles_linux_workspace_write_to_bubblewrap_plan
    compiles_macos_read_only_to_fixed_sandbox_exec_plan
    compiles_windows_workspace_write_to_restricted_token_plan
    read_only_preset_is_restricted_and_protects_metadata
    workspace_write_preset_allows_workspace_write_but_keeps_metadata_denied

test result: FAILED. 12 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
