*** crates/sandbox/src/lib.rs:258:9: replace <impl fmt::Display for SandboxError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/sandbox/src/lib.rs
+++ replace <impl fmt::Display for SandboxError>::fmt -> fmt::Result with Ok(Default::default())
@@ -250,30 +250,17 @@
         detail: String,
     },
     UnsupportedPlatform(String),
     Io(String),
 }
 
 impl fmt::Display for SandboxError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::BackendUnavailable {
-                backend,
-                platform,
-                detail,
-            } => write!(
-                f,
-                "sandbox backend {backend:?} is unavailable on {platform:?}: {detail}"
-            ),
-            Self::UnsupportedPlatform(platform) => {
-                write!(f, "unsupported sandbox platform: {platform}")
-            }
-            Self::Io(message) => write!(f, "sandbox process failed: {message}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for SandboxError {}
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub struct SandboxRunner {
     platform: Platform,

---- sandbox_errors_have_actionable_display_messages stdout ----

thread 'sandbox_errors_have_actionable_display_messages' panicked at crates/sandbox/tests/sandbox_policy.rs:287:5:
assertion `left == right` failed
  left: ""
 right: "sandbox backend LinuxBubblewrap is unavailable on Linux: missing bwrap"

failures:
    sandbox_errors_have_actionable_display_messages

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
