*** crates/sandbox/src/lib.rs:315:26: replace == with != in SandboxRunner::compile

*** mutation diff:
--- crates/sandbox/src/lib.rs
+++ replace == with != in SandboxRunner::compile
@@ -307,17 +307,17 @@
         backend_report(self.platform, self.backend_available)
     }
 
     pub fn compile(
         &self,
         command: &CommandSpec,
         policy: &SandboxPolicy,
     ) -> Result<CompiledSandboxPlan, SandboxError> {
-        if policy.preset == SandboxPreset::DangerFullAccess {
+        if policy.preset != /* ~ changed by cargo-mutants ~ */ SandboxPreset::DangerFullAccess {
             return Ok(CompiledSandboxPlan {
                 backend: BackendReport {
                     platform: self.platform,
                     kind: BackendKind::Direct,
                     available: true,
                     detail: "sandbox disabled by explicit danger-full-access policy".to_string(),
                 },
                 program: command.program.clone(),

---- compiles_windows_network_policy_into_runner_flags stdout ----

thread 'compiles_windows_network_policy_into_runner_flags' panicked at crates/sandbox/tests/sandbox_policy.rs:205:5:
assertion failed: restricted_plan.args.iter().any(|arg| arg == "--deny-network")

---- compiles_macos_network_enabled_policy_to_network_allow_rule stdout ----

thread 'compiles_macos_network_enabled_policy_to_network_allow_rule' panicked at crates/sandbox/tests/sandbox_policy.rs:122:34:
index out of bounds: the len is 0 but the index is 1

---- compiles_windows_workspace_write_to_restricted_token_plan stdout ----

thread 'compiles_windows_workspace_write_to_restricted_token_plan' panicked at crates/sandbox/tests/sandbox_policy.rs:190:5:
assertion `left == right` failed
  left: Direct
 right: WindowsRestrictedToken

failures:
    compiles_danger_full_access_to_direct_process
    compiles_linux_workspace_write_to_bubblewrap_plan
    compiles_macos_network_enabled_policy_to_network_allow_rule
    compiles_macos_read_only_to_fixed_sandbox_exec_plan
    compiles_windows_network_policy_into_runner_flags
    compiles_windows_workspace_write_to_restricted_token_plan
    direct_process_run_captures_output_and_status
    direct_process_run_passes_stdin_to_child_process
    enforced_policy_does_not_silently_fall_back_when_backend_is_missing

test result: FAILED. 8 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
