*** crates/cli/src/lib.rs:32:5: replace run -> Result<String, CliError> with Ok("xyzzy".into())

*** mutation diff:
--- crates/cli/src/lib.rs
+++ replace run -> Result<String, CliError> with Ok("xyzzy".into())
@@ -24,28 +24,17 @@
 
 impl std::error::Error for CliError {}
 
 pub fn run<I, S>(args: I) -> Result<String, CliError>
 where
     I: IntoIterator<Item = S>,
     S: AsRef<str>,
 {
-    let mut args = args.into_iter();
-    let _program = args.next();
-    let command = args.next().ok_or(CliError::MissingCommand)?;
-
-    match command.as_ref() {
-        "about" => Ok(about()),
-        "validate-skill" => {
-            let path = args.next().ok_or(CliError::MissingPath)?;
-            validate_skill(Path::new(path.as_ref()))
-        }
-        other => Err(CliError::UnknownCommand(other.to_string())),
-    }
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn about() -> String {
     let descriptor = workspace_descriptor();
 
     format!(
         "{} workspace packages: {}",
         descriptor.name,

---- tests::about_command_reports_workspace stdout ----

thread 'tests::about_command_reports_workspace' panicked at crates/cli/src/lib.rs:63:9:
assertion failed: output.contains("manual workspace packages")

failures:
    tests::about_command_reports_workspace

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
