*** crates/cli/src/lib.rs:47:5: replace about -> String with "xyzzy".into()

*** mutation diff:
--- crates/cli/src/lib.rs
+++ replace about -> String with "xyzzy".into()
@@ -39,23 +39,17 @@
             let path = args.next().ok_or(CliError::MissingPath)?;
             validate_skill(Path::new(path.as_ref()))
         }
         other => Err(CliError::UnknownCommand(other.to_string())),
     }
 }
 
 pub fn about() -> String {
-    let descriptor = workspace_descriptor();
-
-    format!(
-        "{} workspace packages: {}",
-        descriptor.name,
-        descriptor.packages.join(", ")
-    )
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn validate_skill(path: &Path) -> Result<String, CliError> {
     let skill_file = path.join("SKILL.md");
 
     if !skill_file.is_file() {
         return Err(CliError::MissingSkillFile(path.display().to_string()));
     }

---- tests::about_command_reports_workspace stdout ----

thread 'tests::about_command_reports_workspace' panicked at crates/cli/src/lib.rs:68:9:
assertion failed: output.contains("manual workspace packages")

failures:
    tests::about_command_reports_workspace

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
