*** crates/sandbox/src/lib.rs:346:61: replace && with || in SandboxRunner::run

*** mutation diff:
--- crates/sandbox/src/lib.rs
+++ replace && with || in SandboxRunner::run
@@ -338,17 +338,17 @@
 
     pub fn run(
         &self,
         command: &CommandSpec,
         policy: &SandboxPolicy,
     ) -> Result<SandboxResult, SandboxError> {
         let plan = self.compile(command, policy)?;
 
-        if policy.preset != SandboxPreset::DangerFullAccess && !plan.backend.available {
+        if policy.preset != SandboxPreset::DangerFullAccess || /* ~ changed by cargo-mutants ~ */ !plan.backend.available {
             return Err(SandboxError::BackendUnavailable {
                 backend: plan.backend.kind,
                 platform: plan.backend.platform,
                 detail: plan.backend.detail,
             });
         }
 
         let mut process = Command::new(&plan.program);

---- enforced_policy_marked_available_attempts_the_backend_process stdout ----

thread 'enforced_policy_marked_available_attempts_the_backend_process' panicked at crates/sandbox/tests/sandbox_policy.rs:244:5:
expected the backend process to be attempted, got Err(BackendUnavailable { backend: MacosSeatbelt, platform: Macos, detail: "requires /usr/bin/sandbox-exec and generated SBPL policy" })

failures:
    enforced_policy_marked_available_attempts_the_backend_process

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
