*** crates/sandbox/src/lib.rs:346:64: delete ! in SandboxRunner::run

*** mutation diff:
--- crates/sandbox/src/lib.rs
+++ delete ! in SandboxRunner::run
@@ -338,17 +338,17 @@
 
     pub fn run(
         &self,
         command: &CommandSpec,
         policy: &SandboxPolicy,
     ) -> Result<SandboxResult, SandboxError> {
         let plan = self.compile(command, policy)?;
 
-        if policy.preset != SandboxPreset::DangerFullAccess && !plan.backend.available {
+        if policy.preset != SandboxPreset::DangerFullAccess &&  /* ~ changed by cargo-mutants ~ */plan.backend.available {
             return Err(SandboxError::BackendUnavailable {
                 backend: plan.backend.kind,
                 platform: plan.backend.platform,
                 detail: plan.backend.detail,
             });
         }
 
         let mut process = Command::new(&plan.program);

---- enforced_policy_marked_available_attempts_the_backend_process stdout ----

thread 'enforced_policy_marked_available_attempts_the_backend_process' panicked at crates/sandbox/tests/sandbox_policy.rs:244:5:
expected the backend process to be attempted, got Err(BackendUnavailable { backend: MacosSeatbelt, platform: Macos, detail: "requires /usr/bin/sandbox-exec and generated SBPL policy" })

---- enforced_policy_does_not_silently_fall_back_when_backend_is_missing stdout ----

thread 'enforced_policy_does_not_silently_fall_back_when_backend_is_missing' panicked at crates/sandbox/tests/sandbox_policy.rs:227:5:
assertion failed: matches!(result,
    Err(SandboxError::BackendUnavailable
    { backend: BackendKind::LinuxBubblewrap, .. }))

failures:
    enforced_policy_does_not_silently_fall_back_when_backend_is_missing
    enforced_policy_marked_available_attempts_the_backend_process

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
