*** crates/graph-viewer/src/app.rs:106:9: replace GraphViewerApp::draw_graph with ()

*** mutation diff:
--- crates/graph-viewer/src/app.rs
+++ replace GraphViewerApp::draw_graph with ()
@@ -98,22 +98,17 @@
                     Color32::from_rgb(218, 154, 74),
                     format!("Watcher unavailable: {problem}"),
                 );
             }
         });
     }
 
     fn draw_graph(&mut self, ui: &mut Ui) {
-        let Some(graph) = &self.graph else {
-            self.view.empty_ui(ui, "No graph loaded");
-            return;
-        };
-
-        self.view.ui(ui, graph, &self.layout);
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl eframe::App for GraphViewerApp {
     fn update(&mut self, ctx: &egui::Context, _frame: &mut eframe::Frame) {
         self.apply_pending_file_changes();
 
         egui::TopBottomPanel::top("graph_viewer_toolbar")

---- app::tests::update_paints_toolbar_and_graph_canvas stdout ----

thread 'app::tests::update_paints_toolbar_and_graph_canvas' panicked at crates/graph-viewer/src/app.rs:374:9:
graph node should be painted by the central graph view

failures:
    app::tests::update_paints_toolbar_and_graph_canvas

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
