*** crates/sandbox/src/lib.rs:420:5: replace backend_available -> bool with true

*** mutation diff:
--- crates/sandbox/src/lib.rs
+++ replace backend_available -> bool with true
@@ -412,22 +412,17 @@
         platform,
         kind,
         available,
         detail: detail.to_string(),
     }
 }
 
 fn backend_available(platform: Platform) -> bool {
-    match platform {
-        Platform::Macos => Path::new("/usr/bin/sandbox-exec").is_file(),
-        Platform::Linux => command_exists("bwrap"),
-        Platform::Windows => false,
-        Platform::Unsupported(_) => false,
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn command_exists(program: &str) -> bool {
     let Some(path) = std::env::var_os("PATH") else {
         return false;
     };
 
     std::env::split_paths(&path).any(|dir| dir.join(program).is_file())

---- tests::unavailable_backend_platforms_report_unavailable stdout ----

thread 'tests::unavailable_backend_platforms_report_unavailable' panicked at crates/sandbox/src/lib.rs:712:9:
assertion failed: !backend_available(Platform::Windows)

---- tests::linux_backend_availability_follows_path_lookup stdout ----

thread 'tests::linux_backend_availability_follows_path_lookup' panicked at crates/sandbox/src/lib.rs:704:9:
assertion failed: !backend_available(Platform::Linux)

failures:
    tests::linux_backend_availability_follows_path_lookup
    tests::unavailable_backend_platforms_report_unavailable

test result: FAILED. 0 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
