*** crates/graph-viewer/src/app.rs:117:9: replace <impl eframe::App for GraphViewerApp>::update with ()

*** mutation diff:
--- crates/graph-viewer/src/app.rs
+++ replace <impl eframe::App for GraphViewerApp>::update with ()
@@ -109,30 +109,17 @@
         };
 
         self.view.ui(ui, graph, &self.layout);
     }
 }
 
 impl eframe::App for GraphViewerApp {
     fn update(&mut self, ctx: &egui::Context, _frame: &mut eframe::Frame) {
-        self.apply_pending_file_changes();
-
-        egui::TopBottomPanel::top("graph_viewer_toolbar")
-            .exact_height(42.0)
-            .show(ctx, |ui| {
-                ui.add_space(8.0);
-                self.draw_toolbar(ui);
-            });
-
-        egui::CentralPanel::default()
-            .frame(egui::Frame::NONE)
-            .show(ctx, |ui| {
-                self.draw_graph(ui);
-            });
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn watch_graph_file(
     graph_path: &Path,
     change_tx: Sender<()>,
     egui_ctx: egui::Context,
 ) -> notify::Result<RecommendedWatcher> {

---- app::tests::update_paints_toolbar_and_graph_canvas stdout ----

thread 'app::tests::update_paints_toolbar_and_graph_canvas' panicked at crates/graph-viewer/src/app.rs:249:9:
expected text shape containing "Manual Graph Viewer"

failures:
    app::tests::update_paints_toolbar_and_graph_canvas

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
