*** crates/graph-viewer/src/app.rs:151:5: replace watch_dir_for_graph_path -> PathBuf with Default::default()

*** mutation diff:
--- crates/graph-viewer/src/app.rs
+++ replace watch_dir_for_graph_path -> PathBuf with Default::default()
@@ -143,21 +143,17 @@
         handle_watch_event(event, &watched_file, &change_tx, &egui_ctx);
     })?;
 
     watcher.watch(&watch_dir, RecursiveMode::NonRecursive)?;
     Ok(watcher)
 }
 
 fn watch_dir_for_graph_path(graph_path: &Path) -> PathBuf {
-    graph_path
-        .parent()
-        .filter(|path| !path.as_os_str().is_empty())
-        .unwrap_or_else(|| Path::new("."))
-        .to_path_buf()
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn handle_watch_event(
     event: notify::Result<Event>,
     watched_file: &Path,
     change_tx: &Sender<()>,
     egui_ctx: &egui::Context,
 ) {

---- app::tests::watch_dir_for_graph_path_uses_parent_or_current_directory stdout ----

thread 'app::tests::watch_dir_for_graph_path_uses_parent_or_current_directory' panicked at crates/graph-viewer/src/app.rs:433:9:
assertion `left == right` failed
  left: ""
 right: "/tmp"

failures:
    app::tests::watch_dir_for_graph_path_uses_parent_or_current_directory

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
