*** crates/sandbox/src/lib.rs:429:5: replace command_exists -> bool with false

*** mutation diff:
--- crates/sandbox/src/lib.rs
+++ replace command_exists -> bool with false
@@ -421,21 +421,17 @@
         Platform::Macos => Path::new("/usr/bin/sandbox-exec").is_file(),
         Platform::Linux => command_exists("bwrap"),
         Platform::Windows => false,
         Platform::Unsupported(_) => false,
     }
 }
 
 fn command_exists(program: &str) -> bool {
-    let Some(path) = std::env::var_os("PATH") else {
-        return false;
-    };
-
-    std::env::split_paths(&path).any(|dir| dir.join(program).is_file())
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn compile_macos(
     command: &CommandSpec,
     policy: &SandboxPolicy,
     backend_available: bool,
 ) -> CompiledSandboxPlan {
     let sbpl = macos_sbpl(policy);

---- tests::linux_backend_availability_follows_path_lookup stdout ----

thread 'tests::linux_backend_availability_follows_path_lookup' panicked at crates/sandbox/src/lib.rs:698:9:
assertion failed: command_exists("bwrap")

failures:
    tests::linux_backend_availability_follows_path_lookup

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
