*** crates/graph-viewer/src/app.rs:153:24: delete ! in watch_dir_for_graph_path

*** mutation diff:
--- crates/graph-viewer/src/app.rs
+++ delete ! in watch_dir_for_graph_path
@@ -145,17 +145,17 @@
 
     watcher.watch(&watch_dir, RecursiveMode::NonRecursive)?;
     Ok(watcher)
 }
 
 fn watch_dir_for_graph_path(graph_path: &Path) -> PathBuf {
     graph_path
         .parent()
-        .filter(|path| !path.as_os_str().is_empty())
+        .filter(|path|  /* ~ changed by cargo-mutants ~ */path.as_os_str().is_empty())
         .unwrap_or_else(|| Path::new("."))
         .to_path_buf()
 }
 
 fn handle_watch_event(
     event: notify::Result<Event>,
     watched_file: &Path,
     change_tx: &Sender<()>,

---- app::tests::watch_dir_for_graph_path_uses_parent_or_current_directory stdout ----

thread 'app::tests::watch_dir_for_graph_path_uses_parent_or_current_directory' panicked at crates/graph-viewer/src/app.rs:437:9:
assertion `left == right` failed
  left: "."
 right: "/tmp"

failures:
    app::tests::watch_dir_for_graph_path_uses_parent_or_current_directory

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
