*** crates/graph-viewer/src/app.rs:164:5: replace handle_watch_event with ()

*** mutation diff:
--- crates/graph-viewer/src/app.rs
+++ replace handle_watch_event with ()
@@ -156,23 +156,17 @@
 }
 
 fn handle_watch_event(
     event: notify::Result<Event>,
     watched_file: &Path,
     change_tx: &Sender<()>,
     egui_ctx: &egui::Context,
 ) {
-    match event {
-        Ok(event) if event_touches_path(&event, watched_file) => {
-            let _ = change_tx.send(());
-            egui_ctx.request_repaint();
-        }
-        _ => {}
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn event_touches_path(event: &Event, graph_path: &Path) -> bool {
     event.paths.iter().any(|path| path == graph_path)
 }
 
 fn absolute_path(path: PathBuf) -> PathBuf {
     if path.is_absolute() {

---- app::tests::handle_watch_event_sends_change_only_for_matching_successful_events stdout ----

thread 'app::tests::handle_watch_event_sends_change_only_for_matching_successful_events' panicked at crates/graph-viewer/src/app.rs:418:9:
assertion `left == right` failed
  left: Err(Empty)
 right: Ok(())

failures:
    app::tests::handle_watch_event_sends_change_only_for_matching_successful_events

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
