*** crates/sandbox/src/lib.rs:461:5: replace macos_sbpl -> String with "xyzzy".into()

*** mutation diff:
--- crates/sandbox/src/lib.rs
+++ replace macos_sbpl -> String with "xyzzy".into()
@@ -453,55 +453,17 @@
         args,
         current_dir: command.current_dir.clone(),
         env: command.env.clone(),
         stdin: command.stdin.clone(),
     }
 }
 
 fn macos_sbpl(policy: &SandboxPolicy) -> String {
-    let mut policy_lines = vec![
-        "(version 1)".to_string(),
-        "(deny default)".to_string(),
-        "(allow process*)".to_string(),
-        "(allow sysctl*)".to_string(),
-        "(allow file-read-metadata)".to_string(),
-        "(allow file-read-data (literal \"/\"))".to_string(),
-    ];
-
-    for path in MACOS_RUNTIME_READ_PATHS {
-        let quoted = sbpl_quote_path(Path::new(path));
-        policy_lines.push(format!(
-            "(allow file-read* file-map-executable (subpath {quoted}))"
-        ));
-    }
-
-    for entry in &policy.filesystem.entries {
-        let quoted = sbpl_quote_path(&entry.path);
-        match entry.access {
-            FilesystemAccess::Read => {
-                policy_lines.push(format!("(allow file-read* (subpath {quoted}))"));
-                policy_lines.push(format!("(allow file-map-executable (subpath {quoted}))"));
-            }
-            FilesystemAccess::Write => {
-                policy_lines.push(format!("(allow file-read* (subpath {quoted}))"));
-                policy_lines.push(format!("(allow file-write* (subpath {quoted}))"));
-                policy_lines.push(format!("(allow file-map-executable (subpath {quoted}))"));
-            }
-            FilesystemAccess::None => {
-                policy_lines.push(format!("(deny file-read* file-write* (subpath {quoted}))"));
-            }
-        }
-    }
-
-    if policy.network.mode == NetworkMode::Enabled {
-        policy_lines.push("(allow network*)".to_string());
-    }
-
-    policy_lines.join("\n")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn sbpl_quote_path(path: &Path) -> String {
     let normalized = path.display().to_string().replace('\\', "/");
 
     format!(
         "\"{}\"",
         normalized.replace('\\', "\\\\").replace('"', "\\\"")

---- compiles_macos_read_only_to_fixed_sandbox_exec_plan stdout ----

thread 'compiles_macos_read_only_to_fixed_sandbox_exec_plan' panicked at crates/sandbox/tests/sandbox_policy.rs:108:5:
assertion failed: plan.args[1].contains("(deny default)")

---- compiles_macos_network_enabled_policy_to_network_allow_rule stdout ----

thread 'compiles_macos_network_enabled_policy_to_network_allow_rule' panicked at crates/sandbox/tests/sandbox_policy.rs:130:5:
assertion failed: enabled_plan.args[1].contains("(allow network*)")

failures:
    compiles_macos_network_enabled_policy_to_network_allow_rule
    compiles_macos_read_only_to_fixed_sandbox_exec_plan

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
