*** crates/graph-viewer/src/app.rs:165:22: replace match guard event_touches_path(&event, watched_file) with true in handle_watch_event

*** mutation diff:
--- crates/graph-viewer/src/app.rs
+++ replace match guard event_touches_path(&event, watched_file) with true in handle_watch_event
@@ -157,17 +157,17 @@
 
 fn handle_watch_event(
     event: notify::Result<Event>,
     watched_file: &Path,
     change_tx: &Sender<()>,
     egui_ctx: &egui::Context,
 ) {
     match event {
-        Ok(event) if event_touches_path(&event, watched_file) => {
+        Ok(event) if true /* ~ changed by cargo-mutants ~ */ => {
             let _ = change_tx.send(());
             egui_ctx.request_repaint();
         }
         _ => {}
     }
 }
 
 fn event_touches_path(event: &Event, graph_path: &Path) -> bool {

---- app::tests::handle_watch_event_sends_change_only_for_matching_successful_events stdout ----

thread 'app::tests::handle_watch_event_sends_change_only_for_matching_successful_events' panicked at crates/graph-viewer/src/app.rs:416:9:
assertion failed: change_rx.try_recv().is_err()

failures:
    app::tests::handle_watch_event_sends_change_only_for_matching_successful_events

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
