*** crates/sandbox/src/lib.rs:495:28: replace == with != in macos_sbpl

*** mutation diff:
--- crates/sandbox/src/lib.rs
+++ replace == with != in macos_sbpl
@@ -487,17 +487,17 @@
                 policy_lines.push(format!("(allow file-map-executable (subpath {quoted}))"));
             }
             FilesystemAccess::None => {
                 policy_lines.push(format!("(deny file-read* file-write* (subpath {quoted}))"));
             }
         }
     }
 
-    if policy.network.mode == NetworkMode::Enabled {
+    if policy.network.mode != /* ~ changed by cargo-mutants ~ */ NetworkMode::Enabled {
         policy_lines.push("(allow network*)".to_string());
     }
 
     policy_lines.join("\n")
 }
 
 fn sbpl_quote_path(path: &Path) -> String {
     let normalized = path.display().to_string().replace('\\', "/");

---- compiles_macos_network_enabled_policy_to_network_allow_rule stdout ----

thread 'compiles_macos_network_enabled_policy_to_network_allow_rule' panicked at crates/sandbox/tests/sandbox_policy.rs:122:5:
assertion failed: !restricted_plan.args[1].contains("(allow network*)")

failures:
    compiles_macos_network_enabled_policy_to_network_allow_rule

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
