*** crates/sandbox/src/lib.rs:503:5: replace sbpl_quote_path -> String with String::new()

*** mutation diff:
--- crates/sandbox/src/lib.rs
+++ replace sbpl_quote_path -> String with String::new()
@@ -495,22 +495,17 @@
     if policy.network.mode == NetworkMode::Enabled {
         policy_lines.push("(allow network*)".to_string());
     }
 
     policy_lines.join("\n")
 }
 
 fn sbpl_quote_path(path: &Path) -> String {
-    let normalized = path.display().to_string().replace('\\', "/");
-
-    format!(
-        "\"{}\"",
-        normalized.replace('\\', "\\\\").replace('"', "\\\"")
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn compile_linux(
     command: &CommandSpec,
     policy: &SandboxPolicy,
     backend_available: bool,
 ) -> CompiledSandboxPlan {
     let mut args = vec![

---- compiles_macos_read_only_to_fixed_sandbox_exec_plan stdout ----

thread 'compiles_macos_read_only_to_fixed_sandbox_exec_plan' panicked at crates/sandbox/tests/sandbox_policy.rs:110:5:
assertion failed: plan.args[1].contains("/workspace/.git")

failures:
    compiles_macos_read_only_to_fixed_sandbox_exec_plan

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
