*** crates/graph-viewer/src/app.rs:174:5: replace event_touches_path -> bool with true

*** mutation diff:
--- crates/graph-viewer/src/app.rs
+++ replace event_touches_path -> bool with true
@@ -166,17 +166,17 @@
             let _ = change_tx.send(());
             egui_ctx.request_repaint();
         }
         _ => {}
     }
 }
 
 fn event_touches_path(event: &Event, graph_path: &Path) -> bool {
-    event.paths.iter().any(|path| path == graph_path)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn absolute_path(path: PathBuf) -> PathBuf {
     if path.is_absolute() {
         return path;
     }
 
     std::env::current_dir()

---- app::tests::event_touches_path_matches_any_exact_event_path stdout ----

thread 'app::tests::event_touches_path_matches_any_exact_event_path' panicked at crates/graph-viewer/src/app.rs:400:9:
assertion failed: !event_touches_path(&unrelated_event, &graph_path)

---- app::tests::handle_watch_event_sends_change_only_for_matching_successful_events stdout ----

thread 'app::tests::handle_watch_event_sends_change_only_for_matching_successful_events' panicked at crates/graph-viewer/src/app.rs:416:9:
assertion failed: change_rx.try_recv().is_err()

failures:
    app::tests::event_touches_path_matches_any_exact_event_path
    app::tests::handle_watch_event_sends_change_only_for_matching_successful_events

test result: FAILED. 17 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
