*** crates/sandbox/src/lib.rs:557:40: replace || with && in compile_linux

*** mutation diff:
--- crates/sandbox/src/lib.rs
+++ replace || with && in compile_linux
@@ -549,17 +549,17 @@
                 args.push(sandbox_path);
             }
             FilesystemAccess::Write => {
                 args.push("--bind".to_string());
                 args.push(sandbox_path.clone());
                 args.push(sandbox_path);
             }
             FilesystemAccess::None => {
-                if entry.path.exists() || path_is_under_writable_entry(policy, &entry.path) {
+                if entry.path.exists() && /* ~ changed by cargo-mutants ~ */ path_is_under_writable_entry(policy, &entry.path) {
                     args.push("--tmpfs".to_string());
                     args.push(sandbox_path.clone());
                     args.push("--remount-ro".to_string());
                     args.push(sandbox_path);
                 }
             }
         }
     }

---- compiles_linux_workspace_write_to_bubblewrap_plan stdout ----

thread 'compiles_linux_workspace_write_to_bubblewrap_plan' panicked at crates/sandbox/tests/sandbox_policy.rs:153:5:
assertion failed: plan.args.windows(2).any(|pair| pair == ["--tmpfs", "/workspace/.git"])

failures:
    compiles_linux_workspace_write_to_bubblewrap_plan

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
