*** crates/graph-viewer/src/app.rs:178:5: replace absolute_path -> PathBuf with Default::default()

*** mutation diff:
--- crates/graph-viewer/src/app.rs
+++ replace absolute_path -> PathBuf with Default::default()
@@ -170,23 +170,17 @@
     }
 }
 
 fn event_touches_path(event: &Event, graph_path: &Path) -> bool {
     event.paths.iter().any(|path| path == graph_path)
 }
 
 fn absolute_path(path: PathBuf) -> PathBuf {
-    if path.is_absolute() {
-        return path;
-    }
-
-    std::env::current_dir()
-        .map(|current_dir| current_dir.join(&path))
-        .unwrap_or(path)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn abbreviate(value: &str, max_chars: usize) -> String {
     let mut chars = value.chars();
     let shortened: String = chars.by_ref().take(max_chars).collect();
 
     if chars.next().is_some() {
         format!("{shortened}...")

---- app::tests::absolute_path_preserves_absolute_paths_and_resolves_relative_paths stdout ----

thread 'app::tests::absolute_path_preserves_absolute_paths_and_resolves_relative_paths' panicked at crates/graph-viewer/src/app.rs:448:9:
assertion `left == right` failed
  left: ""
 right: "/tmp/manual-graph.json"

failures:
    app::tests::absolute_path_preserves_absolute_paths_and_resolves_relative_paths

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
