*** crates/sandbox/src/lib.rs:597:28: replace == with != in compile_windows

*** mutation diff:
--- crates/sandbox/src/lib.rs
+++ replace == with != in compile_windows
@@ -589,17 +589,17 @@
         match entry.access {
             FilesystemAccess::Read => args.push("--allow-read".to_string()),
             FilesystemAccess::Write => args.push("--allow-write".to_string()),
             FilesystemAccess::None => args.push("--deny".to_string()),
         }
         args.push(entry.path.display().to_string());
     }
 
-    if policy.network.mode == NetworkMode::Restricted {
+    if policy.network.mode != /* ~ changed by cargo-mutants ~ */ NetworkMode::Restricted {
         args.push("--deny-network".to_string());
     }
 
     args.push("--".to_string());
     args.push(command.program.clone());
     args.extend(command.args.clone());
 
     CompiledSandboxPlan {

---- compiles_windows_network_policy_into_runner_flags stdout ----

thread 'compiles_windows_network_policy_into_runner_flags' panicked at crates/sandbox/tests/sandbox_policy.rs:205:5:
assertion failed: restricted_plan.args.iter().any(|arg| arg == "--deny-network")

failures:
    compiles_windows_network_policy_into_runner_flags

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
