*** crates/graph-viewer/src/app.rs:188:5: replace abbreviate -> String with String::new()

*** mutation diff:
--- crates/graph-viewer/src/app.rs
+++ replace abbreviate -> String with String::new()
@@ -180,24 +180,17 @@
     }
 
     std::env::current_dir()
         .map(|current_dir| current_dir.join(&path))
         .unwrap_or(path)
 }
 
 fn abbreviate(value: &str, max_chars: usize) -> String {
-    let mut chars = value.chars();
-    let shortened: String = chars.by_ref().take(max_chars).collect();
-
-    if chars.next().is_some() {
-        format!("{shortened}...")
-    } else {
-        shortened
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use std::fs;
     use std::time::{SystemTime, UNIX_EPOCH};

---- app::tests::abbreviate_preserves_short_paths_and_truncates_long_paths stdout ----

thread 'app::tests::abbreviate_preserves_short_paths_and_truncates_long_paths' panicked at crates/graph-viewer/src/app.rs:460:9:
assertion `left == right` failed
  left: ""
 right: "short"

failures:
    app::tests::abbreviate_preserves_short_paths_and_truncates_long_paths

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
