*** crates/sandbox/src/lib.rs:616:5: replace path_is_under_writable_entry -> bool with false

*** mutation diff:
--- crates/sandbox/src/lib.rs
+++ replace path_is_under_writable_entry -> bool with false
@@ -608,26 +608,17 @@
         args,
         current_dir: command.current_dir.clone(),
         env: command.env.clone(),
         stdin: command.stdin.clone(),
     }
 }
 
 fn path_is_under_writable_entry(policy: &SandboxPolicy, path: &Path) -> bool {
-    let path = unix_path_arg(path);
-
-    policy.filesystem.entries.iter().any(|entry| {
-        let entry_path = unix_path_arg(&entry.path);
-        entry.access == FilesystemAccess::Write
-            && path != entry_path
-            && path
-                .strip_prefix(&entry_path)
-                .is_some_and(|suffix| suffix.starts_with('/'))
-    })
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn unix_path_arg(path: &Path) -> String {
     path.display().to_string().replace('\\', "/")
 }
 
 #[cfg(test)]
 mod tests {

---- compiles_linux_workspace_write_to_bubblewrap_plan stdout ----

thread 'compiles_linux_workspace_write_to_bubblewrap_plan' panicked at crates/sandbox/tests/sandbox_policy.rs:153:5:
assertion failed: plan.args.windows(2).any(|pair| pair == ["--tmpfs", "/workspace/.git"])

failures:
    compiles_linux_workspace_write_to_bubblewrap_plan

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
