*** crates/graph-viewer/src/app.rs:45:9: replace GraphViewerApp::reload_graph with ()

*** mutation diff:
--- crates/graph-viewer/src/app.rs
+++ replace GraphViewerApp::reload_graph with ()
@@ -37,32 +37,17 @@
             _watcher: watcher.ok(),
         };
 
         app.reload_graph();
         app
     }
 
     fn reload_graph(&mut self) {
-        match load_graph_file(&self.graph_path) {
-            Ok(graph) => {
-                self.layout = circular_layout(&graph);
-                self.status = format!(
-                    "{} nodes, {} edges loaded",
-                    graph.nodes().len(),
-                    graph.edges().len()
-                );
-                self.graph = Some(graph);
-                self.last_error = None;
-            }
-            Err(error) => {
-                self.status = format!("Load error: {error}");
-                self.last_error = Some(error.to_string());
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn apply_pending_file_changes(&mut self) {
         let mut changed = false;
         while self.change_rx.try_recv().is_ok() {
             changed = true;
         }

---- app::tests::reload_graph_records_error_and_keeps_previous_graph stdout ----

thread 'app::tests::reload_graph_records_error_and_keeps_previous_graph' panicked at crates/graph-viewer/src/app.rs:303:18:
previous graph should remain available

---- app::tests::reload_graph_loads_graph_layout_and_success_status stdout ----

thread 'app::tests::reload_graph_loads_graph_layout_and_success_status' panicked at crates/graph-viewer/src/app.rs:278:40:
graph should load

---- app::tests::apply_pending_file_changes_reloads_latest_json_once_events_arrive stdout ----

thread 'app::tests::apply_pending_file_changes_reloads_latest_json_once_events_arrive' panicked at crates/graph-viewer/src/app.rs:327:18:
initial graph should remain loaded

failures:
    app::tests::apply_pending_file_changes_reloads_latest_json_once_events_arrive
    app::tests::reload_graph_loads_graph_layout_and_success_status
    app::tests::reload_graph_records_error_and_keeps_previous_graph
    app::tests::update_paints_toolbar_and_graph_canvas

test result: FAILED. 15 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
