*** crates/graph-viewer/src/app.rs:64:9: replace GraphViewerApp::apply_pending_file_changes with ()

*** mutation diff:
--- crates/graph-viewer/src/app.rs
+++ replace GraphViewerApp::apply_pending_file_changes with ()
@@ -56,24 +56,17 @@
             Err(error) => {
                 self.status = format!("Load error: {error}");
                 self.last_error = Some(error.to_string());
             }
         }
     }
 
     fn apply_pending_file_changes(&mut self) {
-        let mut changed = false;
-        while self.change_rx.try_recv().is_ok() {
-            changed = true;
-        }
-
-        if changed {
-            self.reload_graph();
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn draw_toolbar(&mut self, ui: &mut Ui) {
         ui.horizontal_wrapped(|ui| {
             ui.strong("Manual Graph Viewer");
             ui.separator();
             ui.monospace(abbreviate(&self.graph_path.display().to_string(), 96))
                 .on_hover_text(self.graph_path.display().to_string());

---- app::tests::apply_pending_file_changes_reloads_latest_json_once_events_arrive stdout ----

thread 'app::tests::apply_pending_file_changes_reloads_latest_json_once_events_arrive' panicked at crates/graph-viewer/src/app.rs:347:9:
assertion `left == right` failed
  left: "before"
 right: "after"

failures:
    app::tests::apply_pending_file_changes_reloads_latest_json_once_events_arrive

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
