*** crates/graph-viewer/src/app.rs:75:9: replace GraphViewerApp::draw_toolbar with ()

*** mutation diff:
--- crates/graph-viewer/src/app.rs
+++ replace GraphViewerApp::draw_toolbar with ()
@@ -67,44 +67,17 @@
         }
 
         if changed {
             self.reload_graph();
         }
     }
 
     fn draw_toolbar(&mut self, ui: &mut Ui) {
-        ui.horizontal_wrapped(|ui| {
-            ui.strong("Manual Graph Viewer");
-            ui.separator();
-            ui.monospace(abbreviate(&self.graph_path.display().to_string(), 96))
-                .on_hover_text(self.graph_path.display().to_string());
-            ui.separator();
-
-            self.view.zoom_controls(ui);
-            ui.separator();
-
-            if ui.button("Reload").clicked() {
-                self.reload_graph();
-            }
-
-            let status_color = if self.last_error.is_some() {
-                Color32::from_rgb(220, 82, 72)
-            } else {
-                Color32::from_rgb(90, 145, 94)
-            };
-            ui.colored_label(status_color, &self.status);
-
-            if let Some(problem) = &self.watcher_problem {
-                ui.colored_label(
-                    Color32::from_rgb(218, 154, 74),
-                    format!("Watcher unavailable: {problem}"),
-                );
-            }
-        });
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn draw_graph(&mut self, ui: &mut Ui) {
         let Some(graph) = &self.graph else {
             self.view.empty_ui(ui, "No graph loaded");
             return;
         };

---- app::tests::update_paints_toolbar_and_graph_canvas stdout ----

thread 'app::tests::update_paints_toolbar_and_graph_canvas' panicked at crates/graph-viewer/src/app.rs:235:9:
expected text shape containing "Manual Graph Viewer"

failures:
    app::tests::update_paints_toolbar_and_graph_canvas

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
