*** crates/sandbox/src/lib.rs:621:21: replace != with == in path_is_under_writable_entry

*** mutation diff:
--- crates/sandbox/src/lib.rs
+++ replace != with == in path_is_under_writable_entry
@@ -613,17 +613,17 @@
 }
 
 fn path_is_under_writable_entry(policy: &SandboxPolicy, path: &Path) -> bool {
     let path = unix_path_arg(path);
 
     policy.filesystem.entries.iter().any(|entry| {
         let entry_path = unix_path_arg(&entry.path);
         entry.access == FilesystemAccess::Write
-            && path != entry_path
+            && path == /* ~ changed by cargo-mutants ~ */ entry_path
             && path
                 .strip_prefix(&entry_path)
                 .is_some_and(|suffix| suffix.starts_with('/'))
     })
 }
 
 fn unix_path_arg(path: &Path) -> String {
     path.display().to_string().replace('\\', "/")

---- compiles_linux_workspace_write_to_bubblewrap_plan stdout ----

thread 'compiles_linux_workspace_write_to_bubblewrap_plan' panicked at crates/sandbox/tests/sandbox_policy.rs:153:5:
assertion failed: plan.args.windows(2).any(|pair| pair == ["--tmpfs", "/workspace/.git"])

failures:
    compiles_linux_workspace_write_to_bubblewrap_plan

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
