*** crates/graph-viewer/src/lib.rs:102:9: replace Graph::nodes -> &[Node] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace Graph::nodes -> &[Node] with Vec::leak(Vec::new())
@@ -94,17 +94,17 @@
                 label: edge.label,
             });
         }
 
         Self::new(nodes, edges)
     }
 
     pub fn nodes(&self) -> &[Node] {
-        &self.nodes
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn edges(&self) -> &[Edge] {
         &self.edges
     }
 }
 
 fn validate_graph(nodes: &[Node], edges: &[Edge]) -> Result<(), GraphLoadError> {

---- app::tests::reload_graph_records_error_and_keeps_previous_graph stdout ----

thread 'app::tests::reload_graph_records_error_and_keeps_previous_graph' panicked at crates/graph-viewer/src/app.rs:316:13:
index out of bounds: the len is 0 but the index is 0

---- app::tests::apply_pending_file_changes_reloads_latest_json_once_events_arrive stdout ----

thread 'app::tests::apply_pending_file_changes_reloads_latest_json_once_events_arrive' panicked at crates/graph-viewer/src/app.rs:340:13:
index out of bounds: the len is 0 but the index is 0

---- app::tests::reload_graph_loads_graph_layout_and_success_status stdout ----

thread 'app::tests::reload_graph_loads_graph_layout_and_success_status' panicked at crates/graph-viewer/src/app.rs:294:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    app::tests::apply_pending_file_changes_reloads_latest_json_once_events_arrive
    app::tests::reload_graph_loads_graph_layout_and_success_status
    app::tests::reload_graph_records_error_and_keeps_previous_graph
    app::tests::update_paints_toolbar_and_graph_canvas
    view::tests::ui_allocates_canvas_and_paints_graph_shapes
    view::tests::ui_places_node_and_edge_labels_at_expected_anchors
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions
    view::tests::ui_scales_node_positions_by_displayed_zoom

test result: FAILED. 11 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
