*** crates/graph-viewer/src/lib.rs:106:9: replace Graph::edges -> &[Edge] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace Graph::edges -> &[Edge] with Vec::leak(Vec::new())
@@ -98,17 +98,17 @@
         Self::new(nodes, edges)
     }
 
     pub fn nodes(&self) -> &[Node] {
         &self.nodes
     }
 
     pub fn edges(&self) -> &[Edge] {
-        &self.edges
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn validate_graph(nodes: &[Node], edges: &[Edge]) -> Result<(), GraphLoadError> {
     let mut ids = BTreeSet::new();
 
     for node in nodes {
         if !ids.insert(node.id.clone()) {

---- view::tests::ui_places_node_and_edge_labels_at_expected_anchors stdout ----

thread 'view::tests::ui_places_node_and_edge_labels_at_expected_anchors' panicked at crates/graph-viewer/src/view.rs:459:32:
expected text shape containing "connects"

---- view::tests::ui_allocates_canvas_and_paints_graph_shapes stdout ----

thread 'view::tests::ui_allocates_canvas_and_paints_graph_shapes' panicked at crates/graph-viewer/src/view.rs:539:9:
assertion failed: shapes.iter().any(|shape|
        matches!(shape, Shape::LineSegment { stroke, .. } if stroke.color ==
            Color32::from_rgb(116, 125, 136)))

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:571:9:
assertion `left == right` failed: edge plus two arrow-head strokes
  left: 0
 right: 3

failures:
    app::tests::reload_graph_loads_graph_layout_and_success_status
    view::tests::ui_allocates_canvas_and_paints_graph_shapes
    view::tests::ui_places_node_and_edge_labels_at_expected_anchors
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions

test result: FAILED. 15 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
