*** crates/sandbox/src/lib.rs:629:5: replace unix_path_arg -> String with "xyzzy".into()

*** mutation diff:
--- crates/sandbox/src/lib.rs
+++ replace unix_path_arg -> String with "xyzzy".into()
@@ -621,17 +621,17 @@
             && path != entry_path
             && path
                 .strip_prefix(&entry_path)
                 .is_some_and(|suffix| suffix.starts_with('/'))
     })
 }
 
 fn unix_path_arg(path: &Path) -> String {
-    path.display().to_string().replace('\\', "/")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     use std::ffi::OsString;
     use std::fs;

---- compiles_linux_workspace_write_to_bubblewrap_plan stdout ----

thread 'compiles_linux_workspace_write_to_bubblewrap_plan' panicked at crates/sandbox/tests/sandbox_policy.rs:148:5:
assertion failed: plan.args.windows(2).any(|pair| pair == ["--bind", "/workspace"])

failures:
    compiles_linux_workspace_write_to_bubblewrap_plan

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
