*** crates/graph-viewer/src/lib.rs:111:5: replace validate_graph -> Result<(), GraphLoadError> with Ok(())

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace validate_graph -> Result<(), GraphLoadError> with Ok(())
@@ -103,43 +103,17 @@
     }
 
     pub fn edges(&self) -> &[Edge] {
         &self.edges
     }
 }
 
 fn validate_graph(nodes: &[Node], edges: &[Edge]) -> Result<(), GraphLoadError> {
-    let mut ids = BTreeSet::new();
-
-    for node in nodes {
-        if !ids.insert(node.id.clone()) {
-            return Err(GraphLoadError::DuplicateNode(node.id.clone()));
-        }
-    }
-
-    for (edge_index, edge) in edges.iter().enumerate() {
-        if !ids.contains(&edge.source) {
-            return Err(GraphLoadError::MissingEndpoint {
-                edge_index,
-                endpoint: "source",
-                node_id: edge.source.clone(),
-            });
-        }
-
-        if !ids.contains(&edge.target) {
-            return Err(GraphLoadError::MissingEndpoint {
-                edge_index,
-                endpoint: "target",
-                node_id: edge.target.clone(),
-            });
-        }
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone, Copy, PartialEq)]
 pub struct Point {
     pub x: f32,
     pub y: f32,
 }

---- direct_graph_construction_reuses_endpoint_validation stdout ----

thread 'direct_graph_construction_reuses_endpoint_validation' panicked at crates/graph-viewer/tests/graph_json.rs:111:6:
missing direct graph endpoints should be rejected: Graph { nodes: [Node { id: "known", label: "Known", color: None }], edges: [Edge { source: "known", target: "missing", label: None }] }

---- rejects_duplicate_node_ids stdout ----

thread 'rejects_duplicate_node_ids' panicked at crates/graph-viewer/tests/graph_json.rs:174:6:
duplicate IDs should be rejected: Graph { nodes: [Node { id: "same", label: "same", color: None }, Node { id: "same", label: "same", color: None }], edges: [] }

---- rejects_edges_that_point_at_missing_nodes stdout ----

thread 'rejects_edges_that_point_at_missing_nodes' panicked at crates/graph-viewer/tests/graph_json.rs:211:6:
missing edge endpoint should be rejected: Graph { nodes: [Node { id: "known", label: "known", color: None }], edges: [Edge { source: "known", target: "missing", label: None }] }

failures:
    direct_graph_construction_reuses_endpoint_validation
    rejects_duplicate_node_ids
    rejects_edges_that_point_at_missing_nodes
    rejects_edges_that_point_at_missing_source_nodes

test result: FAILED. 25 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
