*** crates/graph-viewer/src/lib.rs:114:12: delete ! in validate_graph

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ delete ! in validate_graph
@@ -106,17 +106,17 @@
         &self.edges
     }
 }
 
 fn validate_graph(nodes: &[Node], edges: &[Edge]) -> Result<(), GraphLoadError> {
     let mut ids = BTreeSet::new();
 
     for node in nodes {
-        if !ids.insert(node.id.clone()) {
+        if  /* ~ changed by cargo-mutants ~ */ids.insert(node.id.clone()) {
             return Err(GraphLoadError::DuplicateNode(node.id.clone()));
         }
     }
 
     for (edge_index, edge) in edges.iter().enumerate() {
         if !ids.contains(&edge.source) {
             return Err(GraphLoadError::MissingEndpoint {
                 edge_index,

---- app::tests::apply_pending_file_changes_reloads_latest_json_once_events_arrive stdout ----

thread 'app::tests::apply_pending_file_changes_reloads_latest_json_once_events_arrive' panicked at crates/graph-viewer/src/app.rs:342:18:
initial graph should remain loaded

---- view::tests::screen_position_applies_layout_scale_and_pan_center stdout ----

thread 'view::tests::screen_position_applies_layout_scale_and_pan_center' panicked at crates/graph-viewer/src/view.rs:708:10:
graph should parse: DuplicateNode("east")

---- app::tests::reload_graph_records_error_and_keeps_previous_graph stdout ----

thread 'app::tests::reload_graph_records_error_and_keeps_previous_graph' panicked at crates/graph-viewer/src/app.rs:318:18:
previous graph should remain available

failures:
    app::tests::apply_pending_file_changes_reloads_latest_json_once_events_arrive
    app::tests::reload_graph_loads_graph_layout_and_success_status
    app::tests::reload_graph_records_error_and_keeps_previous_graph
    app::tests::update_paints_toolbar_and_graph_canvas
    view::tests::screen_position_applies_layout_scale_and_pan_center
    view::tests::ui_allocates_canvas_and_paints_graph_shapes
    view::tests::ui_places_node_and_edge_labels_at_expected_anchors
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions
    view::tests::ui_scales_node_positions_by_displayed_zoom

test result: FAILED. 10 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
