*** crates/graph-viewer/src/lib.rs:120:12: delete ! in validate_graph

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ delete ! in validate_graph
@@ -112,17 +112,17 @@
 
     for node in nodes {
         if !ids.insert(node.id.clone()) {
             return Err(GraphLoadError::DuplicateNode(node.id.clone()));
         }
     }
 
     for (edge_index, edge) in edges.iter().enumerate() {
-        if !ids.contains(&edge.source) {
+        if  /* ~ changed by cargo-mutants ~ */ids.contains(&edge.source) {
             return Err(GraphLoadError::MissingEndpoint {
                 edge_index,
                 endpoint: "source",
                 node_id: edge.source.clone(),
             });
         }
 
         if !ids.contains(&edge.target) {

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:323:10:
sample graph should parse: MissingEndpoint { edge_index: 0, endpoint: "source", node_id: "source" }

---- view::tests::ui_allocates_canvas_and_paints_graph_shapes stdout ----

thread 'view::tests::ui_allocates_canvas_and_paints_graph_shapes' panicked at crates/graph-viewer/src/view.rs:323:10:
sample graph should parse: MissingEndpoint { edge_index: 0, endpoint: "source", node_id: "source" }

---- app::tests::reload_graph_loads_graph_layout_and_success_status stdout ----

thread 'app::tests::reload_graph_loads_graph_layout_and_success_status' panicked at crates/graph-viewer/src/app.rs:293:40:
graph should load

failures:
    app::tests::reload_graph_loads_graph_layout_and_success_status
    view::tests::ui_allocates_canvas_and_paints_graph_shapes
    view::tests::ui_places_node_and_edge_labels_at_expected_anchors
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions
    view::tests::ui_scales_node_positions_by_displayed_zoom

test result: FAILED. 14 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
