*** crates/graph-viewer/src/lib.rs:128:12: delete ! in validate_graph

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ delete ! in validate_graph
@@ -120,17 +120,17 @@
         if !ids.contains(&edge.source) {
             return Err(GraphLoadError::MissingEndpoint {
                 edge_index,
                 endpoint: "source",
                 node_id: edge.source.clone(),
             });
         }
 
-        if !ids.contains(&edge.target) {
+        if  /* ~ changed by cargo-mutants ~ */ids.contains(&edge.target) {
             return Err(GraphLoadError::MissingEndpoint {
                 edge_index,
                 endpoint: "target",
                 node_id: edge.target.clone(),
             });
         }
     }

---- view::tests::ui_places_node_and_edge_labels_at_expected_anchors stdout ----

thread 'view::tests::ui_places_node_and_edge_labels_at_expected_anchors' panicked at crates/graph-viewer/src/view.rs:323:10:
sample graph should parse: MissingEndpoint { edge_index: 0, endpoint: "target", node_id: "target" }

---- app::tests::reload_graph_loads_graph_layout_and_success_status stdout ----

thread 'app::tests::reload_graph_loads_graph_layout_and_success_status' panicked at crates/graph-viewer/src/app.rs:293:40:
graph should load

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:323:10:
sample graph should parse: MissingEndpoint { edge_index: 0, endpoint: "target", node_id: "target" }

failures:
    app::tests::reload_graph_loads_graph_layout_and_success_status
    view::tests::ui_allocates_canvas_and_paints_graph_shapes
    view::tests::ui_places_node_and_edge_labels_at_expected_anchors
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions
    view::tests::ui_scales_node_positions_by_displayed_zoom

test result: FAILED. 14 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
