*** crates/graph-viewer/src/lib.rs:167:19: replace == with != in circular_layout

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace == with != in circular_layout
@@ -159,17 +159,17 @@
         self.positions.get(node_id).copied()
     }
 }
 
 pub fn circular_layout(graph: &Graph) -> GraphLayout {
     let mut positions = BTreeMap::new();
     let node_count = graph.nodes.len();
 
-    if node_count == 0 {
+    if node_count != /* ~ changed by cargo-mutants ~ */ 0 {
         return GraphLayout { positions };
     }
 
     if node_count == 1 {
         positions.insert(graph.nodes[0].id.clone(), Point { x: 0.0, y: 0.0 });
         return GraphLayout { positions };
     }

---- app::tests::reload_graph_loads_graph_layout_and_success_status stdout ----

thread 'app::tests::reload_graph_loads_graph_layout_and_success_status' panicked at crates/graph-viewer/src/app.rs:296:9:
assertion failed: app.layout.position("source").is_some()

---- view::tests::screen_position_applies_layout_scale_and_pan_center stdout ----

thread 'view::tests::screen_position_applies_layout_scale_and_pan_center' panicked at crates/graph-viewer/src/view.rs:714:14:
east should map to a screen position

---- view::tests::ui_places_node_and_edge_labels_at_expected_anchors stdout ----

thread 'view::tests::ui_places_node_and_edge_labels_at_expected_anchors' panicked at crates/graph-viewer/src/view.rs:459:32:
expected text shape containing "Source"

failures:
    app::tests::reload_graph_loads_graph_layout_and_success_status
    app::tests::update_paints_toolbar_and_graph_canvas
    view::tests::screen_position_applies_layout_scale_and_pan_center
    view::tests::ui_allocates_canvas_and_paints_graph_shapes
    view::tests::ui_places_node_and_edge_labels_at_expected_anchors
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions
    view::tests::ui_scales_node_positions_by_displayed_zoom

test result: FAILED. 12 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
