*** crates/graph-viewer/src/lib.rs:177:40: replace / with % in circular_layout

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace / with % in circular_layout
@@ -169,17 +169,17 @@
     }
 
     if node_count == 1 {
         positions.insert(graph.nodes[0].id.clone(), Point { x: 0.0, y: 0.0 });
         return GraphLayout { positions };
     }
 
     for (index, node) in graph.nodes.iter().enumerate() {
-        let angle = TAU * index as f32 / node_count as f32;
+        let angle = TAU * index as f32 % /* ~ changed by cargo-mutants ~ */ node_count as f32;
         positions.insert(
             node.id.clone(),
             Point {
                 x: angle.cos(),
                 y: angle.sin(),
             },
         );
     }

---- view::tests::screen_position_applies_layout_scale_and_pan_center stdout ----

thread 'view::tests::screen_position_applies_layout_scale_and_pan_center' panicked at crates/graph-viewer/src/view.rs:720:9:
assertion failed: (north.x - 10.0).abs() < 0.0001

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [467.5 271.4] to be approximately [190.9 232.0]

---- view::tests::ui_places_node_and_edge_labels_at_expected_anchors stdout ----

thread 'view::tests::ui_places_node_and_edge_labels_at_expected_anchors' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [455.5 305.4] to be approximately [178.9 266.0]

failures:
    view::tests::screen_position_applies_layout_scale_and_pan_center
    view::tests::ui_places_node_and_edge_labels_at_expected_anchors
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions
    view::tests::ui_scales_node_positions_by_displayed_zoom

test result: FAILED. 15 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
