*** crates/graph-viewer/src/lib.rs:213:9: replace ZoomLevel::value -> f32 with -1.0

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace ZoomLevel::value -> f32 with -1.0
@@ -205,17 +205,17 @@
 
     pub fn new(value: f32) -> Self {
         Self {
             value: value.clamp(Self::MIN, Self::MAX),
         }
     }
 
     pub fn value(self) -> f32 {
-        self.value
+        -1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn percent(self) -> u32 {
         (self.value * 100.0).round() as u32
     }
 
     pub fn zoom_in(&mut self) {
         *self = Self::new(self.value * Self::STEP);

---- view::tests::ui_scales_node_positions_by_displayed_zoom stdout ----

thread 'view::tests::ui_scales_node_positions_by_displayed_zoom' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [178.9 240.0] to be approximately [602.2 240.0]

---- view::tests::ui_places_node_and_edge_labels_at_expected_anchors stdout ----

thread 'view::tests::ui_places_node_and_edge_labels_at_expected_anchors' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [178.9 266.0] to be approximately [461.1 266.0]

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [190.9 232.0] to be approximately [473.1 232.0]

failures:
    view::tests::ui_places_node_and_edge_labels_at_expected_anchors
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions
    view::tests::ui_scales_node_positions_by_displayed_zoom

test result: FAILED. 16 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
