*** crates/graph-viewer/src/lib.rs:217:9: replace ZoomLevel::percent -> u32 with 1

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace ZoomLevel::percent -> u32 with 1
@@ -209,17 +209,17 @@
         }
     }
 
     pub fn value(self) -> f32 {
         self.value
     }
 
     pub fn percent(self) -> u32 {
-        (self.value * 100.0).round() as u32
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn zoom_in(&mut self) {
         *self = Self::new(self.value * Self::STEP);
     }
 
     pub fn zoom_out(&mut self) {
         *self = Self::new(self.value / Self::STEP);

---- view::tests::zoom_controls_render_expected_buttons_and_current_percent stdout ----

thread 'view::tests::zoom_controls_render_expected_buttons_and_current_percent' panicked at crates/graph-viewer/src/view.rs:459:32:
expected text shape containing "125%"

failures:
    view::tests::zoom_controls_render_expected_buttons_and_current_percent

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
