*** crates/graph-viewer/src/lib.rs:221:38: replace * with / in ZoomLevel::zoom_in

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace * with / in ZoomLevel::zoom_in
@@ -213,17 +213,17 @@
         self.value
     }
 
     pub fn percent(self) -> u32 {
         (self.value * 100.0).round() as u32
     }
 
     pub fn zoom_in(&mut self) {
-        *self = Self::new(self.value * Self::STEP);
+        *self = Self::new(self.value / /* ~ changed by cargo-mutants ~ */ Self::STEP);
     }
 
     pub fn zoom_out(&mut self) {
         *self = Self::new(self.value / Self::STEP);
     }
 
     pub fn zoom_by_scroll(&mut self, scroll_delta_y: f32) {
         if scroll_delta_y > 0.0 {

---- graph_view_component_owns_zoom_without_file_watcher stdout ----

thread 'graph_view_component_owns_zoom_without_file_watcher' panicked at crates/graph-viewer/tests/graph_json.rs:573:5:
assertion `left == right` failed
  left: 80
 right: 125

---- smooth_zoom_animates_displayed_zoom_toward_target stdout ----

thread 'smooth_zoom_animates_displayed_zoom_toward_target' panicked at crates/graph-viewer/tests/graph_json.rs:460:5:
assertion `left == right` failed
  left: 80
 right: 125

---- smooth_zoom_reset_animates_back_to_default_target stdout ----

thread 'smooth_zoom_reset_animates_back_to_default_target' panicked at crates/graph-viewer/tests/graph_json.rs:479:5:
assertion failed: zoom.displayed().value() > 2.0

failures:
    graph_view_component_owns_zoom_without_file_watcher
    smooth_zoom_animates_displayed_zoom_toward_target
    smooth_zoom_reset_animates_back_to_default_target
    zoom_level_scroll_direction_changes_discrete_zoom
    zoom_level_steps_clamps_and_resets

test result: FAILED. 24 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
