*** crates/graph-viewer/src/lib.rs:225:38: replace / with % in ZoomLevel::zoom_out

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace / with % in ZoomLevel::zoom_out
@@ -217,17 +217,17 @@
         (self.value * 100.0).round() as u32
     }
 
     pub fn zoom_in(&mut self) {
         *self = Self::new(self.value * Self::STEP);
     }
 
     pub fn zoom_out(&mut self) {
-        *self = Self::new(self.value / Self::STEP);
+        *self = Self::new(self.value % /* ~ changed by cargo-mutants ~ */ Self::STEP);
     }
 
     pub fn zoom_by_scroll(&mut self, scroll_delta_y: f32) {
         if scroll_delta_y > 0.0 {
             self.zoom_in();
         } else if scroll_delta_y < 0.0 {
             self.zoom_out();
         }

---- smooth_zoom_zoom_out_updates_target_without_jumping_displayed_zoom stdout ----

thread 'smooth_zoom_zoom_out_updates_target_without_jumping_displayed_zoom' panicked at crates/graph-viewer/tests/graph_json.rs:498:5:
assertion `left == right` failed
  left: 0.75
 right: 1.6

---- zoom_level_scroll_direction_changes_discrete_zoom stdout ----

thread 'zoom_level_scroll_direction_changes_discrete_zoom' panicked at crates/graph-viewer/tests/graph_json.rs:424:5:
assertion `left == right` failed
  left: 25
 right: 100

---- zoom_level_steps_clamps_and_resets stdout ----

thread 'zoom_level_steps_clamps_and_resets' panicked at crates/graph-viewer/tests/graph_json.rs:397:5:
assertion `left == right` failed
  left: 0.25
 right: 1.0

failures:
    smooth_zoom_zoom_out_updates_target_without_jumping_displayed_zoom
    zoom_level_scroll_direction_changes_discrete_zoom
    zoom_level_steps_clamps_and_resets

test result: FAILED. 26 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
