*** crates/graph-viewer/src/lib.rs:229:9: replace ZoomLevel::zoom_by_scroll with ()

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace ZoomLevel::zoom_by_scroll with ()
@@ -221,21 +221,17 @@
         *self = Self::new(self.value * Self::STEP);
     }
 
     pub fn zoom_out(&mut self) {
         *self = Self::new(self.value / Self::STEP);
     }
 
     pub fn zoom_by_scroll(&mut self, scroll_delta_y: f32) {
-        if scroll_delta_y > 0.0 {
-            self.zoom_in();
-        } else if scroll_delta_y < 0.0 {
-            self.zoom_out();
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn scaled_by(self, factor: f32) -> Self {
         Self::new(self.value * factor)
     }
 
     pub fn lerp_toward(self, target: Self, amount: f32) -> Self {
         let amount = amount.clamp(0.0, 1.0);

---- zoom_level_scroll_direction_changes_discrete_zoom stdout ----

thread 'zoom_level_scroll_direction_changes_discrete_zoom' panicked at crates/graph-viewer/tests/graph_json.rs:421:5:
assertion `left == right` failed
  left: 100
 right: 125

failures:
    zoom_level_scroll_direction_changes_discrete_zoom

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
