*** crates/graph-viewer/src/lib.rs:231:34: replace < with > in ZoomLevel::zoom_by_scroll

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace < with > in ZoomLevel::zoom_by_scroll
@@ -223,17 +223,17 @@
 
     pub fn zoom_out(&mut self) {
         *self = Self::new(self.value / Self::STEP);
     }
 
     pub fn zoom_by_scroll(&mut self, scroll_delta_y: f32) {
         if scroll_delta_y > 0.0 {
             self.zoom_in();
-        } else if scroll_delta_y < 0.0 {
+        } else if scroll_delta_y > /* ~ changed by cargo-mutants ~ */ 0.0 {
             self.zoom_out();
         }
     }
 
     pub fn scaled_by(self, factor: f32) -> Self {
         Self::new(self.value * factor)
     }

---- zoom_level_scroll_direction_changes_discrete_zoom stdout ----

thread 'zoom_level_scroll_direction_changes_discrete_zoom' panicked at crates/graph-viewer/tests/graph_json.rs:424:5:
assertion `left == right` failed
  left: 125
 right: 100

failures:
    zoom_level_scroll_direction_changes_discrete_zoom

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
