*** crates/graph-viewer/src/lib.rs:237:9: replace ZoomLevel::scaled_by -> Self with Default::default()

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace ZoomLevel::scaled_by -> Self with Default::default()
@@ -229,17 +229,17 @@
         if scroll_delta_y > 0.0 {
             self.zoom_in();
         } else if scroll_delta_y < 0.0 {
             self.zoom_out();
         }
     }
 
     pub fn scaled_by(self, factor: f32) -> Self {
-        Self::new(self.value * factor)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn lerp_toward(self, target: Self, amount: f32) -> Self {
         let amount = amount.clamp(0.0, 1.0);
         Self::new(self.value + (target.value - self.value) * amount)
     }
 
     pub fn reset(&mut self) {

---- smooth_zoom_uses_continuous_scroll_targets stdout ----

thread 'smooth_zoom_uses_continuous_scroll_targets' panicked at crates/graph-viewer/tests/graph_json.rs:517:5:
assertion failed: zoom.target().value() > 1.0

---- smooth_zoom_ignores_zero_scroll_and_clamps_large_scroll stdout ----

thread 'smooth_zoom_ignores_zero_scroll_and_clamps_large_scroll' panicked at crates/graph-viewer/tests/graph_json.rs:529:5:
assertion `left == right` failed
  left: 1.0
 right: 4.0

---- zoom_level_new_and_scaling_are_clamped stdout ----

thread 'zoom_level_new_and_scaling_are_clamped' panicked at crates/graph-viewer/tests/graph_json.rs:436:5:
assertion `left == right` failed
  left: 1.0
 right: 0.25

failures:
    smooth_zoom_ignores_zero_scroll_and_clamps_large_scroll
    smooth_zoom_uses_continuous_scroll_targets
    zoom_level_new_and_scaling_are_clamped

test result: FAILED. 26 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
