*** crates/graph-viewer/src/lib.rs:241:9: replace ZoomLevel::lerp_toward -> Self with Default::default()

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace ZoomLevel::lerp_toward -> Self with Default::default()
@@ -233,18 +233,17 @@
         }
     }
 
     pub fn scaled_by(self, factor: f32) -> Self {
         Self::new(self.value * factor)
     }
 
     pub fn lerp_toward(self, target: Self, amount: f32) -> Self {
-        let amount = amount.clamp(0.0, 1.0);
-        Self::new(self.value + (target.value - self.value) * amount)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn reset(&mut self) {
         *self = Self::default();
     }
 }
 
 impl Default for ZoomLevel {

---- view::tests::ui_scales_node_positions_by_displayed_zoom stdout ----

thread 'view::tests::ui_scales_node_positions_by_displayed_zoom' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [461.1 240.0] to be approximately [602.2 240.0]

failures:
    view::tests::ui_scales_node_positions_by_displayed_zoom

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
