*** crates/graph-viewer/src/lib.rs:242:30: replace + with - in ZoomLevel::lerp_toward

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace + with - in ZoomLevel::lerp_toward
@@ -234,17 +234,17 @@
     }
 
     pub fn scaled_by(self, factor: f32) -> Self {
         Self::new(self.value * factor)
     }
 
     pub fn lerp_toward(self, target: Self, amount: f32) -> Self {
         let amount = amount.clamp(0.0, 1.0);
-        Self::new(self.value + (target.value - self.value) * amount)
+        Self::new(self.value - /* ~ changed by cargo-mutants ~ */ (target.value - self.value) * amount)
     }
 
     pub fn reset(&mut self) {
         *self = Self::default();
     }
 }
 
 impl Default for ZoomLevel {

---- smooth_zoom_animates_displayed_zoom_toward_target stdout ----

thread 'smooth_zoom_animates_displayed_zoom_toward_target' panicked at crates/graph-viewer/tests/graph_json.rs:463:5:
assertion failed: zoom.displayed().value() > 1.0

---- smooth_zoom_reset_animates_back_to_default_target stdout ----

thread 'smooth_zoom_reset_animates_back_to_default_target' panicked at crates/graph-viewer/tests/graph_json.rs:487:5:
assertion failed: zoom.displayed().value() < 2.5

---- smooth_zoom_snaps_to_target_when_advance_gets_close_enough stdout ----

thread 'smooth_zoom_snaps_to_target_when_advance_gets_close_enough' panicked at crates/graph-viewer/tests/graph_json.rs:507:5:
assertion failed: !zoom.advance(0.999)

failures:
    smooth_zoom_animates_displayed_zoom_toward_target
    smooth_zoom_reset_animates_back_to_default_target
    smooth_zoom_snaps_to_target_when_advance_gets_close_enough
    zoom_level_lerp_toward_respects_interpolation_bounds

test result: FAILED. 25 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
