*** crates/graph-viewer/src/lib.rs:242:46: replace - with / in ZoomLevel::lerp_toward

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace - with / in ZoomLevel::lerp_toward
@@ -234,17 +234,17 @@
     }
 
     pub fn scaled_by(self, factor: f32) -> Self {
         Self::new(self.value * factor)
     }
 
     pub fn lerp_toward(self, target: Self, amount: f32) -> Self {
         let amount = amount.clamp(0.0, 1.0);
-        Self::new(self.value + (target.value - self.value) * amount)
+        Self::new(self.value + (target.value / /* ~ changed by cargo-mutants ~ */ self.value) * amount)
     }
 
     pub fn reset(&mut self) {
         *self = Self::default();
     }
 }
 
 impl Default for ZoomLevel {

---- view::tests::ui_places_node_and_edge_labels_at_expected_anchors stdout ----

thread 'view::tests::ui_places_node_and_edge_labels_at_expected_anchors' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [486.5 266.0] to be approximately [461.1 266.0]

---- view::tests::ui_scales_node_positions_by_displayed_zoom stdout ----

thread 'view::tests::ui_scales_node_positions_by_displayed_zoom' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [627.6 240.0] to be approximately [602.2 240.0]

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [498.5 232.0] to be approximately [473.1 232.0]

failures:
    view::tests::ui_places_node_and_edge_labels_at_expected_anchors
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions
    view::tests::ui_scales_node_positions_by_displayed_zoom

test result: FAILED. 16 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
