*** crates/graph-viewer/src/lib.rs:242:60: replace * with / in ZoomLevel::lerp_toward

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace * with / in ZoomLevel::lerp_toward
@@ -234,17 +234,17 @@
     }
 
     pub fn scaled_by(self, factor: f32) -> Self {
         Self::new(self.value * factor)
     }
 
     pub fn lerp_toward(self, target: Self, amount: f32) -> Self {
         let amount = amount.clamp(0.0, 1.0);
-        Self::new(self.value + (target.value - self.value) * amount)
+        Self::new(self.value + (target.value - self.value) / /* ~ changed by cargo-mutants ~ */ amount)
     }
 
     pub fn reset(&mut self) {
         *self = Self::default();
     }
 }
 
 impl Default for ZoomLevel {

---- smooth_zoom_animates_displayed_zoom_toward_target stdout ----

thread 'smooth_zoom_animates_displayed_zoom_toward_target' panicked at crates/graph-viewer/tests/graph_json.rs:464:5:
assertion failed: zoom.displayed().value() < zoom.target().value()

---- smooth_zoom_reset_animates_back_to_default_target stdout ----

thread 'smooth_zoom_reset_animates_back_to_default_target' panicked at crates/graph-viewer/tests/graph_json.rs:488:5:
assertion failed: zoom.displayed().value() > zoom.target().value()

---- zoom_level_lerp_toward_respects_interpolation_bounds stdout ----

thread 'zoom_level_lerp_toward_respects_interpolation_bounds' panicked at crates/graph-viewer/tests/graph_json.rs:446:5:
assertion `left == right` failed
  left: 4.0
 right: 1.0

failures:
    smooth_zoom_animates_displayed_zoom_toward_target
    smooth_zoom_reset_animates_back_to_default_target
    zoom_level_lerp_toward_respects_interpolation_bounds

test result: FAILED. 26 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
