*** crates/graph-viewer/src/lib.rs:246:9: replace ZoomLevel::reset with ()

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace ZoomLevel::reset with ()
@@ -238,17 +238,17 @@
     }
 
     pub fn lerp_toward(self, target: Self, amount: f32) -> Self {
         let amount = amount.clamp(0.0, 1.0);
         Self::new(self.value + (target.value - self.value) * amount)
     }
 
     pub fn reset(&mut self) {
-        *self = Self::default();
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Default for ZoomLevel {
     fn default() -> Self {
         Self { value: 1.0 }
     }
 }

---- zoom_level_steps_clamps_and_resets stdout ----

thread 'zoom_level_steps_clamps_and_resets' panicked at crates/graph-viewer/tests/graph_json.rs:412:5:
assertion `left == right` failed
  left: 4.0
 right: 1.0

failures:
    zoom_level_steps_clamps_and_resets

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
