*** crates/graph-viewer/src/lib.rs:273:9: replace SmoothZoom::displayed -> ZoomLevel with Default::default()

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace SmoothZoom::displayed -> ZoomLevel with Default::default()
@@ -265,17 +265,17 @@
     pub fn new(zoom: ZoomLevel) -> Self {
         Self {
             displayed: zoom,
             target: zoom,
         }
     }
 
     pub fn displayed(self) -> ZoomLevel {
-        self.displayed
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn target(self) -> ZoomLevel {
         self.target
     }
 
     pub fn zoom_in(&mut self) {
         self.target.zoom_in();

---- view::tests::zoom_controls_render_expected_buttons_and_current_percent stdout ----

thread 'view::tests::zoom_controls_render_expected_buttons_and_current_percent' panicked at crates/graph-viewer/src/view.rs:459:32:
expected text shape containing "125%"

---- view::tests::ui_scales_node_positions_by_displayed_zoom stdout ----

thread 'view::tests::ui_scales_node_positions_by_displayed_zoom' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [461.1 240.0] to be approximately [602.2 240.0]

failures:
    view::tests::ui_scales_node_positions_by_displayed_zoom
    view::tests::zoom_controls_render_expected_buttons_and_current_percent

test result: FAILED. 17 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
