*** crates/graph-viewer/src/lib.rs:277:9: replace SmoothZoom::target -> ZoomLevel with Default::default()

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace SmoothZoom::target -> ZoomLevel with Default::default()
@@ -269,17 +269,17 @@
         }
     }
 
     pub fn displayed(self) -> ZoomLevel {
         self.displayed
     }
 
     pub fn target(self) -> ZoomLevel {
-        self.target
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn zoom_in(&mut self) {
         self.target.zoom_in();
     }
 
     pub fn zoom_out(&mut self) {
         self.target.zoom_out();

---- graph_view_component_owns_zoom_without_file_watcher stdout ----

thread 'graph_view_component_owns_zoom_without_file_watcher' panicked at crates/graph-viewer/tests/graph_json.rs:573:5:
assertion `left == right` failed
  left: 100
 right: 125

---- graph_view_new_and_with_zoom_initialize_state_predictably stdout ----

thread 'graph_view_new_and_with_zoom_initialize_state_predictably' panicked at crates/graph-viewer/tests/graph_json.rs:561:5:
assertion `left == right` failed
  left: 1.0
 right: 2.0

---- smooth_zoom_animates_displayed_zoom_toward_target stdout ----

thread 'smooth_zoom_animates_displayed_zoom_toward_target' panicked at crates/graph-viewer/tests/graph_json.rs:460:5:
assertion `left == right` failed
  left: 100
 right: 125

failures:
    graph_view_component_owns_zoom_without_file_watcher
    graph_view_new_and_with_zoom_initialize_state_predictably
    smooth_zoom_animates_displayed_zoom_toward_target
    smooth_zoom_ignores_zero_scroll_and_clamps_large_scroll
    smooth_zoom_snaps_to_target_when_advance_gets_close_enough
    smooth_zoom_uses_continuous_scroll_targets
    smooth_zoom_zoom_out_updates_target_without_jumping_displayed_zoom

test result: FAILED. 22 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
