*** crates/graph-viewer/src/lib.rs:281:9: replace SmoothZoom::zoom_in with ()

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace SmoothZoom::zoom_in with ()
@@ -273,17 +273,17 @@
         self.displayed
     }
 
     pub fn target(self) -> ZoomLevel {
         self.target
     }
 
     pub fn zoom_in(&mut self) {
-        self.target.zoom_in();
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn zoom_out(&mut self) {
         self.target.zoom_out();
     }
 
     pub fn zoom_by_scroll(&mut self, scroll_delta_y: f32) {
         if scroll_delta_y == 0.0 {

---- graph_view_component_owns_zoom_without_file_watcher stdout ----

thread 'graph_view_component_owns_zoom_without_file_watcher' panicked at crates/graph-viewer/tests/graph_json.rs:573:5:
assertion `left == right` failed
  left: 100
 right: 125

---- smooth_zoom_animates_displayed_zoom_toward_target stdout ----

thread 'smooth_zoom_animates_displayed_zoom_toward_target' panicked at crates/graph-viewer/tests/graph_json.rs:460:5:
assertion `left == right` failed
  left: 100
 right: 125

---- smooth_zoom_reset_animates_back_to_default_target stdout ----

thread 'smooth_zoom_reset_animates_back_to_default_target' panicked at crates/graph-viewer/tests/graph_json.rs:479:5:
assertion failed: zoom.displayed().value() > 2.0

failures:
    graph_view_component_owns_zoom_without_file_watcher
    smooth_zoom_animates_displayed_zoom_toward_target
    smooth_zoom_reset_animates_back_to_default_target

test result: FAILED. 26 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
