*** crates/graph-viewer/src/lib.rs:285:9: replace SmoothZoom::zoom_out with ()

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace SmoothZoom::zoom_out with ()
@@ -277,17 +277,17 @@
         self.target
     }
 
     pub fn zoom_in(&mut self) {
         self.target.zoom_in();
     }
 
     pub fn zoom_out(&mut self) {
-        self.target.zoom_out();
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn zoom_by_scroll(&mut self, scroll_delta_y: f32) {
         if scroll_delta_y == 0.0 {
             return;
         }
 
         let factor = (scroll_delta_y * 0.0025).exp();

---- smooth_zoom_zoom_out_updates_target_without_jumping_displayed_zoom stdout ----

thread 'smooth_zoom_zoom_out_updates_target_without_jumping_displayed_zoom' panicked at crates/graph-viewer/tests/graph_json.rs:498:5:
assertion `left == right` failed
  left: 2.0
 right: 1.6

failures:
    smooth_zoom_zoom_out_updates_target_without_jumping_displayed_zoom

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
