*** crates/graph-viewer/src/lib.rs:289:9: replace SmoothZoom::zoom_by_scroll with ()

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace SmoothZoom::zoom_by_scroll with ()
@@ -281,22 +281,17 @@
         self.target.zoom_in();
     }
 
     pub fn zoom_out(&mut self) {
         self.target.zoom_out();
     }
 
     pub fn zoom_by_scroll(&mut self, scroll_delta_y: f32) {
-        if scroll_delta_y == 0.0 {
-            return;
-        }
-
-        let factor = (scroll_delta_y * 0.0025).exp();
-        self.target = self.target.scaled_by(factor);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn reset(&mut self) {
         self.target = ZoomLevel::default();
     }
 
     pub fn jump_to_target(&mut self) {
         self.displayed = self.target;

---- smooth_zoom_ignores_zero_scroll_and_clamps_large_scroll stdout ----

thread 'smooth_zoom_ignores_zero_scroll_and_clamps_large_scroll' panicked at crates/graph-viewer/tests/graph_json.rs:529:5:
assertion `left == right` failed
  left: 1.0
 right: 4.0

---- smooth_zoom_uses_continuous_scroll_targets stdout ----

thread 'smooth_zoom_uses_continuous_scroll_targets' panicked at crates/graph-viewer/tests/graph_json.rs:517:5:
assertion failed: zoom.target().value() > 1.0

failures:
    smooth_zoom_ignores_zero_scroll_and_clamps_large_scroll
    smooth_zoom_uses_continuous_scroll_targets

test result: FAILED. 27 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
