*** crates/graph-viewer/src/lib.rs:293:38: replace * with / in SmoothZoom::zoom_by_scroll

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace * with / in SmoothZoom::zoom_by_scroll
@@ -285,17 +285,17 @@
         self.target.zoom_out();
     }
 
     pub fn zoom_by_scroll(&mut self, scroll_delta_y: f32) {
         if scroll_delta_y == 0.0 {
             return;
         }
 
-        let factor = (scroll_delta_y * 0.0025).exp();
+        let factor = (scroll_delta_y / /* ~ changed by cargo-mutants ~ */ 0.0025).exp();
         self.target = self.target.scaled_by(factor);
     }
 
     pub fn reset(&mut self) {
         self.target = ZoomLevel::default();
     }
 
     pub fn jump_to_target(&mut self) {

---- smooth_zoom_uses_continuous_scroll_targets stdout ----

thread 'smooth_zoom_uses_continuous_scroll_targets' panicked at crates/graph-viewer/tests/graph_json.rs:518:5:
assertion failed: zoom.target().value() < 1.25

failures:
    smooth_zoom_uses_continuous_scroll_targets

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
