*** crates/graph-viewer/src/lib.rs:298:9: replace SmoothZoom::reset with ()

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace SmoothZoom::reset with ()
@@ -290,17 +290,17 @@
             return;
         }
 
         let factor = (scroll_delta_y * 0.0025).exp();
         self.target = self.target.scaled_by(factor);
     }
 
     pub fn reset(&mut self) {
-        self.target = ZoomLevel::default();
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn jump_to_target(&mut self) {
         self.displayed = self.target;
     }
 
     pub fn advance(&mut self, amount: f32) -> bool {
         let next = self.displayed.lerp_toward(self.target, amount);

---- graph_view_component_owns_zoom_without_file_watcher stdout ----

thread 'graph_view_component_owns_zoom_without_file_watcher' panicked at crates/graph-viewer/tests/graph_json.rs:576:5:
assertion `left == right` failed
  left: ZoomLevel { value: 1.25 }
 right: ZoomLevel { value: 1.0 }

---- smooth_zoom_reset_animates_back_to_default_target stdout ----

thread 'smooth_zoom_reset_animates_back_to_default_target' panicked at crates/graph-viewer/tests/graph_json.rs:484:5:
assertion `left == right` failed
  left: ZoomLevel { value: 2.5 }
 right: ZoomLevel { value: 1.0 }

failures:
    graph_view_component_owns_zoom_without_file_watcher
    smooth_zoom_reset_animates_back_to_default_target

test result: FAILED. 27 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
