*** crates/graph-viewer/src/lib.rs:29:9: replace <impl fmt::Display for GraphLoadError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace <impl fmt::Display for GraphLoadError>::fmt -> fmt::Result with Ok(Default::default())
@@ -21,29 +21,17 @@
         endpoint: &'static str,
         node_id: String,
     },
     Io(String),
 }
 
 impl fmt::Display for GraphLoadError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::InvalidJson(message) => write!(f, "invalid graph JSON: {message}"),
-            Self::DuplicateNode(id) => write!(f, "duplicate node id: {id}"),
-            Self::MissingEndpoint {
-                edge_index,
-                endpoint,
-                node_id,
-            } => write!(
-                f,
-                "edge {edge_index} references missing {endpoint} node: {node_id}"
-            ),
-            Self::Io(message) => write!(f, "could not read graph JSON: {message}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for GraphLoadError {}
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub struct Node {
     pub id: String,

---- app::tests::reload_graph_records_error_and_keeps_previous_graph stdout ----

thread 'app::tests::reload_graph_records_error_and_keeps_previous_graph' panicked at crates/graph-viewer/src/app.rs:323:9:
assertion failed: app.status.starts_with("Load error: invalid graph JSON:")

failures:
    app::tests::reload_graph_records_error_and_keeps_previous_graph

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
