*** crates/graph-viewer/src/lib.rs:302:9: replace SmoothZoom::jump_to_target with ()

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace SmoothZoom::jump_to_target with ()
@@ -294,17 +294,17 @@
         self.target = self.target.scaled_by(factor);
     }
 
     pub fn reset(&mut self) {
         self.target = ZoomLevel::default();
     }
 
     pub fn jump_to_target(&mut self) {
-        self.displayed = self.target;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn advance(&mut self, amount: f32) -> bool {
         let next = self.displayed.lerp_toward(self.target, amount);
 
         if (next.value() - self.target.value()).abs() <= Self::ANIMATION_EPSILON {
             self.displayed = self.target;
             false

---- smooth_zoom_reset_animates_back_to_default_target stdout ----

thread 'smooth_zoom_reset_animates_back_to_default_target' panicked at crates/graph-viewer/tests/graph_json.rs:479:5:
assertion failed: zoom.displayed().value() > 2.0

failures:
    smooth_zoom_reset_animates_back_to_default_target

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
