*** crates/graph-viewer/src/lib.rs:306:9: replace SmoothZoom::advance -> bool with true

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace SmoothZoom::advance -> bool with true
@@ -298,25 +298,17 @@
         self.target = ZoomLevel::default();
     }
 
     pub fn jump_to_target(&mut self) {
         self.displayed = self.target;
     }
 
     pub fn advance(&mut self, amount: f32) -> bool {
-        let next = self.displayed.lerp_toward(self.target, amount);
-
-        if (next.value() - self.target.value()).abs() <= Self::ANIMATION_EPSILON {
-            self.displayed = self.target;
-            false
-        } else {
-            self.displayed = next;
-            true
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Default for SmoothZoom {
     fn default() -> Self {
         Self::new(ZoomLevel::default())
     }
 }

---- smooth_zoom_reset_animates_back_to_default_target stdout ----

thread 'smooth_zoom_reset_animates_back_to_default_target' panicked at crates/graph-viewer/tests/graph_json.rs:487:5:
assertion failed: zoom.displayed().value() < 2.5

---- smooth_zoom_animates_displayed_zoom_toward_target stdout ----

thread 'smooth_zoom_animates_displayed_zoom_toward_target' panicked at crates/graph-viewer/tests/graph_json.rs:463:5:
assertion failed: zoom.displayed().value() > 1.0

---- smooth_zoom_snaps_to_target_when_advance_gets_close_enough stdout ----

thread 'smooth_zoom_snaps_to_target_when_advance_gets_close_enough' panicked at crates/graph-viewer/tests/graph_json.rs:507:5:
assertion failed: !zoom.advance(0.999)

failures:
    smooth_zoom_animates_displayed_zoom_toward_target
    smooth_zoom_reset_animates_back_to_default_target
    smooth_zoom_snaps_to_target_when_advance_gets_close_enough

test result: FAILED. 26 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
