*** crates/graph-viewer/src/lib.rs:308:26: replace - with + in SmoothZoom::advance

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace - with + in SmoothZoom::advance
@@ -300,17 +300,17 @@
 
     pub fn jump_to_target(&mut self) {
         self.displayed = self.target;
     }
 
     pub fn advance(&mut self, amount: f32) -> bool {
         let next = self.displayed.lerp_toward(self.target, amount);
 
-        if (next.value() - self.target.value()).abs() <= Self::ANIMATION_EPSILON {
+        if (next.value() + /* ~ changed by cargo-mutants ~ */ self.target.value()).abs() <= Self::ANIMATION_EPSILON {
             self.displayed = self.target;
             false
         } else {
             self.displayed = next;
             true
         }
     }
 }

---- smooth_zoom_snaps_to_target_when_advance_gets_close_enough stdout ----

thread 'smooth_zoom_snaps_to_target_when_advance_gets_close_enough' panicked at crates/graph-viewer/tests/graph_json.rs:507:5:
assertion failed: !zoom.advance(0.999)

failures:
    smooth_zoom_snaps_to_target_when_advance_gets_close_enough

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
