*** crates/graph-viewer/src/lib.rs:308:55: replace <= with > in SmoothZoom::advance

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace <= with > in SmoothZoom::advance
@@ -300,17 +300,17 @@
 
     pub fn jump_to_target(&mut self) {
         self.displayed = self.target;
     }
 
     pub fn advance(&mut self, amount: f32) -> bool {
         let next = self.displayed.lerp_toward(self.target, amount);
 
-        if (next.value() - self.target.value()).abs() <= Self::ANIMATION_EPSILON {
+        if (next.value() - self.target.value()).abs() > /* ~ changed by cargo-mutants ~ */ Self::ANIMATION_EPSILON {
             self.displayed = self.target;
             false
         } else {
             self.displayed = next;
             true
         }
     }
 }

---- smooth_zoom_animates_displayed_zoom_toward_target stdout ----

thread 'smooth_zoom_animates_displayed_zoom_toward_target' panicked at crates/graph-viewer/tests/graph_json.rs:462:5:
assertion failed: zoom.advance(0.5)

---- smooth_zoom_snaps_to_target_when_advance_gets_close_enough stdout ----

thread 'smooth_zoom_snaps_to_target_when_advance_gets_close_enough' panicked at crates/graph-viewer/tests/graph_json.rs:507:5:
assertion failed: !zoom.advance(0.999)

---- smooth_zoom_reset_animates_back_to_default_target stdout ----

thread 'smooth_zoom_reset_animates_back_to_default_target' panicked at crates/graph-viewer/tests/graph_json.rs:486:5:
assertion failed: zoom.advance(0.5)

failures:
    smooth_zoom_animates_displayed_zoom_toward_target
    smooth_zoom_reset_animates_back_to_default_target
    smooth_zoom_snaps_to_target_when_advance_gets_close_enough

test result: FAILED. 26 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
