*** crates/graph-viewer/src/lib.rs:336:9: replace PanOffset::x -> f32 with 0.0

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace PanOffset::x -> f32 with 0.0
@@ -328,17 +328,17 @@
 }
 
 impl PanOffset {
     pub fn new(x: f32, y: f32) -> Self {
         Self { x, y }
     }
 
     pub fn x(self) -> f32 {
-        self.x
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn y(self) -> f32 {
         self.y
     }
 
     pub fn pan_by(&mut self, delta_x: f32, delta_y: f32) {
         self.x += delta_x;

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [461.1 232.0] to be approximately [473.1 232.0]

failures:
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
