*** crates/graph-viewer/src/lib.rs:336:9: replace PanOffset::x -> f32 with 1.0

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace PanOffset::x -> f32 with 1.0
@@ -328,17 +328,17 @@
 }
 
 impl PanOffset {
     pub fn new(x: f32, y: f32) -> Self {
         Self { x, y }
     }
 
     pub fn x(self) -> f32 {
-        self.x
+        1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn y(self) -> f32 {
         self.y
     }
 
     pub fn pan_by(&mut self, delta_x: f32, delta_y: f32) {
         self.x += delta_x;

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [462.1 232.0] to be approximately [473.1 232.0]

---- view::tests::ui_scales_node_positions_by_displayed_zoom stdout ----

thread 'view::tests::ui_scales_node_positions_by_displayed_zoom' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [603.2 240.0] to be approximately [602.2 240.0]

---- view::tests::ui_places_node_and_edge_labels_at_expected_anchors stdout ----

thread 'view::tests::ui_places_node_and_edge_labels_at_expected_anchors' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [462.1 266.0] to be approximately [461.1 266.0]

failures:
    view::tests::ui_places_node_and_edge_labels_at_expected_anchors
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions
    view::tests::ui_scales_node_positions_by_displayed_zoom

test result: FAILED. 16 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
