*** crates/graph-viewer/src/lib.rs:340:9: replace PanOffset::y -> f32 with -1.0

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace PanOffset::y -> f32 with -1.0
@@ -332,17 +332,17 @@
         Self { x, y }
     }
 
     pub fn x(self) -> f32 {
         self.x
     }
 
     pub fn y(self) -> f32 {
-        self.y
+        -1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn pan_by(&mut self, delta_x: f32, delta_y: f32) {
         self.x += delta_x;
         self.y += delta_y;
     }
 
     pub fn reset(&mut self) {

---- view::tests::ui_scales_node_positions_by_displayed_zoom stdout ----

thread 'view::tests::ui_scales_node_positions_by_displayed_zoom' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [602.2 239.0] to be approximately [602.2 240.0]

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [473.1 239.0] to be approximately [473.1 232.0]

---- view::tests::ui_places_node_and_edge_labels_at_expected_anchors stdout ----

thread 'view::tests::ui_places_node_and_edge_labels_at_expected_anchors' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [461.1 265.0] to be approximately [461.1 266.0]

failures:
    view::tests::ui_places_node_and_edge_labels_at_expected_anchors
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions
    view::tests::ui_scales_node_positions_by_displayed_zoom

test result: FAILED. 16 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
