*** crates/graph-viewer/src/lib.rs:344:9: replace PanOffset::pan_by with ()

*** mutation diff:
--- crates/graph-viewer/src/lib.rs
+++ replace PanOffset::pan_by with ()
@@ -336,18 +336,17 @@
         self.x
     }
 
     pub fn y(self) -> f32 {
         self.y
     }
 
     pub fn pan_by(&mut self, delta_x: f32, delta_y: f32) {
-        self.x += delta_x;
-        self.y += delta_y;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn reset(&mut self) {
         *self = Self::default();
     }
 }
 
 impl Default for PanOffset {

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [461.1 240.0] to be approximately [473.1 232.0]

failures:
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
