*** crates/graph-viewer/src/main.rs:15:9: delete field viewport from struct eframe::NativeOptions expression in main

*** mutation diff:
--- crates/graph-viewer/src/main.rs
+++ delete field viewport from struct eframe::NativeOptions expression in main
@@ -7,17 +7,17 @@
     let graph_path = std::env::args_os()
         .nth(1)
         .map(PathBuf::from)
         .unwrap_or_else(|| {
             PathBuf::from(env!("CARGO_MANIFEST_DIR")).join("examples/sample_graph.json")
         });
 
     let native_options = eframe::NativeOptions {
-        viewport: egui::ViewportBuilder::default().with_inner_size([1120.0, 760.0]),
+         /* ~ changed by cargo-mutants ~ */
         ..Default::default()
     };
 
     eframe::run_native(
         "Manual Graph Viewer",
         native_options,
         Box::new(move |creation_context| {
             Ok(Box::new(GraphViewerApp::new(

*** result: Success
