*** crates/graph-viewer/src/view.rs:116:57: replace * with / in GraphView::ui

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace * with / in GraphView::ui
@@ -108,17 +108,17 @@
         if graph.nodes().is_empty() {
             draw_center_message(&painter, rect, "Empty graph");
             return response;
         }
 
         let graph_rect = rect.shrink2(Vec2::new(64.0, 64.0));
         let center = graph_rect.center() + vec2(self.pan.x(), self.pan.y());
         let scale =
-            graph_rect.width().min(graph_rect.height()) * 0.42 * self.zoom.displayed().value();
+            graph_rect.width().min(graph_rect.height()) / /* ~ changed by cargo-mutants ~ */ 0.42 * self.zoom.displayed().value();
 
         for edge in graph.edges() {
             self.draw_edge(&painter, center, scale, edge, layout);
         }
 
         for node in graph.nodes() {
             self.draw_node(&painter, center, scale, node, layout);
         }

---- view::tests::ui_scales_node_positions_by_displayed_zoom stdout ----

thread 'view::tests::ui_scales_node_positions_by_displayed_zoom' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [1920.0 240.0] to be approximately [602.2 240.0]

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [1132.0 232.0] to be approximately [473.1 232.0]

---- view::tests::ui_places_node_and_edge_labels_at_expected_anchors stdout ----

thread 'view::tests::ui_places_node_and_edge_labels_at_expected_anchors' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [1120.0 266.0] to be approximately [461.1 266.0]

failures:
    view::tests::ui_places_node_and_edge_labels_at_expected_anchors
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions
    view::tests::ui_scales_node_positions_by_displayed_zoom

test result: FAILED. 16 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
