*** crates/graph-viewer/src/view.rs:116:64: replace * with / in GraphView::ui

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace * with / in GraphView::ui
@@ -108,17 +108,17 @@
         if graph.nodes().is_empty() {
             draw_center_message(&painter, rect, "Empty graph");
             return response;
         }
 
         let graph_rect = rect.shrink2(Vec2::new(64.0, 64.0));
         let center = graph_rect.center() + vec2(self.pan.x(), self.pan.y());
         let scale =
-            graph_rect.width().min(graph_rect.height()) * 0.42 * self.zoom.displayed().value();
+            graph_rect.width().min(graph_rect.height()) * 0.42 / /* ~ changed by cargo-mutants ~ */ self.zoom.displayed().value();
 
         for edge in graph.edges() {
             self.draw_edge(&painter, center, scale, edge, layout);
         }
 
         for node in graph.nodes() {
             self.draw_node(&painter, center, scale, node, layout);
         }

---- view::tests::ui_scales_node_positions_by_displayed_zoom stdout ----

thread 'view::tests::ui_scales_node_positions_by_displayed_zoom' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [390.6 240.0] to be approximately [602.2 240.0]

failures:
    view::tests::ui_scales_node_positions_by_displayed_zoom

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
