*** crates/graph-viewer/src/view.rs:147:9: replace GraphView::screen_position -> Option<Pos2> with None

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace GraphView::screen_position -> Option<Pos2> with None
@@ -139,19 +139,17 @@
 
     fn screen_position(
         &self,
         center: Pos2,
         scale: f32,
         node_id: &str,
         layout: &GraphLayout,
     ) -> Option<Pos2> {
-        layout
-            .position(node_id)
-            .map(|point| center + vec2(point.x * scale, point.y * scale))
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn draw_edge(
         &self,
         painter: &Painter,
         center: Pos2,
         scale: f32,
         edge: &Edge,

---- view::tests::screen_position_applies_layout_scale_and_pan_center stdout ----

thread 'view::tests::screen_position_applies_layout_scale_and_pan_center' panicked at crates/graph-viewer/src/view.rs:712:14:
east should map to a screen position

---- view::tests::ui_places_node_and_edge_labels_at_expected_anchors stdout ----

thread 'view::tests::ui_places_node_and_edge_labels_at_expected_anchors' panicked at crates/graph-viewer/src/view.rs:457:32:
expected text shape containing "Source"

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:431:14:
expected circle with requested fill color

failures:
    app::tests::update_paints_toolbar_and_graph_canvas
    view::tests::screen_position_applies_layout_scale_and_pan_center
    view::tests::ui_allocates_canvas_and_paints_graph_shapes
    view::tests::ui_places_node_and_edge_labels_at_expected_anchors
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions
    view::tests::ui_scales_node_positions_by_displayed_zoom

test result: FAILED. 13 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
