*** crates/graph-viewer/src/view.rs:147:9: replace GraphView::screen_position -> Option<Pos2> with Some(Default::default())

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace GraphView::screen_position -> Option<Pos2> with Some(Default::default())
@@ -139,19 +139,17 @@
 
     fn screen_position(
         &self,
         center: Pos2,
         scale: f32,
         node_id: &str,
         layout: &GraphLayout,
     ) -> Option<Pos2> {
-        layout
-            .position(node_id)
-            .map(|point| center + vec2(point.x * scale, point.y * scale))
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn draw_edge(
         &self,
         painter: &Painter,
         center: Pos2,
         scale: f32,
         edge: &Edge,

---- view::tests::screen_position_applies_layout_scale_and_pan_center stdout ----

thread 'view::tests::screen_position_applies_layout_scale_and_pan_center' panicked at crates/graph-viewer/src/view.rs:713:9:
assertion `left == right` failed
  left: [0.0 0.0]
 right: [15.0 20.0]

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:414:9:
expected position [0.0 0.0] to be approximately [473.1 232.0]

---- view::tests::ui_places_node_and_edge_labels_at_expected_anchors stdout ----

thread 'view::tests::ui_places_node_and_edge_labels_at_expected_anchors' panicked at crates/graph-viewer/src/view.rs:414:9:
expected position [0.0 26.0] to be approximately [461.1 266.0]

failures:
    view::tests::screen_position_applies_layout_scale_and_pan_center
    view::tests::ui_places_node_and_edge_labels_at_expected_anchors
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions
    view::tests::ui_scales_node_positions_by_displayed_zoom

test result: FAILED. 15 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
