*** crates/graph-viewer/src/view.rs:149:48: replace * with / in GraphView::screen_position

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace * with / in GraphView::screen_position
@@ -141,17 +141,17 @@
         &self,
         center: Pos2,
         scale: f32,
         node_id: &str,
         layout: &GraphLayout,
     ) -> Option<Pos2> {
         layout
             .position(node_id)
-            .map(|point| center + vec2(point.x * scale, point.y * scale))
+            .map(|point| center + vec2(point.x / /* ~ changed by cargo-mutants ~ */ scale, point.y * scale))
     }
 
     fn draw_edge(
         &self,
         painter: &Painter,
         center: Pos2,
         scale: f32,
         edge: &Edge,

---- view::tests::screen_position_applies_layout_scale_and_pan_center stdout ----

thread 'view::tests::screen_position_applies_layout_scale_and_pan_center' panicked at crates/graph-viewer/src/view.rs:715:9:
assertion `left == right` failed
  left: [10.2 20.0]
 right: [15.0 20.0]

---- view::tests::ui_scales_node_positions_by_displayed_zoom stdout ----

thread 'view::tests::ui_scales_node_positions_by_displayed_zoom' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [320.0 240.0] to be approximately [602.2 240.0]

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [332.0 232.0] to be approximately [473.1 232.0]

failures:
    view::tests::screen_position_applies_layout_scale_and_pan_center
    view::tests::ui_places_node_and_edge_labels_at_expected_anchors
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions
    view::tests::ui_scales_node_positions_by_displayed_zoom

test result: FAILED. 15 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
