*** crates/graph-viewer/src/view.rs:149:65: replace * with / in GraphView::screen_position

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace * with / in GraphView::screen_position
@@ -141,17 +141,17 @@
         &self,
         center: Pos2,
         scale: f32,
         node_id: &str,
         layout: &GraphLayout,
     ) -> Option<Pos2> {
         layout
             .position(node_id)
-            .map(|point| center + vec2(point.x * scale, point.y * scale))
+            .map(|point| center + vec2(point.x * scale, point.y / /* ~ changed by cargo-mutants ~ */ scale))
     }
 
     fn draw_edge(
         &self,
         painter: &Painter,
         center: Pos2,
         scale: f32,
         edge: &Edge,

---- view::tests::screen_position_applies_layout_scale_and_pan_center stdout ----

thread 'view::tests::screen_position_applies_layout_scale_and_pan_center' panicked at crates/graph-viewer/src/view.rs:721:9:
assertion failed: (north.y - 25.0).abs() < 0.0001

failures:
    view::tests::screen_position_applies_layout_scale_and_pan_center

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
