*** crates/graph-viewer/src/view.rs:160:9: replace GraphView::draw_edge with ()

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace GraphView::draw_edge with ()
@@ -152,37 +152,17 @@
     fn draw_edge(
         &self,
         painter: &Painter,
         center: Pos2,
         scale: f32,
         edge: &Edge,
         layout: &GraphLayout,
     ) {
-        let Some(source) = self.screen_position(center, scale, &edge.source, layout) else {
-            return;
-        };
-        let Some(target) = self.screen_position(center, scale, &edge.target, layout) else {
-            return;
-        };
-
-        let stroke = Stroke::new(1.5, Color32::from_rgb(116, 125, 136));
-        painter.line_segment([source, target], stroke);
-        draw_arrow_head(painter, source, target, stroke.color);
-
-        if let Some(label) = &edge.label {
-            let midpoint = source.lerp(target, 0.5);
-            painter.text(
-                midpoint + vec2(0.0, -10.0),
-                Align2::CENTER_BOTTOM,
-                abbreviate(label, 28),
-                FontId::proportional(12.0),
-                Color32::from_rgb(196, 203, 214),
-            );
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn draw_node(
         &self,
         painter: &Painter,
         center: Pos2,
         scale: f32,
         node: &Node,

---- view::tests::ui_allocates_canvas_and_paints_graph_shapes stdout ----

thread 'view::tests::ui_allocates_canvas_and_paints_graph_shapes' panicked at crates/graph-viewer/src/view.rs:519:9:
assertion failed: shapes.iter().any(|shape|
        matches!(shape, Shape::LineSegment { stroke, .. } if stroke.color ==
            Color32::from_rgb(116, 125, 136)))

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:551:9:
assertion `left == right` failed: edge plus two arrow-head strokes
  left: 0
 right: 3

---- view::tests::ui_places_node_and_edge_labels_at_expected_anchors stdout ----

thread 'view::tests::ui_places_node_and_edge_labels_at_expected_anchors' panicked at crates/graph-viewer/src/view.rs:439:32:
expected text shape containing "connects"

failures:
    view::tests::ui_allocates_canvas_and_paints_graph_shapes
    view::tests::ui_places_node_and_edge_labels_at_expected_anchors
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions

test result: FAILED. 16 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
