*** crates/graph-viewer/src/view.rs:174:38: delete - in GraphView::draw_edge

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ delete - in GraphView::draw_edge
@@ -166,17 +166,17 @@
 
         let stroke = Stroke::new(1.5, Color32::from_rgb(116, 125, 136));
         painter.line_segment([source, target], stroke);
         draw_arrow_head(painter, source, target, stroke.color);
 
         if let Some(label) = &edge.label {
             let midpoint = source.lerp(target, 0.5);
             painter.text(
-                midpoint + vec2(0.0, -10.0),
+                midpoint + vec2(0.0,  /* ~ changed by cargo-mutants ~ */10.0),
                 Align2::CENTER_BOTTOM,
                 abbreviate(label, 28),
                 FontId::proportional(12.0),
                 Color32::from_rgb(196, 203, 214),
             );
         }
     }

---- view::tests::ui_places_node_and_edge_labels_at_expected_anchors stdout ----

thread 'view::tests::ui_places_node_and_edge_labels_at_expected_anchors' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [320.0 250.0] to be approximately [320.0 230.0]

failures:
    view::tests::ui_places_node_and_edge_labels_at_expected_anchors

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
