*** crates/graph-viewer/src/view.rs:191:9: replace GraphView::draw_node with ()

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace GraphView::draw_node with ()
@@ -183,39 +183,17 @@
     fn draw_node(
         &self,
         painter: &Painter,
         center: Pos2,
         scale: f32,
         node: &Node,
         layout: &GraphLayout,
     ) {
-        let Some(position) = self.screen_position(center, scale, &node.id, layout) else {
-            return;
-        };
-
-        let fill = node
-            .color
-            .as_deref()
-            .and_then(parse_hex_color)
-            .unwrap_or_else(|| Color32::from_rgb(70, 124, 208));
-
-        painter.circle_filled(position, NODE_RADIUS, fill);
-        painter.circle_stroke(
-            position,
-            NODE_RADIUS,
-            Stroke::new(2.0, Color32::from_rgb(234, 238, 244)),
-        );
-        painter.text(
-            position + vec2(0.0, NODE_RADIUS + 8.0),
-            Align2::CENTER_TOP,
-            abbreviate(&node.label, 24),
-            FontId::proportional(13.0),
-            Color32::from_rgb(234, 238, 244),
-        );
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Default for GraphView {
     fn default() -> Self {
         Self {
             zoom: SmoothZoom::default(),
             pan: PanOffset::default(),

---- view::tests::ui_scales_node_positions_by_displayed_zoom stdout ----

thread 'view::tests::ui_scales_node_positions_by_displayed_zoom' panicked at crates/graph-viewer/src/view.rs:411:14:
expected circle with requested fill color

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:411:14:
expected circle with requested fill color

---- view::tests::ui_places_node_and_edge_labels_at_expected_anchors stdout ----

thread 'view::tests::ui_places_node_and_edge_labels_at_expected_anchors' panicked at crates/graph-viewer/src/view.rs:437:32:
expected text shape containing "Source"

failures:
    app::tests::update_paints_toolbar_and_graph_canvas
    view::tests::ui_allocates_canvas_and_paints_graph_shapes
    view::tests::ui_places_node_and_edge_labels_at_expected_anchors
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions
    view::tests::ui_scales_node_positions_by_displayed_zoom

test result: FAILED. 14 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
