*** crates/graph-viewer/src/view.rs:208:46: replace + with - in GraphView::draw_node

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace + with - in GraphView::draw_node
@@ -200,17 +200,17 @@
 
         painter.circle_filled(position, NODE_RADIUS, fill);
         painter.circle_stroke(
             position,
             NODE_RADIUS,
             Stroke::new(2.0, Color32::from_rgb(234, 238, 244)),
         );
         painter.text(
-            position + vec2(0.0, NODE_RADIUS + 8.0),
+            position + vec2(0.0, NODE_RADIUS - /* ~ changed by cargo-mutants ~ */ 8.0),
             Align2::CENTER_TOP,
             abbreviate(&node.label, 24),
             FontId::proportional(13.0),
             Color32::from_rgb(234, 238, 244),
         );
     }
 }

---- view::tests::ui_places_node_and_edge_labels_at_expected_anchors stdout ----

thread 'view::tests::ui_places_node_and_edge_labels_at_expected_anchors' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [461.1 250.0] to be approximately [461.1 266.0]

failures:
    view::tests::ui_places_node_and_edge_labels_at_expected_anchors

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
