*** crates/graph-viewer/src/view.rs:21:9: replace GraphView::with_zoom -> Self with Default::default()

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace GraphView::with_zoom -> Self with Default::default()
@@ -13,20 +13,17 @@
 }
 
 impl GraphView {
     pub fn new() -> Self {
         Self::default()
     }
 
     pub fn with_zoom(zoom: ZoomLevel) -> Self {
-        Self {
-            zoom: SmoothZoom::new(zoom),
-            pan: PanOffset::default(),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn zoom(&self) -> ZoomLevel {
         self.zoom.displayed()
     }
 
     pub fn target_zoom(&self) -> ZoomLevel {
         self.zoom.target()

---- view::tests::zoom_controls_render_expected_buttons_and_current_percent stdout ----

thread 'view::tests::zoom_controls_render_expected_buttons_and_current_percent' panicked at crates/graph-viewer/src/view.rs:456:32:
expected text shape containing "125%"

---- view::tests::ui_scales_node_positions_by_displayed_zoom stdout ----

thread 'view::tests::ui_scales_node_positions_by_displayed_zoom' panicked at crates/graph-viewer/src/view.rs:413:9:
expected position [461.1 240.0] to be approximately [602.2 240.0]

failures:
    view::tests::ui_scales_node_positions_by_displayed_zoom
    view::tests::zoom_controls_render_expected_buttons_and_current_percent

test result: FAILED. 17 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
