*** crates/graph-viewer/src/view.rs:227:5: replace draw_canvas_background with ()

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace draw_canvas_background with ()
@@ -219,18 +219,17 @@
         Self {
             zoom: SmoothZoom::default(),
             pan: PanOffset::default(),
         }
     }
 }
 
 fn draw_canvas_background(painter: &Painter, rect: Rect) {
-    painter.rect_filled(rect, 0.0, Color32::from_rgb(15, 18, 22));
-    draw_canvas_grid(painter, rect);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn draw_canvas_grid(painter: &Painter, rect: Rect) {
     let stroke = Stroke::new(1.0, Color32::from_rgb(25, 30, 36));
     let step = 48.0;
     let mut x = rect.left();
     while x <= rect.right() {
         painter.line_segment(

---- view::tests::ui_allocates_canvas_and_paints_graph_shapes stdout ----

thread 'view::tests::ui_allocates_canvas_and_paints_graph_shapes' panicked at crates/graph-viewer/src/view.rs:514:9:
canvas background should be painted

failures:
    view::tests::ui_allocates_canvas_and_paints_graph_shapes

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
