*** crates/graph-viewer/src/view.rs:232:5: replace draw_canvas_grid with ()

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace draw_canvas_grid with ()
@@ -224,35 +224,17 @@
 }
 
 fn draw_canvas_background(painter: &Painter, rect: Rect) {
     painter.rect_filled(rect, 0.0, Color32::from_rgb(15, 18, 22));
     draw_canvas_grid(painter, rect);
 }
 
 fn draw_canvas_grid(painter: &Painter, rect: Rect) {
-    let stroke = Stroke::new(1.0, Color32::from_rgb(25, 30, 36));
-    let step = 48.0;
-    let mut x = rect.left();
-    while x <= rect.right() {
-        painter.line_segment(
-            [Pos2::new(x, rect.top()), Pos2::new(x, rect.bottom())],
-            stroke,
-        );
-        x += step;
-    }
-
-    let mut y = rect.top();
-    while y <= rect.bottom() {
-        painter.line_segment(
-            [Pos2::new(rect.left(), y), Pos2::new(rect.right(), y)],
-            stroke,
-        );
-        y += step;
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn draw_center_message(painter: &Painter, rect: Rect, message: &str) {
     painter.text(
         rect.center(),
         Align2::CENTER_CENTER,
         message,
         FontId::proportional(18.0),

---- view::tests::ui_allocates_canvas_and_paints_graph_shapes stdout ----

thread 'view::tests::ui_allocates_canvas_and_paints_graph_shapes' panicked at crates/graph-viewer/src/view.rs:503:9:
canvas grid should paint many guide lines

failures:
    view::tests::ui_allocates_canvas_and_paints_graph_shapes

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
