*** crates/graph-viewer/src/view.rs:235:13: replace <= with > in draw_canvas_grid

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace <= with > in draw_canvas_grid
@@ -227,17 +227,17 @@
     painter.rect_filled(rect, 0.0, Color32::from_rgb(15, 18, 22));
     draw_canvas_grid(painter, rect);
 }
 
 fn draw_canvas_grid(painter: &Painter, rect: Rect) {
     let stroke = Stroke::new(1.0, Color32::from_rgb(25, 30, 36));
     let step = 48.0;
     let mut x = rect.left();
-    while x <= rect.right() {
+    while x > /* ~ changed by cargo-mutants ~ */ rect.right() {
         painter.line_segment(
             [Pos2::new(x, rect.top()), Pos2::new(x, rect.bottom())],
             stroke,
         );
         x += step;
     }
 
     let mut y = rect.top();

---- view::tests::ui_allocates_canvas_and_paints_graph_shapes stdout ----

thread 'view::tests::ui_allocates_canvas_and_paints_graph_shapes' panicked at crates/graph-viewer/src/view.rs:521:9:
canvas grid should paint many guide lines

failures:
    view::tests::ui_allocates_canvas_and_paints_graph_shapes

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
