*** crates/graph-viewer/src/view.rs:244:13: replace <= with > in draw_canvas_grid

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace <= with > in draw_canvas_grid
@@ -236,17 +236,17 @@
         painter.line_segment(
             [Pos2::new(x, rect.top()), Pos2::new(x, rect.bottom())],
             stroke,
         );
         x += step;
     }
 
     let mut y = rect.top();
-    while y <= rect.bottom() {
+    while y > /* ~ changed by cargo-mutants ~ */ rect.bottom() {
         painter.line_segment(
             [Pos2::new(rect.left(), y), Pos2::new(rect.right(), y)],
             stroke,
         );
         y += step;
     }
 }

---- view::tests::ui_allocates_canvas_and_paints_graph_shapes stdout ----

thread 'view::tests::ui_allocates_canvas_and_paints_graph_shapes' panicked at crates/graph-viewer/src/view.rs:521:9:
canvas grid should paint many guide lines

failures:
    view::tests::ui_allocates_canvas_and_paints_graph_shapes

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
