*** crates/graph-viewer/src/view.rs:249:11: replace += with *= in draw_canvas_grid

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace += with *= in draw_canvas_grid
@@ -241,17 +241,17 @@
     }
 
     let mut y = rect.top();
     while y <= rect.bottom() {
         painter.line_segment(
             [Pos2::new(rect.left(), y), Pos2::new(rect.right(), y)],
             stroke,
         );
-        y += step;
+        y *= /* ~ changed by cargo-mutants ~ */ step;
     }
 }
 
 fn draw_center_message(painter: &Painter, rect: Rect, message: &str) {
     painter.text(
         rect.center(),
         Align2::CENTER_CENTER,
         message,

---- view::tests::ui_allocates_canvas_and_paints_graph_shapes stdout ----

thread 'view::tests::ui_allocates_canvas_and_paints_graph_shapes' panicked at crates/graph-viewer/src/view.rs:521:9:
canvas grid should paint many guide lines

failures:
    view::tests::ui_allocates_canvas_and_paints_graph_shapes

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
