*** crates/graph-viewer/src/view.rs:254:5: replace draw_center_message with ()

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace draw_center_message with ()
@@ -246,23 +246,17 @@
             [Pos2::new(rect.left(), y), Pos2::new(rect.right(), y)],
             stroke,
         );
         y += step;
     }
 }
 
 fn draw_center_message(painter: &Painter, rect: Rect, message: &str) {
-    painter.text(
-        rect.center(),
-        Align2::CENTER_CENTER,
-        message,
-        FontId::proportional(18.0),
-        Color32::from_rgb(184, 193, 205),
-    );
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn draw_arrow_head(painter: &Painter, source: Pos2, target: Pos2, color: Color32) {
     let direction = target - source;
     let length = direction.length();
     if length <= NODE_RADIUS {
         return;
     }

---- view::tests::empty_ui_allocates_canvas_and_paints_message stdout ----

thread 'view::tests::empty_ui_allocates_canvas_and_paints_message' panicked at crates/graph-viewer/src/view.rs:610:9:
assertion failed: shapes.iter().any(|shape| matches!(shape, Shape::Text(_)))

failures:
    view::tests::empty_ui_allocates_canvas_and_paints_message

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
