*** crates/graph-viewer/src/view.rs:28:9: replace GraphView::zoom -> ZoomLevel with Default::default()

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace GraphView::zoom -> ZoomLevel with Default::default()
@@ -20,17 +20,17 @@
     pub fn with_zoom(zoom: ZoomLevel) -> Self {
         Self {
             zoom: SmoothZoom::new(zoom),
             pan: PanOffset::default(),
         }
     }
 
     pub fn zoom(&self) -> ZoomLevel {
-        self.zoom.displayed()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn target_zoom(&self) -> ZoomLevel {
         self.zoom.target()
     }
 
     pub fn zoom_mut(&mut self) -> &mut SmoothZoom {
         &mut self.zoom

---- graph_view_new_and_with_zoom_initialize_state_predictably stdout ----

thread 'graph_view_new_and_with_zoom_initialize_state_predictably' panicked at crates/graph-viewer/tests/graph_json.rs:560:5:
assertion `left == right` failed
  left: 1.0
 right: 2.0

failures:
    graph_view_new_and_with_zoom_initialize_state_predictably

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
