*** crates/graph-viewer/src/view.rs:32:9: replace GraphView::target_zoom -> ZoomLevel with Default::default()

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace GraphView::target_zoom -> ZoomLevel with Default::default()
@@ -24,17 +24,17 @@
         }
     }
 
     pub fn zoom(&self) -> ZoomLevel {
         self.zoom.displayed()
     }
 
     pub fn target_zoom(&self) -> ZoomLevel {
-        self.zoom.target()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn zoom_mut(&mut self) -> &mut SmoothZoom {
         &mut self.zoom
     }
 
     pub fn reset_zoom(&mut self) {
         self.zoom.reset();

---- graph_view_component_owns_zoom_without_file_watcher stdout ----

thread 'graph_view_component_owns_zoom_without_file_watcher' panicked at crates/graph-viewer/tests/graph_json.rs:573:5:
assertion `left == right` failed
  left: 100
 right: 125

---- graph_view_new_and_with_zoom_initialize_state_predictably stdout ----

thread 'graph_view_new_and_with_zoom_initialize_state_predictably' panicked at crates/graph-viewer/tests/graph_json.rs:561:5:
assertion `left == right` failed
  left: 1.0
 right: 2.0

failures:
    graph_view_component_owns_zoom_without_file_watcher
    graph_view_new_and_with_zoom_initialize_state_predictably

test result: FAILED. 27 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
