*** crates/graph-viewer/src/view.rs:36:9: replace GraphView::zoom_mut -> &mut SmoothZoom with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace GraphView::zoom_mut -> &mut SmoothZoom with Box::leak(Box::new(Default::default()))
@@ -28,17 +28,17 @@
         self.zoom.displayed()
     }
 
     pub fn target_zoom(&self) -> ZoomLevel {
         self.zoom.target()
     }
 
     pub fn zoom_mut(&mut self) -> &mut SmoothZoom {
-        &mut self.zoom
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn reset_zoom(&mut self) {
         self.zoom.reset();
     }
 
     pub fn pan(&self) -> PanOffset {
         self.pan

---- graph_view_component_owns_zoom_without_file_watcher stdout ----

thread 'graph_view_component_owns_zoom_without_file_watcher' panicked at crates/graph-viewer/tests/graph_json.rs:573:5:
assertion `left == right` failed
  left: 100
 right: 125

failures:
    graph_view_component_owns_zoom_without_file_watcher

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
