*** crates/graph-viewer/src/view.rs:40:9: replace GraphView::reset_zoom with ()

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace GraphView::reset_zoom with ()
@@ -32,17 +32,17 @@
         self.zoom.target()
     }
 
     pub fn zoom_mut(&mut self) -> &mut SmoothZoom {
         &mut self.zoom
     }
 
     pub fn reset_zoom(&mut self) {
-        self.zoom.reset();
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn pan(&self) -> PanOffset {
         self.pan
     }
 
     pub fn pan_mut(&mut self) -> &mut PanOffset {
         &mut self.pan

---- graph_view_component_owns_zoom_without_file_watcher stdout ----

thread 'graph_view_component_owns_zoom_without_file_watcher' panicked at crates/graph-viewer/tests/graph_json.rs:576:5:
assertion `left == right` failed
  left: ZoomLevel { value: 1.25 }
 right: ZoomLevel { value: 1.0 }

failures:
    graph_view_component_owns_zoom_without_file_watcher

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
