*** crates/graph-viewer/src/view.rs:44:9: replace GraphView::pan -> PanOffset with Default::default()

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace GraphView::pan -> PanOffset with Default::default()
@@ -36,17 +36,17 @@
         &mut self.zoom
     }
 
     pub fn reset_zoom(&mut self) {
         self.zoom.reset();
     }
 
     pub fn pan(&self) -> PanOffset {
-        self.pan
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn pan_mut(&mut self) -> &mut PanOffset {
         &mut self.pan
     }
 
     pub fn reset_pan(&mut self) {
         self.pan.reset();

---- graph_view_component_owns_pan_without_file_watcher stdout ----

thread 'graph_view_component_owns_pan_without_file_watcher' panicked at crates/graph-viewer/tests/graph_json.rs:586:5:
assertion `left == right` failed
  left: PanOffset { x: 0.0, y: 0.0 }
 right: PanOffset { x: 32.0, y: 18.0 }

failures:
    graph_view_component_owns_pan_without_file_watcher

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
