*** crates/graph-viewer/src/view.rs:48:9: replace GraphView::pan_mut -> &mut PanOffset with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace GraphView::pan_mut -> &mut PanOffset with Box::leak(Box::new(Default::default()))
@@ -40,17 +40,17 @@
         self.zoom.reset();
     }
 
     pub fn pan(&self) -> PanOffset {
         self.pan
     }
 
     pub fn pan_mut(&mut self) -> &mut PanOffset {
-        &mut self.pan
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn reset_pan(&mut self) {
         self.pan.reset();
     }
 
     pub fn zoom_controls(&mut self, ui: &mut Ui) {
         let button_size = vec2(28.0, 24.0);

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [461.1 240.0] to be approximately [473.1 232.0]

failures:
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
