*** crates/graph-viewer/src/view.rs:52:9: replace GraphView::reset_pan with ()

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace GraphView::reset_pan with ()
@@ -44,17 +44,17 @@
         self.pan
     }
 
     pub fn pan_mut(&mut self) -> &mut PanOffset {
         &mut self.pan
     }
 
     pub fn reset_pan(&mut self) {
-        self.pan.reset();
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn zoom_controls(&mut self, ui: &mut Ui) {
         let button_size = vec2(28.0, 24.0);
 
         if ui
             .add(egui::Button::new("-").min_size(button_size))
             .on_hover_text("Zoom out")

---- graph_view_component_owns_pan_without_file_watcher stdout ----

thread 'graph_view_component_owns_pan_without_file_watcher' panicked at crates/graph-viewer/tests/graph_json.rs:589:5:
assertion `left == right` failed
  left: PanOffset { x: 32.0, y: 18.0 }
 right: PanOffset { x: 0.0, y: 0.0 }

failures:
    graph_view_component_owns_pan_without_file_watcher

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
