*** crates/job-registry/src/lib.rs:116:12: delete ! in <impl JobStore for FileJobStore>::load

*** mutation diff:
--- crates/job-registry/src/lib.rs
+++ delete ! in <impl JobStore for FileJobStore>::load
@@ -108,17 +108,17 @@
 
     pub fn path(&self) -> &Path {
         &self.path
     }
 }
 
 impl JobStore for FileJobStore {
     fn load(&self) -> Result<JobRegistry, JobStoreError> {
-        if !self.path.exists() {
+        if  /* ~ changed by cargo-mutants ~ */self.path.exists() {
             return Ok(JobRegistry::new());
         }
 
         let contents =
             fs::read_to_string(&self.path).map_err(|error| JobStoreError::io(&self.path, error))?;
         let document: StoredJobDocument =
             toml::from_str(&contents).map_err(|error| JobStoreError::Decode {
                 path: self.path.clone(),

---- file_store_loads_predefined_jobs_toml_fixture stdout ----

thread 'file_store_loads_predefined_jobs_toml_fixture' panicked at crates/job-registry/tests/registry.rs:142:5:
assertion `left == right` failed
  left: 0
 right: 2

---- file_store_loads_missing_file_as_empty_registry stdout ----

thread 'file_store_loads_missing_file_as_empty_registry' panicked at crates/job-registry/tests/registry.rs:172:33:
missing file should load as empty: Io { path: "/var/folders/j9/vyb9gbys5db86cwqm3mld1fw0000gn/T/manual-job-registry-loads-missing-file-1778057019287791000-93864/.manual/jobs.toml", message: "No such file or directory (os error 2)" }

---- file_store_reloads_saved_registry_from_disk stdout ----

thread 'file_store_reloads_saved_registry_from_disk' panicked at crates/job-registry/tests/registry.rs:117:10:
saved job should resolve: UnknownId(JobId("job-001"))

failures:
    file_store_loads_missing_file_as_empty_registry
    file_store_loads_predefined_jobs_toml_fixture
    file_store_reloads_saved_registry_from_disk

test result: FAILED. 5 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
