*** crates/job-registry/src/lib.rs:116:9: replace <impl JobStore for FileJobStore>::load -> Result<JobRegistry, JobStoreError> with Ok(Default::default())

*** mutation diff:
--- crates/job-registry/src/lib.rs
+++ replace <impl JobStore for FileJobStore>::load -> Result<JobRegistry, JobStoreError> with Ok(Default::default())
@@ -108,29 +108,17 @@
 
     pub fn path(&self) -> &Path {
         &self.path
     }
 }
 
 impl JobStore for FileJobStore {
     fn load(&self) -> Result<JobRegistry, JobStoreError> {
-        if !self.path.exists() {
-            return Ok(JobRegistry::new());
-        }
-
-        let contents =
-            fs::read_to_string(&self.path).map_err(|error| JobStoreError::io(&self.path, error))?;
-        let document: StoredJobDocument =
-            toml::from_str(&contents).map_err(|error| JobStoreError::Decode {
-                path: self.path.clone(),
-                message: error.to_string(),
-            })?;
-
-        document.into_registry()
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn save(&self, registry: &JobRegistry) -> Result<(), JobStoreError> {
         let document = StoredJobDocument::from_registry(registry);
         let contents =
             toml::to_string_pretty(&document).map_err(|error| JobStoreError::Encode {
                 message: error.to_string(),
             })?;

---- file_store_loads_predefined_jobs_toml_fixture stdout ----

thread 'file_store_loads_predefined_jobs_toml_fixture' panicked at crates/job-registry/tests/registry.rs:142:5:
assertion `left == right` failed
  left: 0
 right: 2

---- file_store_reloads_saved_registry_from_disk stdout ----

thread 'file_store_reloads_saved_registry_from_disk' panicked at crates/job-registry/tests/registry.rs:117:10:
saved job should resolve: UnknownId(JobId("job-001"))

failures:
    file_store_loads_predefined_jobs_toml_fixture
    file_store_reloads_saved_registry_from_disk

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
