*** crates/job-registry/src/lib.rs:132:9: replace <impl JobStore for FileJobStore>::save -> Result<(), JobStoreError> with Ok(())

*** mutation diff:
--- crates/job-registry/src/lib.rs
+++ replace <impl JobStore for FileJobStore>::save -> Result<(), JobStoreError> with Ok(())
@@ -124,29 +124,17 @@
                 path: self.path.clone(),
                 message: error.to_string(),
             })?;
 
         document.into_registry()
     }
 
     fn save(&self, registry: &JobRegistry) -> Result<(), JobStoreError> {
-        let document = StoredJobDocument::from_registry(registry);
-        let contents =
-            toml::to_string_pretty(&document).map_err(|error| JobStoreError::Encode {
-                message: error.to_string(),
-            })?;
-
-        if let Some(parent) = self.path.parent() {
-            if !parent.as_os_str().is_empty() {
-                fs::create_dir_all(parent).map_err(|error| JobStoreError::io(parent, error))?;
-            }
-        }
-
-        fs::write(&self.path, contents).map_err(|error| JobStoreError::io(&self.path, error))
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum JobStoreError {
     Io { path: PathBuf, message: String },
     Decode { path: PathBuf, message: String },
     Encode { message: String },

---- file_store_reloads_saved_registry_from_disk stdout ----

thread 'file_store_reloads_saved_registry_from_disk' panicked at crates/job-registry/tests/registry.rs:117:10:
saved job should resolve: UnknownId(JobId("job-001"))

failures:
    file_store_reloads_saved_registry_from_disk

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
