*** crates/job-registry/src/lib.rs:139:16: delete ! in <impl JobStore for FileJobStore>::save

*** mutation diff:
--- crates/job-registry/src/lib.rs
+++ delete ! in <impl JobStore for FileJobStore>::save
@@ -131,17 +131,17 @@
     fn save(&self, registry: &JobRegistry) -> Result<(), JobStoreError> {
         let document = StoredJobDocument::from_registry(registry);
         let contents =
             toml::to_string_pretty(&document).map_err(|error| JobStoreError::Encode {
                 message: error.to_string(),
             })?;
 
         if let Some(parent) = self.path.parent() {
-            if !parent.as_os_str().is_empty() {
+            if  /* ~ changed by cargo-mutants ~ */parent.as_os_str().is_empty() {
                 fs::create_dir_all(parent).map_err(|error| JobStoreError::io(parent, error))?;
             }
         }
 
         fs::write(&self.path, contents).map_err(|error| JobStoreError::io(&self.path, error))
     }
 }

---- file_store_reloads_saved_registry_from_disk stdout ----

thread 'file_store_reloads_saved_registry_from_disk' panicked at crates/job-registry/tests/registry.rs:111:27:
registry should save: Io { path: "/var/folders/j9/vyb9gbys5db86cwqm3mld1fw0000gn/T/manual-job-registry-reloads-saved-registry-1778057021100067000-93934/.manual/jobs.toml", message: "No such file or directory (os error 2)" }

failures:
    file_store_reloads_saved_registry_from_disk

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
