*** crates/job-registry/src/lib.rs:168:9: replace <impl fmt::Display for JobStoreError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/job-registry/src/lib.rs
+++ replace <impl fmt::Display for JobStoreError>::fmt -> fmt::Result with Ok(Default::default())
@@ -160,31 +160,17 @@
             path: path.to_path_buf(),
             message: error.to_string(),
         }
     }
 }
 
 impl fmt::Display for JobStoreError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::Io { path, message } => {
-                write!(f, "job store I/O failed at {}: {message}", path.display())
-            }
-            Self::Decode { path, message } => {
-                write!(
-                    f,
-                    "job store failed to decode {}: {message}",
-                    path.display()
-                )
-            }
-            Self::Encode { message } => write!(f, "job store failed to encode: {message}"),
-            Self::Registry(error) => write!(f, "{error}"),
-            Self::Job(error) => write!(f, "{error}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for JobStoreError {}
 
 #[derive(Debug, Clone, Serialize, Deserialize)]
 struct StoredJobDocument {
     jobs: Vec<StoredJob>,

*** result: Success
