*** crates/job-registry/src/lib.rs:201:9: replace StoredJobDocument::into_registry -> Result<JobRegistry, JobStoreError> with Ok(Default::default())

*** mutation diff:
--- crates/job-registry/src/lib.rs
+++ replace StoredJobDocument::into_registry -> Result<JobRegistry, JobStoreError> with Ok(Default::default())
@@ -193,25 +193,17 @@
 impl StoredJobDocument {
     fn from_registry(registry: &JobRegistry) -> Self {
         Self {
             jobs: registry.iter().map(StoredJob::from_job).collect(),
         }
     }
 
     fn into_registry(self) -> Result<JobRegistry, JobStoreError> {
-        let mut registry = JobRegistry::new();
-
-        for job in self.jobs {
-            registry
-                .insert(job.into_job()?)
-                .map_err(JobStoreError::Registry)?;
-        }
-
-        Ok(registry)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, Serialize, Deserialize)]
 struct StoredJob {
     id: String,
     workflow_id: String,
     input_json: String,

---- file_store_loads_predefined_jobs_toml_fixture stdout ----

thread 'file_store_loads_predefined_jobs_toml_fixture' panicked at crates/job-registry/tests/registry.rs:142:5:
assertion `left == right` failed
  left: 0
 right: 2

---- file_store_reloads_saved_registry_from_disk stdout ----

thread 'file_store_reloads_saved_registry_from_disk' panicked at crates/job-registry/tests/registry.rs:117:10:
saved job should resolve: UnknownId(JobId("job-001"))

failures:
    file_store_loads_predefined_jobs_toml_fixture
    file_store_reloads_saved_registry_from_disk

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
