*** crates/job-registry/src/lib.rs:22:9: replace JobRegistry::insert -> Result<(), JobRegistryError> with Ok(())

*** mutation diff:
--- crates/job-registry/src/lib.rs
+++ replace JobRegistry::insert -> Result<(), JobRegistryError> with Ok(())
@@ -14,22 +14,17 @@
 }
 
 impl JobRegistry {
     pub fn new() -> Self {
         Self::default()
     }
 
     pub fn insert(&mut self, job: Job) -> Result<(), JobRegistryError> {
-        if self.jobs.contains_key(job.id()) {
-            return Err(JobRegistryError::DuplicateId(job.id().clone()));
-        }
-
-        self.jobs.insert(job.id().clone(), job);
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn resolve(&self, id: impl Into<String>) -> Result<&Job, JobRegistryError> {
         let id = JobId::new(id).map_err(JobRegistryError::InvalidId)?;
 
         self.jobs.get(&id).ok_or(JobRegistryError::UnknownId(id))
     }

---- registry_resolves_job_by_id stdout ----

thread 'registry_resolves_job_by_id' panicked at crates/job-registry/tests/registry.rs:21:48:
job should resolve: UnknownId(JobId("job-001"))

---- registry_rejects_duplicate_job_ids stdout ----

thread 'registry_rejects_duplicate_job_ids' panicked at crates/job-registry/tests/registry.rs:39:10:
registry should reject duplicate job ids: ()

---- registry_lists_jobs_for_a_workflow_template stdout ----

thread 'registry_lists_jobs_for_a_workflow_template' panicked at crates/job-registry/tests/registry.rs:92:5:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    file_store_loads_predefined_jobs_toml_fixture
    file_store_reloads_saved_registry_from_disk
    registry_lists_jobs_for_a_workflow_template
    registry_rejects_duplicate_job_ids
    registry_resolves_job_by_id

test result: FAILED. 3 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
