*** crates/job-registry/src/lib.rs:45:9: replace JobRegistry::remove -> Option<Job> with None

*** mutation diff:
--- crates/job-registry/src/lib.rs
+++ replace JobRegistry::remove -> Option<Job> with None
@@ -37,17 +37,17 @@
         self.jobs.get(id)
     }
 
     pub fn get_mut(&mut self, id: &JobId) -> Option<&mut Job> {
         self.jobs.get_mut(id)
     }
 
     pub fn remove(&mut self, id: &JobId) -> Option<Job> {
-        self.jobs.remove(id)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn len(&self) -> usize {
         self.jobs.len()
     }
 
     pub fn is_empty(&self) -> bool {
         self.jobs.is_empty()

*** result: Success
