*** crates/job-registry/src/lib.rs:49:9: replace JobRegistry::len -> usize with 1

*** mutation diff:
--- crates/job-registry/src/lib.rs
+++ replace JobRegistry::len -> usize with 1
@@ -41,17 +41,17 @@
         self.jobs.get_mut(id)
     }
 
     pub fn remove(&mut self, id: &JobId) -> Option<Job> {
         self.jobs.remove(id)
     }
 
     pub fn len(&self) -> usize {
-        self.jobs.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_empty(&self) -> bool {
         self.jobs.is_empty()
     }
 
     pub fn iter(&self) -> impl Iterator<Item = &Job> {
         self.jobs.values()

---- file_store_loads_predefined_jobs_toml_fixture stdout ----

thread 'file_store_loads_predefined_jobs_toml_fixture' panicked at crates/job-registry/tests/registry.rs:142:5:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    file_store_loads_predefined_jobs_toml_fixture

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
