*** crates/job-registry/src/lib.rs:53:9: replace JobRegistry::is_empty -> bool with false

*** mutation diff:
--- crates/job-registry/src/lib.rs
+++ replace JobRegistry::is_empty -> bool with false
@@ -45,17 +45,17 @@
         self.jobs.remove(id)
     }
 
     pub fn len(&self) -> usize {
         self.jobs.len()
     }
 
     pub fn is_empty(&self) -> bool {
-        self.jobs.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn iter(&self) -> impl Iterator<Item = &Job> {
         self.jobs.values()
     }
 
     pub fn jobs_for_workflow<'a>(
         &'a self,

---- file_store_loads_missing_file_as_empty_registry stdout ----

thread 'file_store_loads_missing_file_as_empty_registry' panicked at crates/job-registry/tests/registry.rs:174:5:
assertion failed: registry.is_empty()

failures:
    file_store_loads_missing_file_as_empty_registry

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
