*** crates/job-registry/src/lib.rs:57:9: replace JobRegistry::iter -> impl Iterator<Item =&Job> with ::std::iter::empty()

*** mutation diff:
--- crates/job-registry/src/lib.rs
+++ replace JobRegistry::iter -> impl Iterator<Item =&Job> with ::std::iter::empty()
@@ -49,17 +49,17 @@
         self.jobs.len()
     }
 
     pub fn is_empty(&self) -> bool {
         self.jobs.is_empty()
     }
 
     pub fn iter(&self) -> impl Iterator<Item = &Job> {
-        self.jobs.values()
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn jobs_for_workflow<'a>(
         &'a self,
         workflow_id: &'a str,
     ) -> impl Iterator<Item = &'a Job> + 'a {
         self.jobs
             .values()

---- file_store_reloads_saved_registry_from_disk stdout ----

thread 'file_store_reloads_saved_registry_from_disk' panicked at crates/job-registry/tests/registry.rs:117:10:
saved job should resolve: UnknownId(JobId("job-001"))

failures:
    file_store_reloads_saved_registry_from_disk

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
