*** crates/job-registry/src/lib.rs:64:9: replace JobRegistry::jobs_for_workflow -> impl Iterator<Item =&'a Job>+'a with ::std::iter::empty()

*** mutation diff:
--- crates/job-registry/src/lib.rs
+++ replace JobRegistry::jobs_for_workflow -> impl Iterator<Item =&'a Job>+'a with ::std::iter::empty()
@@ -56,19 +56,17 @@
     pub fn iter(&self) -> impl Iterator<Item = &Job> {
         self.jobs.values()
     }
 
     pub fn jobs_for_workflow<'a>(
         &'a self,
         workflow_id: &'a str,
     ) -> impl Iterator<Item = &'a Job> + 'a {
-        self.jobs
-            .values()
-            .filter(move |job| job.workflow_id() == workflow_id)
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum JobRegistryError {
     InvalidId(JobIdError),
     DuplicateId(JobId),
     UnknownId(JobId),

---- registry_lists_jobs_for_a_workflow_template stdout ----

thread 'registry_lists_jobs_for_a_workflow_template' panicked at crates/job-registry/tests/registry.rs:92:5:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    registry_lists_jobs_for_a_workflow_template

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
