*** crates/job-registry/src/lib.rs:66:50: replace == with != in JobRegistry::jobs_for_workflow

*** mutation diff:
--- crates/job-registry/src/lib.rs
+++ replace == with != in JobRegistry::jobs_for_workflow
@@ -58,17 +58,17 @@
     }
 
     pub fn jobs_for_workflow<'a>(
         &'a self,
         workflow_id: &'a str,
     ) -> impl Iterator<Item = &'a Job> + 'a {
         self.jobs
             .values()
-            .filter(move |job| job.workflow_id() == workflow_id)
+            .filter(move |job| job.workflow_id() != /* ~ changed by cargo-mutants ~ */ workflow_id)
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum JobRegistryError {
     InvalidId(JobIdError),
     DuplicateId(JobId),
     UnknownId(JobId),

---- registry_lists_jobs_for_a_workflow_template stdout ----

thread 'registry_lists_jobs_for_a_workflow_template' panicked at crates/job-registry/tests/registry.rs:92:5:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    registry_lists_jobs_for_a_workflow_template

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
