*** crates/job-registry/src/lib.rs:79:9: replace <impl fmt::Display for JobRegistryError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/job-registry/src/lib.rs
+++ replace <impl fmt::Display for JobRegistryError>::fmt -> fmt::Result with Ok(Default::default())
@@ -71,21 +71,17 @@
 pub enum JobRegistryError {
     InvalidId(JobIdError),
     DuplicateId(JobId),
     UnknownId(JobId),
 }
 
 impl fmt::Display for JobRegistryError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::InvalidId(error) => write!(f, "{error}"),
-            Self::DuplicateId(id) => write!(f, "duplicate job id: {id}"),
-            Self::UnknownId(id) => write!(f, "unknown job id: {id}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for JobRegistryError {}
 
 pub trait JobStore {
     fn load(&self) -> Result<JobRegistry, JobStoreError>;

---- registry_reports_unknown_job_ids stdout ----

thread 'registry_reports_unknown_job_ids' panicked at crates/job-registry/tests/registry.rs:60:5:
assertion `left == right` failed
  left: ""
 right: "unknown job id: missing"

---- registry_rejects_duplicate_job_ids stdout ----

thread 'registry_rejects_duplicate_job_ids' panicked at crates/job-registry/tests/registry.rs:45:5:
assertion `left == right` failed
  left: ""
 right: "duplicate job id: job-001"

failures:
    registry_rejects_duplicate_job_ids
    registry_reports_unknown_job_ids

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
