*** crates/job/src/lib.rs:110:9: replace NodeRunStatus::is_success_terminal -> bool with true

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace NodeRunStatus::is_success_terminal -> bool with true
@@ -102,17 +102,17 @@
             Self::Succeeded => "succeeded",
             Self::Failed => "failed",
             Self::Skipped => "skipped",
             Self::WaitingForApproval => "waiting_for_approval",
         }
     }
 
     fn is_success_terminal(self) -> bool {
-        matches!(self, Self::Succeeded | Self::Skipped)
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for NodeRunStatus {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(self.as_str())
     }
 }

---- job_records_node_execution_state_for_one_workflow_run stdout ----

thread 'job_records_node_execution_state_for_one_workflow_run' panicked at crates/job/tests/job_lifecycle.rs:38:5:
assertion `left == right` failed
  left: Succeeded
 right: Running

failures:
    job_records_node_execution_state_for_one_workflow_run

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
