*** crates/job/src/lib.rs:221:9: replace Job::workflow_id -> &str with "xyzzy"

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace Job::workflow_id -> &str with "xyzzy"
@@ -213,17 +213,17 @@
         })
     }
 
     pub fn id(&self) -> &JobId {
         &self.id
     }
 
     pub fn workflow_id(&self) -> &str {
-        &self.workflow_id
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn input_json(&self) -> &str {
         &self.input_json
     }
 
     pub fn status(&self) -> JobStatus {
         self.status

---- jobs_instantiate_from_workflow_templates_independently stdout ----

thread 'jobs_instantiate_from_workflow_templates_independently' panicked at crates/job/tests/job_lifecycle.rs:16:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "debug-voc"

failures:
    jobs_instantiate_from_workflow_templates_independently

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
