*** crates/job/src/lib.rs:225:9: replace Job::input_json -> &str with ""

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace Job::input_json -> &str with ""
@@ -217,17 +217,17 @@
         &self.id
     }
 
     pub fn workflow_id(&self) -> &str {
         &self.workflow_id
     }
 
     pub fn input_json(&self) -> &str {
-        &self.input_json
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn status(&self) -> JobStatus {
         self.status
     }
 
     pub fn nodes(&self) -> &[JobNode] {
         &self.nodes

---- jobs_instantiate_from_workflow_templates_independently stdout ----

thread 'jobs_instantiate_from_workflow_templates_independently' panicked at crates/job/tests/job_lifecycle.rs:18:5:
assertion `left == right` failed
  left: ""
 right: "{\"ticket\":\"VOC-1\"}"

failures:
    jobs_instantiate_from_workflow_templates_independently

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
