*** crates/job/src/lib.rs:233:9: replace Job::nodes -> &[JobNode] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace Job::nodes -> &[JobNode] with Vec::leak(Vec::new())
@@ -225,17 +225,17 @@
         &self.input_json
     }
 
     pub fn status(&self) -> JobStatus {
         self.status
     }
 
     pub fn nodes(&self) -> &[JobNode] {
-        &self.nodes
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn node_status(&self, node_id: &str) -> Option<NodeRunStatus> {
         self.nodes
             .iter()
             .find(|node| node.node_id.as_str() == node_id)
             .map(JobNode::status)
     }

---- jobs_instantiate_from_workflow_templates_independently stdout ----

thread 'jobs_instantiate_from_workflow_templates_independently' panicked at crates/job/tests/job_lifecycle.rs:23:5:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    jobs_instantiate_from_workflow_templates_independently

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
