*** crates/job/src/lib.rs:237:9: replace Job::node_status -> Option<NodeRunStatus> with None

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace Job::node_status -> Option<NodeRunStatus> with None
@@ -229,20 +229,17 @@
         self.status
     }
 
     pub fn nodes(&self) -> &[JobNode] {
         &self.nodes
     }
 
     pub fn node_status(&self, node_id: &str) -> Option<NodeRunStatus> {
-        self.nodes
-            .iter()
-            .find(|node| node.node_id.as_str() == node_id)
-            .map(JobNode::status)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn mark_node_ready(&mut self, node_id: impl Into<String>) -> Result<(), JobError> {
         self.transition_node(node_id, NodeRunStatus::Ready)
     }
 
     pub fn start_node(&mut self, node_id: impl Into<String>) -> Result<(), JobError> {
         self.transition_node(node_id, NodeRunStatus::Running)

---- job_records_node_execution_state_for_one_workflow_run stdout ----

thread 'job_records_node_execution_state_for_one_workflow_run' panicked at crates/job/tests/job_lifecycle.rs:39:5:
assertion `left == right` failed
  left: None
 right: Some(Running)

---- jobs_instantiate_from_workflow_templates_independently stdout ----

thread 'jobs_instantiate_from_workflow_templates_independently' panicked at crates/job/tests/job_lifecycle.rs:24:5:
assertion `left == right` failed
  left: None
 right: Some(Ready)

failures:
    job_records_node_execution_state_for_one_workflow_run
    jobs_instantiate_from_workflow_templates_independently

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
