*** crates/job/src/lib.rs:244:9: replace Job::mark_node_ready -> Result<(), JobError> with Ok(())

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace Job::mark_node_ready -> Result<(), JobError> with Ok(())
@@ -236,17 +236,17 @@
     pub fn node_status(&self, node_id: &str) -> Option<NodeRunStatus> {
         self.nodes
             .iter()
             .find(|node| node.node_id.as_str() == node_id)
             .map(JobNode::status)
     }
 
     pub fn mark_node_ready(&mut self, node_id: impl Into<String>) -> Result<(), JobError> {
-        self.transition_node(node_id, NodeRunStatus::Ready)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn start_node(&mut self, node_id: impl Into<String>) -> Result<(), JobError> {
         self.transition_node(node_id, NodeRunStatus::Running)
     }
 
     pub fn succeed_node(&mut self, node_id: impl Into<String>) -> Result<(), JobError> {
         self.transition_node(node_id, NodeRunStatus::Succeeded)

---- job_records_node_execution_state_for_one_workflow_run stdout ----

thread 'job_records_node_execution_state_for_one_workflow_run' panicked at crates/job/tests/job_lifecycle.rs:46:10:
ready node should be able to start: InvalidNodeTransition { node_id: "inspect", from: Pending, to: Running }

failures:
    job_records_node_execution_state_for_one_workflow_run

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
