*** crates/job/src/lib.rs:248:9: replace Job::start_node -> Result<(), JobError> with Ok(())

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace Job::start_node -> Result<(), JobError> with Ok(())
@@ -240,17 +240,17 @@
             .map(JobNode::status)
     }
 
     pub fn mark_node_ready(&mut self, node_id: impl Into<String>) -> Result<(), JobError> {
         self.transition_node(node_id, NodeRunStatus::Ready)
     }
 
     pub fn start_node(&mut self, node_id: impl Into<String>) -> Result<(), JobError> {
-        self.transition_node(node_id, NodeRunStatus::Running)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn succeed_node(&mut self, node_id: impl Into<String>) -> Result<(), JobError> {
         self.transition_node(node_id, NodeRunStatus::Succeeded)
     }
 
     pub fn fail_node(&mut self, node_id: impl Into<String>) -> Result<(), JobError> {
         self.transition_node(node_id, NodeRunStatus::Failed)

---- job_records_node_execution_state_for_one_workflow_run stdout ----

thread 'job_records_node_execution_state_for_one_workflow_run' panicked at crates/job/tests/job_lifecycle.rs:38:5:
assertion `left == right` failed
  left: Created
 right: Running

---- job_rejects_unknown_nodes_and_invalid_transitions stdout ----

thread 'job_rejects_unknown_nodes_and_invalid_transitions' panicked at crates/job/tests/job_lifecycle.rs:70:10:
job should reject unknown node ids: ()

failures:
    job_records_node_execution_state_for_one_workflow_run
    job_rejects_unknown_nodes_and_invalid_transitions

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
