*** crates/job/src/lib.rs:252:9: replace Job::succeed_node -> Result<(), JobError> with Ok(())

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace Job::succeed_node -> Result<(), JobError> with Ok(())
@@ -244,17 +244,17 @@
         self.transition_node(node_id, NodeRunStatus::Ready)
     }
 
     pub fn start_node(&mut self, node_id: impl Into<String>) -> Result<(), JobError> {
         self.transition_node(node_id, NodeRunStatus::Running)
     }
 
     pub fn succeed_node(&mut self, node_id: impl Into<String>) -> Result<(), JobError> {
-        self.transition_node(node_id, NodeRunStatus::Succeeded)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn fail_node(&mut self, node_id: impl Into<String>) -> Result<(), JobError> {
         self.transition_node(node_id, NodeRunStatus::Failed)
     }
 
     fn transition_node(
         &mut self,

---- job_records_node_execution_state_for_one_workflow_run stdout ----

thread 'job_records_node_execution_state_for_one_workflow_run' panicked at crates/job/tests/job_lifecycle.rs:56:5:
assertion `left == right` failed
  left: Running
 right: Succeeded

---- job_rejects_unknown_nodes_and_invalid_transitions stdout ----

thread 'job_rejects_unknown_nodes_and_invalid_transitions' panicked at crates/job/tests/job_lifecycle.rs:77:10:
pending node should not be able to succeed: ()

failures:
    job_records_node_execution_state_for_one_workflow_run
    job_rejects_unknown_nodes_and_invalid_transitions

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
