*** crates/job/src/lib.rs:268:39: replace == with != in Job::transition_node

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace == with != in Job::transition_node
@@ -260,17 +260,17 @@
         &mut self,
         node_id: impl Into<String>,
         to: NodeRunStatus,
     ) -> Result<(), JobError> {
         let node_id = NodeId::new(node_id).map_err(JobError::InvalidNodeId)?;
         let node = self
             .nodes
             .iter_mut()
-            .find(|node| node.node_id == node_id)
+            .find(|node| node.node_id != /* ~ changed by cargo-mutants ~ */ node_id)
             .ok_or_else(|| JobError::UnknownNode(node_id.to_string()))?;
         let from = node.status;
 
         if !valid_node_transition(from, to) {
             return Err(JobError::InvalidNodeTransition {
                 node_id: node_id.to_string(),
                 from,
                 to,

---- job_rejects_unknown_nodes_and_invalid_transitions stdout ----

thread 'job_rejects_unknown_nodes_and_invalid_transitions' panicked at crates/job/tests/job_lifecycle.rs:70:10:
job should reject unknown node ids: ()

---- job_records_node_execution_state_for_one_workflow_run stdout ----

thread 'job_records_node_execution_state_for_one_workflow_run' panicked at crates/job/tests/job_lifecycle.rs:36:10:
entry node should be ready to start: InvalidNodeTransition { node_id: "trigger", from: Pending, to: Running }

failures:
    job_records_node_execution_state_for_one_workflow_run
    job_rejects_unknown_nodes_and_invalid_transitions

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
