*** crates/job/src/lib.rs:282:27: replace += with -= in Job::transition_node

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace += with -= in Job::transition_node
@@ -274,17 +274,17 @@
                 node_id: node_id.to_string(),
                 from,
                 to,
             });
         }
 
         node.status = to;
         if to == NodeRunStatus::Running {
-            node.attempts += 1;
+            node.attempts -= /* ~ changed by cargo-mutants ~ */ 1;
         }
         self.refresh_status();
 
         Ok(())
     }
 
     fn refresh_status(&mut self) {
         if self

---- job_records_node_execution_state_for_one_workflow_run stdout ----

thread 'job_records_node_execution_state_for_one_workflow_run' panicked at /private/var/folders/j9/vyb9gbys5db86cwqm3mld1fw0000gn/T/cargo-mutants-Manual-mYyGzN.tmp/crates/job/src/lib.rs:282:13:
attempt to subtract with overflow

failures:
    job_records_node_execution_state_for_one_workflow_run

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
