*** crates/job/src/lib.rs:290:9: replace Job::refresh_status with ()

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace Job::refresh_status with ()
@@ -282,42 +282,17 @@
             node.attempts += 1;
         }
         self.refresh_status();
 
         Ok(())
     }
 
     fn refresh_status(&mut self) {
-        if self
-            .nodes
-            .iter()
-            .any(|node| node.status == NodeRunStatus::Failed)
-        {
-            self.status = JobStatus::Failed;
-            return;
-        }
-
-        if self
-            .nodes
-            .iter()
-            .all(|node| node.status.is_success_terminal())
-        {
-            self.status = JobStatus::Succeeded;
-            return;
-        }
-
-        if self.nodes.iter().any(|node| {
-            matches!(
-                node.status,
-                NodeRunStatus::Running | NodeRunStatus::Succeeded | NodeRunStatus::Skipped
-            )
-        }) {
-            self.status = JobStatus::Running;
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn valid_node_transition(from: NodeRunStatus, to: NodeRunStatus) -> bool {
     matches!(
         (from, to),
         (NodeRunStatus::Pending, NodeRunStatus::Ready)
             | (NodeRunStatus::Ready, NodeRunStatus::Running)

---- job_records_node_execution_state_for_one_workflow_run stdout ----

thread 'job_records_node_execution_state_for_one_workflow_run' panicked at crates/job/tests/job_lifecycle.rs:38:5:
assertion `left == right` failed
  left: Created
 right: Running

failures:
    job_records_node_execution_state_for_one_workflow_run

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
