*** crates/job/src/lib.rs:293:37: replace == with != in Job::refresh_status

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace == with != in Job::refresh_status
@@ -285,17 +285,17 @@
 
         Ok(())
     }
 
     fn refresh_status(&mut self) {
         if self
             .nodes
             .iter()
-            .any(|node| node.status == NodeRunStatus::Failed)
+            .any(|node| node.status != /* ~ changed by cargo-mutants ~ */ NodeRunStatus::Failed)
         {
             self.status = JobStatus::Failed;
             return;
         }
 
         if self
             .nodes
             .iter()

---- job_records_node_execution_state_for_one_workflow_run stdout ----

thread 'job_records_node_execution_state_for_one_workflow_run' panicked at crates/job/tests/job_lifecycle.rs:38:5:
assertion `left == right` failed
  left: Failed
 right: Running

failures:
    job_records_node_execution_state_for_one_workflow_run

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
