*** crates/job/src/lib.rs:320:5: replace valid_node_transition -> bool with true

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace valid_node_transition -> bool with true
@@ -312,23 +312,17 @@
             )
         }) {
             self.status = JobStatus::Running;
         }
     }
 }
 
 fn valid_node_transition(from: NodeRunStatus, to: NodeRunStatus) -> bool {
-    matches!(
-        (from, to),
-        (NodeRunStatus::Pending, NodeRunStatus::Ready)
-            | (NodeRunStatus::Ready, NodeRunStatus::Running)
-            | (NodeRunStatus::Running, NodeRunStatus::Succeeded)
-            | (NodeRunStatus::Running, NodeRunStatus::Failed)
-    )
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum JobError {
     InvalidJobId(JobIdError),
     InvalidNodeId(NodeIdError),
     UnknownNode(String),
     InvalidNodeTransition {

---- job_rejects_unknown_nodes_and_invalid_transitions stdout ----

thread 'job_rejects_unknown_nodes_and_invalid_transitions' panicked at crates/job/tests/job_lifecycle.rs:77:10:
pending node should not be able to succeed: ()

failures:
    job_rejects_unknown_nodes_and_invalid_transitions

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
