*** crates/job/src/lib.rs:320:5: replace valid_node_transition -> bool with false

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace valid_node_transition -> bool with false
@@ -312,23 +312,17 @@
             )
         }) {
             self.status = JobStatus::Running;
         }
     }
 }
 
 fn valid_node_transition(from: NodeRunStatus, to: NodeRunStatus) -> bool {
-    matches!(
-        (from, to),
-        (NodeRunStatus::Pending, NodeRunStatus::Ready)
-            | (NodeRunStatus::Ready, NodeRunStatus::Running)
-            | (NodeRunStatus::Running, NodeRunStatus::Succeeded)
-            | (NodeRunStatus::Running, NodeRunStatus::Failed)
-    )
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum JobError {
     InvalidJobId(JobIdError),
     InvalidNodeId(NodeIdError),
     UnknownNode(String),
     InvalidNodeTransition {

---- job_records_node_execution_state_for_one_workflow_run stdout ----

thread 'job_records_node_execution_state_for_one_workflow_run' panicked at crates/job/tests/job_lifecycle.rs:36:10:
entry node should be ready to start: InvalidNodeTransition { node_id: "trigger", from: Ready, to: Running }

failures:
    job_records_node_execution_state_for_one_workflow_run

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
