*** crates/job/src/lib.rs:343:9: replace <impl fmt::Display for JobError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace <impl fmt::Display for JobError>::fmt -> fmt::Result with Ok(Default::default())
@@ -335,20 +335,13 @@
         node_id: String,
         from: NodeRunStatus,
         to: NodeRunStatus,
     },
 }
 
 impl fmt::Display for JobError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::InvalidJobId(error) => write!(f, "invalid job id: {error}"),
-            Self::InvalidNodeId(error) => write!(f, "invalid job node id: {error}"),
-            Self::UnknownNode(node_id) => write!(f, "job references unknown node: {node_id}"),
-            Self::InvalidNodeTransition { node_id, from, to } => {
-                write!(f, "node {node_id} cannot transition from {from} to {to}")
-            }
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for JobError {}

---- job_rejects_unknown_nodes_and_invalid_transitions stdout ----

thread 'job_rejects_unknown_nodes_and_invalid_transitions' panicked at crates/job/tests/job_lifecycle.rs:73:5:
assertion `left == right` failed
  left: ""
 right: "job references unknown node: missing"

failures:
    job_rejects_unknown_nodes_and_invalid_transitions

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
