*** crates/job/src/lib.rs:98:9: replace NodeRunStatus::as_str -> &'static str with "xyzzy"

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace NodeRunStatus::as_str -> &'static str with "xyzzy"
@@ -90,25 +90,17 @@
     Succeeded,
     Failed,
     Skipped,
     WaitingForApproval,
 }
 
 impl NodeRunStatus {
     pub fn as_str(self) -> &'static str {
-        match self {
-            Self::Pending => "pending",
-            Self::Ready => "ready",
-            Self::Running => "running",
-            Self::Succeeded => "succeeded",
-            Self::Failed => "failed",
-            Self::Skipped => "skipped",
-            Self::WaitingForApproval => "waiting_for_approval",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn is_success_terminal(self) -> bool {
         matches!(self, Self::Succeeded | Self::Skipped)
     }
 }
 
 impl fmt::Display for NodeRunStatus {

---- job_rejects_unknown_nodes_and_invalid_transitions stdout ----

thread 'job_rejects_unknown_nodes_and_invalid_transitions' panicked at crates/job/tests/job_lifecycle.rs:87:5:
assertion `left == right` failed
  left: "node inspect cannot transition from xyzzy to xyzzy"
 right: "node inspect cannot transition from pending to succeeded"

failures:
    job_rejects_unknown_nodes_and_invalid_transitions

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
