*** crates/cli/src/lib.rs:59:8: delete ! in validate_skill

*** mutation diff:
--- crates/cli/src/lib.rs
+++ delete ! in validate_skill
@@ -51,17 +51,17 @@
         descriptor.name,
         descriptor.packages.join(", ")
     )
 }
 
 pub fn validate_skill(path: &Path) -> Result<String, CliError> {
     let skill_file = path.join("SKILL.md");
 
-    if !skill_file.is_file() {
+    if  /* ~ changed by cargo-mutants ~ */skill_file.is_file() {
         return Err(CliError::MissingSkillFile(path.display().to_string()));
     }
 
     Ok(format!("validated skill template at {}", path.display()))
 }
 
 #[cfg(test)]
 mod tests {

*** result: Success
