*** crates/cli/src/main.rs:2:5: replace main with ()

*** mutation diff:
--- crates/cli/src/main.rs
+++ replace main with ()
@@ -1,9 +1,3 @@
 fn main() {
-    match cli::run(std::env::args()) {
-        Ok(output) => println!("{output}"),
-        Err(error) => {
-            eprintln!("{error}");
-            std::process::exit(1);
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
