*** crates/graph-viewer/src/view.rs:240:11: replace += with *= in draw_canvas_grid

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace += with *= in draw_canvas_grid
@@ -232,17 +232,17 @@
     let stroke = Stroke::new(1.0, Color32::from_rgb(25, 30, 36));
     let step = 48.0;
     let mut x = rect.left();
     while x <= rect.right() {
         painter.line_segment(
             [Pos2::new(x, rect.top()), Pos2::new(x, rect.bottom())],
             stroke,
         );
-        x += step;
+        x *= /* ~ changed by cargo-mutants ~ */ step;
     }
 
     let mut y = rect.top();
     while y <= rect.bottom() {
         painter.line_segment(
             [Pos2::new(rect.left(), y), Pos2::new(rect.right(), y)],
             stroke,
         );

*** result: Timeout
