*** crates/graph-viewer/src/view.rs:264:5: replace draw_arrow_head with ()

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace draw_arrow_head with ()
@@ -256,31 +256,17 @@
         Align2::CENTER_CENTER,
         message,
         FontId::proportional(18.0),
         Color32::from_rgb(184, 193, 205),
     );
 }
 
 fn draw_arrow_head(painter: &Painter, source: Pos2, target: Pos2, color: Color32) {
-    let direction = target - source;
-    let length = direction.length();
-    if length <= NODE_RADIUS {
-        return;
-    }
-
-    let unit = direction / length;
-    let normal = vec2(-unit.y, unit.x);
-    let tip = target - unit * NODE_RADIUS;
-    let left = tip - unit * 12.0 + normal * 6.0;
-    let right = tip - unit * 12.0 - normal * 6.0;
-    let stroke = Stroke::new(1.5, color);
-
-    painter.line_segment([left, tip], stroke);
-    painter.line_segment([right, tip], stroke);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_hex_color(value: &str) -> Option<Color32> {
     let value = value.strip_prefix('#').unwrap_or(value);
     if value.len() != 6 {
         return None;
     }

---- view::tests::arrow_head_uses_perpendicular_offsets_for_diagonal_edges stdout ----

thread 'view::tests::arrow_head_uses_perpendicular_offsets_for_diagonal_edges' panicked at crates/graph-viewer/src/view.rs:463:9:
assertion `left == right` failed: unexpected number of line segments
  left: 0
 right: 2

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:557:9:
assertion `left == right` failed: edge plus two arrow-head strokes
  left: 1
 right: 3

failures:
    view::tests::arrow_head_uses_perpendicular_offsets_for_diagonal_edges
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions

test result: FAILED. 17 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
