*** crates/graph-viewer/src/view.rs:270:26: replace / with * in draw_arrow_head

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace / with * in draw_arrow_head
@@ -262,17 +262,17 @@
 
 fn draw_arrow_head(painter: &Painter, source: Pos2, target: Pos2, color: Color32) {
     let direction = target - source;
     let length = direction.length();
     if length <= NODE_RADIUS {
         return;
     }
 
-    let unit = direction / length;
+    let unit = direction * /* ~ changed by cargo-mutants ~ */ length;
     let normal = vec2(-unit.y, unit.x);
     let tip = target - unit * NODE_RADIUS;
     let left = tip - unit * 12.0 + normal * 6.0;
     let right = tip - unit * 12.0 - normal * 6.0;
     let stroke = Stroke::new(1.5, color);
 
     painter.line_segment([left, tip], stroke);
     painter.line_segment([right, tip], stroke);

---- view::tests::arrow_head_uses_perpendicular_offsets_for_diagonal_edges stdout ----

thread 'view::tests::arrow_head_uses_perpendicular_offsets_for_diagonal_edges' panicked at crates/graph-viewer/src/view.rs:498:17:
unexpected line segment: [[-368841.2 -100553.1], [-201136.1 -100553.1]]

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:416:9:
expected position [2389973.5 478188.6] to be approximately [473.1 232.0]

failures:
    view::tests::arrow_head_uses_perpendicular_offsets_for_diagonal_edges
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions

test result: FAILED. 17 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
