*** crates/graph-viewer/src/view.rs:271:23: delete - in draw_arrow_head

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ delete - in draw_arrow_head
@@ -263,17 +263,17 @@
 fn draw_arrow_head(painter: &Painter, source: Pos2, target: Pos2, color: Color32) {
     let direction = target - source;
     let length = direction.length();
     if length <= NODE_RADIUS {
         return;
     }
 
     let unit = direction / length;
-    let normal = vec2(-unit.y, unit.x);
+    let normal = vec2( /* ~ changed by cargo-mutants ~ */unit.y, unit.x);
     let tip = target - unit * NODE_RADIUS;
     let left = tip - unit * 12.0 + normal * 6.0;
     let right = tip - unit * 12.0 - normal * 6.0;
     let stroke = Stroke::new(1.5, color);
 
     painter.line_segment([left, tip], stroke);
     painter.line_segment([right, tip], stroke);
 }

---- view::tests::arrow_head_uses_perpendicular_offsets_for_diagonal_edges stdout ----

thread 'view::tests::arrow_head_uses_perpendicular_offsets_for_diagonal_edges' panicked at crates/graph-viewer/src/view.rs:498:17:
unexpected line segment: [[85.9 62.0], [93.9 62.0]]

failures:
    view::tests::arrow_head_uses_perpendicular_offsets_for_diagonal_edges

test result: FAILED. 18 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
