*** crates/graph-viewer/src/view.rs:274:44: replace * with / in draw_arrow_head

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace * with / in draw_arrow_head
@@ -266,17 +266,17 @@
     if length <= NODE_RADIUS {
         return;
     }
 
     let unit = direction / length;
     let normal = vec2(-unit.y, unit.x);
     let tip = target - unit * NODE_RADIUS;
     let left = tip - unit * 12.0 + normal * 6.0;
-    let right = tip - unit * 12.0 - normal * 6.0;
+    let right = tip - unit * 12.0 - normal / /* ~ changed by cargo-mutants ~ */ 6.0;
     let stroke = Stroke::new(1.5, color);
 
     painter.line_segment([left, tip], stroke);
     painter.line_segment([right, tip], stroke);
 }
 
 fn parse_hex_color(value: &str) -> Option<Color32> {
     let value = value.strip_prefix('#').unwrap_or(value);

---- view::tests::arrow_head_uses_perpendicular_offsets_for_diagonal_edges stdout ----

thread 'view::tests::arrow_head_uses_perpendicular_offsets_for_diagonal_edges' panicked at crates/graph-viewer/src/view.rs:498:17:
unexpected line segment: [[83.2 56.4], [93.9 62.0]]

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:593:13:
assertion failed: (line_length(points) - 13.4164).abs() < 0.001

failures:
    view::tests::arrow_head_uses_perpendicular_offsets_for_diagonal_edges
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions

test result: FAILED. 17 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
