*** crates/graph-viewer/src/view.rs:282:5: replace parse_hex_color -> Option<Color32> with None

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace parse_hex_color -> Option<Color32> with None
@@ -274,25 +274,17 @@
     let right = tip - unit * 12.0 - normal * 6.0;
     let stroke = Stroke::new(1.5, color);
 
     painter.line_segment([left, tip], stroke);
     painter.line_segment([right, tip], stroke);
 }
 
 fn parse_hex_color(value: &str) -> Option<Color32> {
-    let value = value.strip_prefix('#').unwrap_or(value);
-    if value.len() != 6 {
-        return None;
-    }
-
-    let red = u8::from_str_radix(&value[0..2], 16).ok()?;
-    let green = u8::from_str_radix(&value[2..4], 16).ok()?;
-    let blue = u8::from_str_radix(&value[4..6], 16).ok()?;
-    Some(Color32::from_rgb(red, green, blue))
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn abbreviate(value: &str, max_chars: usize) -> String {
     let mut chars = value.chars();
     let shortened: String = chars.by_ref().take(max_chars).collect();
 
     if chars.next().is_some() {
         format!("{shortened}...")

---- view::tests::parse_hex_color_accepts_hash_or_plain_rgb_and_rejects_bad_values stdout ----

thread 'view::tests::parse_hex_color_accepts_hash_or_plain_rgb_and_rejects_bad_values' panicked at crates/graph-viewer/src/view.rs:722:9:
assertion `left == right` failed
  left: None
 right: Some(#4F_8C_FF_FF)

---- view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions stdout ----

thread 'view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions' panicked at crates/graph-viewer/src/view.rs:425:14:
expected circle with requested fill color

---- view::tests::ui_allocates_canvas_and_paints_graph_shapes stdout ----

thread 'view::tests::ui_allocates_canvas_and_paints_graph_shapes' panicked at crates/graph-viewer/src/view.rs:521:9:
assertion failed: shapes.iter().any(|shape|
        matches!(shape, Shape::Circle(circle) if circle.fill ==
            Color32::from_rgb(79, 140, 255)))

failures:
    view::tests::parse_hex_color_accepts_hash_or_plain_rgb_and_rejects_bad_values
    view::tests::ui_allocates_canvas_and_paints_graph_shapes
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions
    view::tests::ui_scales_node_positions_by_displayed_zoom

test result: FAILED. 15 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
