*** crates/graph-viewer/src/view.rs:283:20: replace != with == in parse_hex_color

*** mutation diff:
--- crates/graph-viewer/src/view.rs
+++ replace != with == in parse_hex_color
@@ -275,17 +275,17 @@
     let stroke = Stroke::new(1.5, color);
 
     painter.line_segment([left, tip], stroke);
     painter.line_segment([right, tip], stroke);
 }
 
 fn parse_hex_color(value: &str) -> Option<Color32> {
     let value = value.strip_prefix('#').unwrap_or(value);
-    if value.len() != 6 {
+    if value.len() == /* ~ changed by cargo-mutants ~ */ 6 {
         return None;
     }
 
     let red = u8::from_str_radix(&value[0..2], 16).ok()?;
     let green = u8::from_str_radix(&value[2..4], 16).ok()?;
     let blue = u8::from_str_radix(&value[4..6], 16).ok()?;
     Some(Color32::from_rgb(red, green, blue))
 }

---- view::tests::parse_hex_color_accepts_hash_or_plain_rgb_and_rejects_bad_values stdout ----

thread 'view::tests::parse_hex_color_accepts_hash_or_plain_rgb_and_rejects_bad_values' panicked at crates/graph-viewer/src/view.rs:730:9:
assertion `left == right` failed
  left: None
 right: Some(#4F_8C_FF_FF)

---- view::tests::ui_allocates_canvas_and_paints_graph_shapes stdout ----

thread 'view::tests::ui_allocates_canvas_and_paints_graph_shapes' panicked at crates/graph-viewer/src/view.rs:529:9:
assertion failed: shapes.iter().any(|shape|
        matches!(shape, Shape::Circle(circle) if circle.fill ==
            Color32::from_rgb(79, 140, 255)))

---- view::tests::ui_scales_node_positions_by_displayed_zoom stdout ----

thread 'view::tests::ui_scales_node_positions_by_displayed_zoom' panicked at crates/graph-viewer/src/view.rs:433:14:
expected circle with requested fill color

failures:
    view::tests::parse_hex_color_accepts_hash_or_plain_rgb_and_rejects_bad_values
    view::tests::ui_allocates_canvas_and_paints_graph_shapes
    view::tests::ui_places_nodes_edges_and_arrow_head_at_expected_positions
    view::tests::ui_scales_node_positions_by_displayed_zoom

test result: FAILED. 15 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
