*** crates/job/src/lib.rs:157:9: replace JobNode::attempts -> u32 with 0

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace JobNode::attempts -> u32 with 0
@@ -149,17 +149,17 @@
         &self.node_id
     }
 
     pub fn status(&self) -> NodeRunStatus {
         self.status
     }
 
     pub fn attempts(&self) -> u32 {
-        self.attempts
+        0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub struct Job {
     id: JobId,
     workflow_id: String,
     input_json: String,

*** result: Success
