*** crates/job/src/lib.rs:256:9: replace Job::fail_node -> Result<(), JobError> with Ok(())

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace Job::fail_node -> Result<(), JobError> with Ok(())
@@ -248,17 +248,17 @@
         self.transition_node(node_id, NodeRunStatus::Running)
     }
 
     pub fn succeed_node(&mut self, node_id: impl Into<String>) -> Result<(), JobError> {
         self.transition_node(node_id, NodeRunStatus::Succeeded)
     }
 
     pub fn fail_node(&mut self, node_id: impl Into<String>) -> Result<(), JobError> {
-        self.transition_node(node_id, NodeRunStatus::Failed)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn transition_node(
         &mut self,
         node_id: impl Into<String>,
         to: NodeRunStatus,
     ) -> Result<(), JobError> {
         let node_id = NodeId::new(node_id).map_err(JobError::InvalidNodeId)?;

*** result: Success
