*** crates/job/src/lib.rs:281:15: replace == with != in Job::transition_node

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace == with != in Job::transition_node
@@ -273,17 +273,17 @@
             return Err(JobError::InvalidNodeTransition {
                 node_id: node_id.to_string(),
                 from,
                 to,
             });
         }
 
         node.status = to;
-        if to == NodeRunStatus::Running {
+        if to != /* ~ changed by cargo-mutants ~ */ NodeRunStatus::Running {
             node.attempts += 1;
         }
         self.refresh_status();
 
         Ok(())
     }
 
     fn refresh_status(&mut self) {

*** result: Success
