*** crates/job/src/lib.rs:47:9: replace <impl fmt::Display for JobIdError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/job/src/lib.rs
+++ replace <impl fmt::Display for JobIdError>::fmt -> fmt::Result with Ok(Default::default())
@@ -39,22 +39,17 @@
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum JobIdError {
     Empty,
     ContainsWhitespace(String),
 }
 
 impl fmt::Display for JobIdError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::Empty => write!(f, "job id cannot be empty"),
-            Self::ContainsWhitespace(value) => {
-                write!(f, "job id cannot contain whitespace: {value}")
-            }
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for JobIdError {}
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum JobStatus {
     Created,

*** result: Success
