*** crates/node/src/lib.rs:129:9: replace <impl fmt::Display for NodeKindParseError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/node/src/lib.rs
+++ replace <impl fmt::Display for NodeKindParseError>::fmt -> fmt::Result with Ok(Default::default())
@@ -121,19 +121,17 @@
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum NodeKindParseError {
     Unknown(String),
 }
 
 impl fmt::Display for NodeKindParseError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::Unknown(value) => write!(f, "unknown node kind: {value}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for NodeKindParseError {}
 
 #[derive(Debug, Clone, Default, PartialEq, Eq)]
 pub struct NodeContract {
     pub inputs: Vec<String>,

*** result: Success
