*** crates/node/src/lib.rs:83:9: replace NodeKind::as_str -> &'static str with "xyzzy"

*** mutation diff:
--- crates/node/src/lib.rs
+++ replace NodeKind::as_str -> &'static str with "xyzzy"
@@ -75,27 +75,17 @@
         Self::Condition,
         Self::Loop,
         Self::Join,
         Self::Approval,
         Self::Artifact,
     ];
 
     pub fn as_str(self) -> &'static str {
-        match self {
-            Self::Trigger => "trigger",
-            Self::LlmTask => "llm_task",
-            Self::CodeTask => "code_task",
-            Self::Integration => "integration",
-            Self::Condition => "condition",
-            Self::Loop => "loop",
-            Self::Join => "join",
-            Self::Approval => "approval",
-            Self::Artifact => "artifact",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for NodeKind {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(self.as_str())
     }
 }

---- node_kind_uses_workflow_spec_identifiers stdout ----

thread 'node_kind_uses_workflow_spec_identifiers' panicked at crates/node/tests/node_contract.rs:9:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "trigger"

failures:
    node_kind_uses_workflow_spec_identifiers

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
