*** crates/runtime/src/lib.rs:131:24: replace == with != in RuntimeOutput::success

*** mutation diff:
--- crates/runtime/src/lib.rs
+++ replace == with != in RuntimeOutput::success
@@ -123,17 +123,17 @@
     pub sandbox: BackendReport,
     pub stdout: String,
     pub stderr: String,
     pub exit_code: Option<i32>,
 }
 
 impl RuntimeOutput {
     pub fn success(&self) -> bool {
-        self.exit_code == Some(0)
+        self.exit_code != /* ~ changed by cargo-mutants ~ */ Some(0)
     }
 }
 
 #[derive(Debug)]
 pub struct RuntimePlan {
     pub target: RuntimeTargetKind,
     pub sandbox: BackendReport,
     pub command: CommandSpec,

---- runtime_output_success_only_accepts_zero_exit_code stdout ----

thread 'runtime_output_success_only_accepts_zero_exit_code' panicked at crates/runtime/tests/runtime_execution.rs:455:5:
assertion failed: backend_report(Some(0)).success()

---- agent_runtime_captures_nonzero_status_and_stderr stdout ----

thread 'agent_runtime_captures_nonzero_status_and_stderr' panicked at crates/runtime/tests/runtime_execution.rs:397:5:
assertion failed: !output.success()

---- runs_agent_command_with_input_through_the_configured_sandbox stdout ----

thread 'runs_agent_command_with_input_through_the_configured_sandbox' panicked at crates/runtime/tests/runtime_execution.rs:170:5:
assertion failed: output.success()

failures:
    agent_runtime_captures_nonzero_status_and_stderr
    runs_agent_command_with_input_through_the_configured_sandbox
    runs_rust_script_with_input_through_the_configured_sandbox
    runtime_output_success_only_accepts_zero_exit_code

test result: FAILED. 16 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.05s

*** result: Failure(101)
