*** crates/runtime/src/lib.rs:131:9: replace RuntimeOutput::success -> bool with true

*** mutation diff:
--- crates/runtime/src/lib.rs
+++ replace RuntimeOutput::success -> bool with true
@@ -123,17 +123,17 @@
     pub sandbox: BackendReport,
     pub stdout: String,
     pub stderr: String,
     pub exit_code: Option<i32>,
 }
 
 impl RuntimeOutput {
     pub fn success(&self) -> bool {
-        self.exit_code == Some(0)
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug)]
 pub struct RuntimePlan {
     pub target: RuntimeTargetKind,
     pub sandbox: BackendReport,
     pub command: CommandSpec,

---- runtime_output_success_only_accepts_zero_exit_code stdout ----

thread 'runtime_output_success_only_accepts_zero_exit_code' panicked at crates/runtime/tests/runtime_execution.rs:456:5:
assertion failed: !backend_report(Some(1)).success()

---- agent_runtime_captures_nonzero_status_and_stderr stdout ----

thread 'agent_runtime_captures_nonzero_status_and_stderr' panicked at crates/runtime/tests/runtime_execution.rs:397:5:
assertion failed: !output.success()

failures:
    agent_runtime_captures_nonzero_status_and_stderr
    runtime_output_success_only_accepts_zero_exit_code

test result: FAILED. 18 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.44s

*** result: Failure(101)
