*** crates/runtime/src/lib.rs:131:9: replace RuntimeOutput::success -> bool with false

*** mutation diff:
--- crates/runtime/src/lib.rs
+++ replace RuntimeOutput::success -> bool with false
@@ -123,17 +123,17 @@
     pub sandbox: BackendReport,
     pub stdout: String,
     pub stderr: String,
     pub exit_code: Option<i32>,
 }
 
 impl RuntimeOutput {
     pub fn success(&self) -> bool {
-        self.exit_code == Some(0)
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug)]
 pub struct RuntimePlan {
     pub target: RuntimeTargetKind,
     pub sandbox: BackendReport,
     pub command: CommandSpec,

---- runtime_output_success_only_accepts_zero_exit_code stdout ----

thread 'runtime_output_success_only_accepts_zero_exit_code' panicked at crates/runtime/tests/runtime_execution.rs:455:5:
assertion failed: backend_report(Some(0)).success()

---- runs_agent_command_with_input_through_the_configured_sandbox stdout ----

thread 'runs_agent_command_with_input_through_the_configured_sandbox' panicked at crates/runtime/tests/runtime_execution.rs:170:5:
assertion failed: output.success()

---- runs_rust_script_with_input_through_the_configured_sandbox stdout ----

thread 'runs_rust_script_with_input_through_the_configured_sandbox' panicked at crates/runtime/tests/runtime_execution.rs:150:5:
assertion failed: output.success()

failures:
    runs_agent_command_with_input_through_the_configured_sandbox
    runs_rust_script_with_input_through_the_configured_sandbox
    runtime_output_success_only_accepts_zero_exit_code

test result: FAILED. 17 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.83s

*** result: Failure(101)
