*** crates/runtime/src/lib.rs:152:9: replace <impl fmt::Display for RuntimeError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/runtime/src/lib.rs
+++ replace <impl fmt::Display for RuntimeError>::fmt -> fmt::Result with Ok(Default::default())
@@ -144,20 +144,17 @@
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum RuntimeError {
     Sandbox(SandboxError),
     Script(ScriptError),
 }
 
 impl fmt::Display for RuntimeError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::Sandbox(error) => write!(f, "runtime sandbox failed: {error}"),
-            Self::Script(error) => write!(f, "runtime script failed: {error}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for RuntimeError {}
 
 impl From<SandboxError> for RuntimeError {
     fn from(error: SandboxError) -> Self {
         Self::Sandbox(error)

---- runtime_error_display_includes_wrapped_error_message stdout ----

thread 'runtime_error_display_includes_wrapped_error_message' panicked at crates/runtime/tests/runtime_execution.rs:405:5:
assertion `left == right` failed
  left: ""
 right: "runtime sandbox failed: sandbox process failed: spawn failed"

failures:
    runtime_error_display_includes_wrapped_error_message

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.08s

*** result: Failure(101)
