*** crates/runtime/src/lib.rs:201:9: replace RuntimeRunner::with_script_runner -> Self with Default::default()

*** mutation diff:
--- crates/runtime/src/lib.rs
+++ replace RuntimeRunner::with_script_runner -> Self with Default::default()
@@ -193,18 +193,17 @@
     pub fn for_sandbox_runner(sandbox_runner: SandboxRunner) -> Self {
         Self {
             sandbox_runner,
             script_runner: ScriptRunner::default(),
         }
     }
 
     pub fn with_script_runner(mut self, script_runner: ScriptRunner) -> Self {
-        self.script_runner = script_runner;
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn compile(&self, request: &RuntimeRequest) -> Result<RuntimePlan, RuntimeError> {
         match &request.target {
             RuntimeTarget::Script { rust_source } => self.compile_script(request, rust_source),
             RuntimeTarget::Agent { command } => self.compile_agent(request, command),
         }
     }

---- custom_script_runner_is_used_for_script_compilation stdout ----

thread 'custom_script_runner_is_used_for_script_compilation' panicked at crates/runtime/tests/runtime_execution.rs:448:10:
custom missing rustc should be used: RuntimeOutput { target: Script, sandbox: BackendReport { platform: Macos, kind: Direct, available: true, detail: "sandbox disabled by explicit danger-full-access policy" }, stdout: "{}", stderr: "", exit_code: Some(0) }

failures:
    custom_script_runner_is_used_for_script_compilation

test result: FAILED. 19 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.76s

*** result: Failure(101)
