*** crates/runtime/src/lib.rs:226:35: replace == with != in RuntimeRunner::compile_script

*** mutation diff:
--- crates/runtime/src/lib.rs
+++ replace == with != in RuntimeRunner::compile_script
@@ -218,17 +218,17 @@
         &self,
         request: &RuntimeRequest,
         rust_source: &str,
     ) -> Result<RuntimePlan, RuntimeError> {
         let script_request = ScriptRequest::new(rust_source, &request.input_json);
         let compiled = self.script_runner.compile(&script_request)?;
         let mut policy = request.sandbox.to_policy();
 
-        if policy.filesystem.mode == FilesystemMode::Restricted {
+        if policy.filesystem.mode != /* ~ changed by cargo-mutants ~ */ FilesystemMode::Restricted {
             policy.filesystem.entries.push(FilesystemEntry::new(
                 compiled.workspace_path(),
                 FilesystemAccess::Read,
             ));
         }
 
         let command = CommandSpec::new(compiled.binary_path().display().to_string())
             .stdin(compiled.input_json());

---- restricted_script_plan_adds_compiled_workspace_read_entry stdout ----

thread 'restricted_script_plan_adds_compiled_workspace_read_entry' panicked at crates/runtime/tests/runtime_execution.rs:306:5:
assertion `left == right` failed
  left: None
 right: Some(Read)

---- unrestricted_script_plan_does_not_add_compiled_workspace_entry stdout ----

thread 'unrestricted_script_plan_does_not_add_compiled_workspace_entry' panicked at crates/runtime/tests/runtime_execution.rs:330:5:
assertion failed: plan.policy.filesystem.entries.is_empty()

failures:
    restricted_script_plan_adds_compiled_workspace_read_entry
    unrestricted_script_plan_does_not_add_compiled_workspace_entry

test result: FAILED. 18 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.35s

*** result: Failure(101)
