*** crates/script-registry/src/lib.rs:108:9: replace ScriptDefinition::set_rust_source with ()

*** mutation diff:
--- crates/script-registry/src/lib.rs
+++ replace ScriptDefinition::set_rust_source with ()
@@ -100,17 +100,17 @@
     where
         I: IntoIterator<Item = ScriptDependency>,
     {
         self.dependencies.extend(dependencies);
         self
     }
 
     pub fn set_rust_source(&mut self, rust_source: impl Into<String>) {
-        self.rust_source = rust_source.into();
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn set_dependencies<I>(&mut self, dependencies: I)
     where
         I: IntoIterator<Item = ScriptDependency>,
     {
         self.dependencies = dependencies.into_iter().collect();
     }

---- registry_updates_and_removes_scripts stdout ----

thread 'registry_updates_and_removes_scripts' panicked at crates/script-registry/tests/registry.rs:131:5:
assertion `left == right` failed
  left: "old"
 right: "new"

failures:
    registry_updates_and_removes_scripts

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.17s

*** result: Failure(101)
