*** crates/script-registry/src/lib.rs:115:9: replace ScriptDefinition::set_dependencies with ()

*** mutation diff:
--- crates/script-registry/src/lib.rs
+++ replace ScriptDefinition::set_dependencies with ()
@@ -107,17 +107,17 @@
     pub fn set_rust_source(&mut self, rust_source: impl Into<String>) {
         self.rust_source = rust_source.into();
     }
 
     pub fn set_dependencies<I>(&mut self, dependencies: I)
     where
         I: IntoIterator<Item = ScriptDependency>,
     {
-        self.dependencies = dependencies.into_iter().collect();
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn request(&self, input_json: impl Into<String>) -> ScriptRequest {
         ScriptRequest::new(&self.rust_source, input_json)
             .with_dependencies(self.dependencies.iter().cloned())
     }
 }

---- registry_updates_and_removes_scripts stdout ----

thread 'registry_updates_and_removes_scripts' panicked at crates/script-registry/tests/registry.rs:123:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    registry_updates_and_removes_scripts

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.40s

*** result: Failure(101)
