*** crates/script-registry/src/lib.rs:135:9: replace ScriptRegistry::insert -> Result<(), ScriptRegistryError> with Ok(())

*** mutation diff:
--- crates/script-registry/src/lib.rs
+++ replace ScriptRegistry::insert -> Result<(), ScriptRegistryError> with Ok(())
@@ -127,22 +127,17 @@
 }
 
 impl ScriptRegistry {
     pub fn new() -> Self {
         Self::default()
     }
 
     pub fn insert(&mut self, script: ScriptDefinition) -> Result<(), ScriptRegistryError> {
-        if self.scripts.contains_key(script.id()) {
-            return Err(ScriptRegistryError::DuplicateId(script.id().clone()));
-        }
-
-        self.scripts.insert(script.id().clone(), script);
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn resolve(&self, id: impl Into<String>) -> Result<&ScriptDefinition, ScriptRegistryError> {
         let id = ScriptId::new(id).map_err(ScriptRegistryError::InvalidId)?;
 
         self.scripts
             .get(&id)
             .ok_or(ScriptRegistryError::UnknownId(id))

---- registry_iterates_scripts_by_id_order stdout ----

thread 'registry_iterates_scripts_by_id_order' panicked at crates/script-registry/tests/registry.rs:109:5:
assertion `left == right` failed
  left: []
 right: ["debug-voc", "release-notes"]

---- registry_resolves_script_by_id_and_builds_requests stdout ----

thread 'registry_resolves_script_by_id_and_builds_requests' panicked at crates/script-registry/tests/registry.rs:31:10:
script should resolve: UnknownId(ScriptId("echo-json"))

---- registry_rejects_duplicate_script_ids stdout ----

thread 'registry_rejects_duplicate_script_ids' panicked at crates/script-registry/tests/registry.rs:53:10:
registry should reject duplicate script ids: ()

failures:
    file_store_reloads_saved_registry_from_disk_and_runs_loaded_script
    file_store_roundtrips_dependency_sources
    registry_iterates_scripts_by_id_order
    registry_rejects_duplicate_script_ids
    registry_resolves_script_by_id_and_builds_requests
    registry_updates_and_removes_scripts

test result: FAILED. 4 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
