*** crates/script-registry/src/lib.rs:156:9: replace ScriptRegistry::get_mut -> Option<&mut ScriptDefinition> with None

*** mutation diff:
--- crates/script-registry/src/lib.rs
+++ replace ScriptRegistry::get_mut -> Option<&mut ScriptDefinition> with None
@@ -148,17 +148,17 @@
             .ok_or(ScriptRegistryError::UnknownId(id))
     }
 
     pub fn get(&self, id: &ScriptId) -> Option<&ScriptDefinition> {
         self.scripts.get(id)
     }
 
     pub fn get_mut(&mut self, id: &ScriptId) -> Option<&mut ScriptDefinition> {
-        self.scripts.get_mut(id)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn remove(&mut self, id: &ScriptId) -> Option<ScriptDefinition> {
         self.scripts.remove(id)
     }
 
     pub fn len(&self) -> usize {
         self.scripts.len()

---- registry_updates_and_removes_scripts stdout ----

thread 'registry_updates_and_removes_scripts' panicked at crates/script-registry/tests/registry.rs:114:10:
script should be available for mutation

failures:
    registry_updates_and_removes_scripts

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.32s

*** result: Failure(101)
