*** crates/script-registry/src/lib.rs:160:9: replace ScriptRegistry::remove -> Option<ScriptDefinition> with None

*** mutation diff:
--- crates/script-registry/src/lib.rs
+++ replace ScriptRegistry::remove -> Option<ScriptDefinition> with None
@@ -152,17 +152,17 @@
         self.scripts.get(id)
     }
 
     pub fn get_mut(&mut self, id: &ScriptId) -> Option<&mut ScriptDefinition> {
         self.scripts.get_mut(id)
     }
 
     pub fn remove(&mut self, id: &ScriptId) -> Option<ScriptDefinition> {
-        self.scripts.remove(id)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn len(&self) -> usize {
         self.scripts.len()
     }
 
     pub fn is_empty(&self) -> bool {
         self.scripts.is_empty()

---- registry_updates_and_removes_scripts stdout ----

thread 'registry_updates_and_removes_scripts' panicked at crates/script-registry/tests/registry.rs:134:40:
script should be removed

failures:
    registry_updates_and_removes_scripts

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.97s

*** result: Failure(101)
