*** crates/script-registry/src/lib.rs:164:9: replace ScriptRegistry::len -> usize with 1

*** mutation diff:
--- crates/script-registry/src/lib.rs
+++ replace ScriptRegistry::len -> usize with 1
@@ -156,17 +156,17 @@
         self.scripts.get_mut(id)
     }
 
     pub fn remove(&mut self, id: &ScriptId) -> Option<ScriptDefinition> {
         self.scripts.remove(id)
     }
 
     pub fn len(&self) -> usize {
-        self.scripts.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_empty(&self) -> bool {
         self.scripts.is_empty()
     }
 
     pub fn iter(&self) -> impl Iterator<Item = &ScriptDefinition> {
         self.scripts.values()

*** result: Success
