*** crates/script-registry/src/lib.rs:168:9: replace ScriptRegistry::is_empty -> bool with true

*** mutation diff:
--- crates/script-registry/src/lib.rs
+++ replace ScriptRegistry::is_empty -> bool with true
@@ -160,17 +160,17 @@
         self.scripts.remove(id)
     }
 
     pub fn len(&self) -> usize {
         self.scripts.len()
     }
 
     pub fn is_empty(&self) -> bool {
-        self.scripts.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn iter(&self) -> impl Iterator<Item = &ScriptDefinition> {
         self.scripts.values()
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]

*** result: Success
