*** crates/script-registry/src/lib.rs:168:9: replace ScriptRegistry::is_empty -> bool with false

*** mutation diff:
--- crates/script-registry/src/lib.rs
+++ replace ScriptRegistry::is_empty -> bool with false
@@ -160,17 +160,17 @@
         self.scripts.remove(id)
     }
 
     pub fn len(&self) -> usize {
         self.scripts.len()
     }
 
     pub fn is_empty(&self) -> bool {
-        self.scripts.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn iter(&self) -> impl Iterator<Item = &ScriptDefinition> {
         self.scripts.values()
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]

---- file_store_loads_missing_file_as_empty_registry stdout ----

thread 'file_store_loads_missing_file_as_empty_registry' panicked at crates/script-registry/tests/registry.rs:232:5:
assertion failed: registry.is_empty()

---- registry_updates_and_removes_scripts stdout ----

thread 'registry_updates_and_removes_scripts' panicked at crates/script-registry/tests/registry.rs:137:5:
assertion failed: registry.is_empty()

failures:
    file_store_loads_missing_file_as_empty_registry
    registry_updates_and_removes_scripts

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.95s

*** result: Failure(101)
