*** crates/script-registry/src/lib.rs:172:9: replace ScriptRegistry::iter -> impl Iterator<Item =&ScriptDefinition> with ::std::iter::empty()

*** mutation diff:
--- crates/script-registry/src/lib.rs
+++ replace ScriptRegistry::iter -> impl Iterator<Item =&ScriptDefinition> with ::std::iter::empty()
@@ -164,17 +164,17 @@
         self.scripts.len()
     }
 
     pub fn is_empty(&self) -> bool {
         self.scripts.is_empty()
     }
 
     pub fn iter(&self) -> impl Iterator<Item = &ScriptDefinition> {
-        self.scripts.values()
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum ScriptRegistryError {
     InvalidId(ScriptIdError),
     DuplicateId(ScriptId),
     UnknownId(ScriptId),

---- registry_iterates_scripts_by_id_order stdout ----

thread 'registry_iterates_scripts_by_id_order' panicked at crates/script-registry/tests/registry.rs:109:5:
assertion `left == right` failed
  left: []
 right: ["debug-voc", "release-notes"]

---- file_store_roundtrips_dependency_sources stdout ----

thread 'file_store_roundtrips_dependency_sources' panicked at crates/script-registry/tests/registry.rs:206:57:
called `Result::unwrap()` on an `Err` value: UnknownId(ScriptId("dependencies"))

---- file_store_reloads_saved_registry_from_disk_and_runs_loaded_script stdout ----

thread 'file_store_reloads_saved_registry_from_disk_and_runs_loaded_script' panicked at crates/script-registry/tests/registry.rs:168:10:
saved script should resolve: UnknownId(ScriptId("echo-json"))

failures:
    file_store_reloads_saved_registry_from_disk_and_runs_loaded_script
    file_store_roundtrips_dependency_sources
    registry_iterates_scripts_by_id_order

test result: FAILED. 7 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
