*** crates/script-registry/src/lib.rs:185:9: replace <impl fmt::Display for ScriptRegistryError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/script-registry/src/lib.rs
+++ replace <impl fmt::Display for ScriptRegistryError>::fmt -> fmt::Result with Ok(Default::default())
@@ -177,21 +177,17 @@
 pub enum ScriptRegistryError {
     InvalidId(ScriptIdError),
     DuplicateId(ScriptId),
     UnknownId(ScriptId),
 }
 
 impl fmt::Display for ScriptRegistryError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::InvalidId(error) => write!(f, "{error}"),
-            Self::DuplicateId(id) => write!(f, "duplicate script id: {id}"),
-            Self::UnknownId(id) => write!(f, "unknown script id: {id}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for ScriptRegistryError {}
 
 pub trait ScriptStore {
     fn load(&self) -> Result<ScriptRegistry, ScriptStoreError>;

---- registry_reports_unknown_script_ids stdout ----

thread 'registry_reports_unknown_script_ids' panicked at crates/script-registry/tests/registry.rs:74:5:
assertion `left == right` failed
  left: ""
 right: "unknown script id: missing"

---- registry_rejects_duplicate_script_ids stdout ----

thread 'registry_rejects_duplicate_script_ids' panicked at crates/script-registry/tests/registry.rs:59:5:
assertion `left == right` failed
  left: ""
 right: "duplicate script id: summarize"

failures:
    registry_rejects_duplicate_script_ids
    registry_reports_unknown_script_ids

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.55s

*** result: Failure(101)
