*** crates/script-registry/src/lib.rs:222:12: delete ! in <impl ScriptStore for FileScriptStore>::load

*** mutation diff:
--- crates/script-registry/src/lib.rs
+++ delete ! in <impl ScriptStore for FileScriptStore>::load
@@ -214,17 +214,17 @@
 
     pub fn path(&self) -> &Path {
         &self.path
     }
 }
 
 impl ScriptStore for FileScriptStore {
     fn load(&self) -> Result<ScriptRegistry, ScriptStoreError> {
-        if !self.path.exists() {
+        if  /* ~ changed by cargo-mutants ~ */self.path.exists() {
             return Ok(ScriptRegistry::new());
         }
 
         let contents = fs::read_to_string(&self.path)
             .map_err(|error| ScriptStoreError::io(&self.path, error))?;
         let document: StoredScriptDocument =
             toml::from_str(&contents).map_err(|error| ScriptStoreError::Decode {
                 path: self.path.clone(),

---- file_store_loads_missing_file_as_empty_registry stdout ----

thread 'file_store_loads_missing_file_as_empty_registry' panicked at crates/script-registry/tests/registry.rs:230:33:
missing file should load as empty: Io { path: "/var/folders/j9/vyb9gbys5db86cwqm3mld1fw0000gn/T/manual-script-registry-loads-missing-file-1778057870031308000-41055/.manual/scripts.toml", message: "No such file or directory (os error 2)" }

---- file_store_roundtrips_dependency_sources stdout ----

thread 'file_store_roundtrips_dependency_sources' panicked at crates/script-registry/tests/registry.rs:206:57:
called `Result::unwrap()` on an `Err` value: UnknownId(ScriptId("dependencies"))

---- file_store_reloads_saved_registry_from_disk_and_runs_loaded_script stdout ----

thread 'file_store_reloads_saved_registry_from_disk_and_runs_loaded_script' panicked at crates/script-registry/tests/registry.rs:168:10:
saved script should resolve: UnknownId(ScriptId("echo-json"))

failures:
    file_store_loads_missing_file_as_empty_registry
    file_store_reloads_saved_registry_from_disk_and_runs_loaded_script
    file_store_roundtrips_dependency_sources

test result: FAILED. 7 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
