*** crates/script-registry/src/lib.rs:222:9: replace <impl ScriptStore for FileScriptStore>::load -> Result<ScriptRegistry, ScriptStoreError> with Ok(Default::default())

*** mutation diff:
--- crates/script-registry/src/lib.rs
+++ replace <impl ScriptStore for FileScriptStore>::load -> Result<ScriptRegistry, ScriptStoreError> with Ok(Default::default())
@@ -214,29 +214,17 @@
 
     pub fn path(&self) -> &Path {
         &self.path
     }
 }
 
 impl ScriptStore for FileScriptStore {
     fn load(&self) -> Result<ScriptRegistry, ScriptStoreError> {
-        if !self.path.exists() {
-            return Ok(ScriptRegistry::new());
-        }
-
-        let contents = fs::read_to_string(&self.path)
-            .map_err(|error| ScriptStoreError::io(&self.path, error))?;
-        let document: StoredScriptDocument =
-            toml::from_str(&contents).map_err(|error| ScriptStoreError::Decode {
-                path: self.path.clone(),
-                message: error.to_string(),
-            })?;
-
-        document.into_registry()
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn save(&self, registry: &ScriptRegistry) -> Result<(), ScriptStoreError> {
         let document = StoredScriptDocument::from_registry(registry);
         let contents =
             toml::to_string_pretty(&document).map_err(|error| ScriptStoreError::Encode {
                 message: error.to_string(),
             })?;

---- file_store_reloads_saved_registry_from_disk_and_runs_loaded_script stdout ----

thread 'file_store_reloads_saved_registry_from_disk_and_runs_loaded_script' panicked at crates/script-registry/tests/registry.rs:159:10:
saved script should resolve: UnknownId(ScriptId("echo-json"))

---- file_store_roundtrips_dependency_sources stdout ----

thread 'file_store_roundtrips_dependency_sources' panicked at crates/script-registry/tests/registry.rs:194:57:
called `Result::unwrap()` on an `Err` value: UnknownId(ScriptId("dependencies"))

failures:
    file_store_reloads_saved_registry_from_disk_and_runs_loaded_script
    file_store_roundtrips_dependency_sources

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
