*** crates/script-registry/src/lib.rs:238:9: replace <impl ScriptStore for FileScriptStore>::save -> Result<(), ScriptStoreError> with Ok(())

*** mutation diff:
--- crates/script-registry/src/lib.rs
+++ replace <impl ScriptStore for FileScriptStore>::save -> Result<(), ScriptStoreError> with Ok(())
@@ -230,29 +230,17 @@
                 path: self.path.clone(),
                 message: error.to_string(),
             })?;
 
         document.into_registry()
     }
 
     fn save(&self, registry: &ScriptRegistry) -> Result<(), ScriptStoreError> {
-        let document = StoredScriptDocument::from_registry(registry);
-        let contents =
-            toml::to_string_pretty(&document).map_err(|error| ScriptStoreError::Encode {
-                message: error.to_string(),
-            })?;
-
-        if let Some(parent) = self.path.parent() {
-            if !parent.as_os_str().is_empty() {
-                fs::create_dir_all(parent).map_err(|error| ScriptStoreError::io(parent, error))?;
-            }
-        }
-
-        fs::write(&self.path, contents).map_err(|error| ScriptStoreError::io(&self.path, error))
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum ScriptStoreError {
     Io { path: PathBuf, message: String },
     Decode { path: PathBuf, message: String },
     Encode { message: String },

---- file_store_reloads_saved_registry_from_disk_and_runs_loaded_script stdout ----

thread 'file_store_reloads_saved_registry_from_disk_and_runs_loaded_script' panicked at crates/script-registry/tests/registry.rs:168:10:
saved script should resolve: UnknownId(ScriptId("echo-json"))

---- file_store_roundtrips_dependency_sources stdout ----

thread 'file_store_roundtrips_dependency_sources' panicked at crates/script-registry/tests/registry.rs:206:57:
called `Result::unwrap()` on an `Err` value: UnknownId(ScriptId("dependencies"))

failures:
    file_store_reloads_saved_registry_from_disk_and_runs_loaded_script
    file_store_roundtrips_dependency_sources

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
