*** crates/script-registry/src/lib.rs:310:9: replace StoredScriptDocument::into_registry -> Result<ScriptRegistry, ScriptStoreError> with Ok(Default::default())

*** mutation diff:
--- crates/script-registry/src/lib.rs
+++ replace StoredScriptDocument::into_registry -> Result<ScriptRegistry, ScriptStoreError> with Ok(Default::default())
@@ -302,25 +302,17 @@
             scripts: registry
                 .iter()
                 .map(StoredScriptDefinition::from_definition)
                 .collect(),
         }
     }
 
     fn into_registry(self) -> Result<ScriptRegistry, ScriptStoreError> {
-        let mut registry = ScriptRegistry::new();
-
-        for script in self.scripts {
-            registry
-                .insert(script.into_definition()?)
-                .map_err(ScriptStoreError::Registry)?;
-        }
-
-        Ok(registry)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, Serialize, Deserialize)]
 struct StoredScriptDefinition {
     id: String,
     rust_source: String,
     dependencies: Vec<StoredScriptDependency>,

---- file_store_roundtrips_dependency_sources stdout ----

thread 'file_store_roundtrips_dependency_sources' panicked at crates/script-registry/tests/registry.rs:206:57:
called `Result::unwrap()` on an `Err` value: UnknownId(ScriptId("dependencies"))

---- file_store_reloads_saved_registry_from_disk_and_runs_loaded_script stdout ----

thread 'file_store_reloads_saved_registry_from_disk_and_runs_loaded_script' panicked at crates/script-registry/tests/registry.rs:168:10:
saved script should resolve: UnknownId(ScriptId("echo-json"))

failures:
    file_store_reloads_saved_registry_from_disk_and_runs_loaded_script
    file_store_roundtrips_dependency_sources

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
