*** crates/script-registry/src/lib.rs:52:9: replace <impl fmt::Display for ScriptIdError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/script-registry/src/lib.rs
+++ replace <impl fmt::Display for ScriptIdError>::fmt -> fmt::Result with Ok(Default::default())
@@ -44,22 +44,17 @@
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum ScriptIdError {
     Empty,
     ContainsWhitespace(String),
 }
 
 impl fmt::Display for ScriptIdError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::Empty => write!(f, "script id cannot be empty"),
-            Self::ContainsWhitespace(value) => {
-                write!(f, "script id cannot contain whitespace: {value}")
-            }
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for ScriptIdError {}
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub struct ScriptDefinition {
     id: ScriptId,

*** result: Success
