*** crates/script-registry/src/lib.rs:87:9: replace ScriptDefinition::rust_source -> &str with ""

*** mutation diff:
--- crates/script-registry/src/lib.rs
+++ replace ScriptDefinition::rust_source -> &str with ""
@@ -79,17 +79,17 @@
         })
     }
 
     pub fn id(&self) -> &ScriptId {
         &self.id
     }
 
     pub fn rust_source(&self) -> &str {
-        &self.rust_source
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn dependencies(&self) -> &[ScriptDependency] {
         &self.dependencies
     }
 
     pub fn with_dependency(mut self, dependency: ScriptDependency) -> Self {
         self.dependencies.push(dependency);

---- tests::script_definition_builds_request_with_dependencies stdout ----

thread 'tests::script_definition_builds_request_with_dependencies' panicked at crates/script-registry/src/lib.rs:420:9:
assertion `left == right` failed
  left: "fn main(input: &str) -> String { input.into() }"
 right: ""

failures:
    tests::script_definition_builds_request_with_dependencies

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
