*** crates/script-registry/src/lib.rs:91:9: replace ScriptDefinition::dependencies -> &[ScriptDependency] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/script-registry/src/lib.rs
+++ replace ScriptDefinition::dependencies -> &[ScriptDependency] with Vec::leak(Vec::new())
@@ -83,17 +83,17 @@
         &self.id
     }
 
     pub fn rust_source(&self) -> &str {
         &self.rust_source
     }
 
     pub fn dependencies(&self) -> &[ScriptDependency] {
-        &self.dependencies
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn with_dependency(mut self, dependency: ScriptDependency) -> Self {
         self.dependencies.push(dependency);
         self
     }
 
     pub fn with_dependencies<I>(mut self, dependencies: I) -> Self

---- tests::script_definition_builds_request_with_dependencies stdout ----

thread 'tests::script_definition_builds_request_with_dependencies' panicked at crates/script-registry/src/lib.rs:422:9:
assertion `left == right` failed
  left: [ScriptDependency { name: "serde_json", source: Version("1") }]
 right: []

failures:
    tests::script_definition_builds_request_with_dependencies

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
