*** crates/script/src/lib.rs:107:9: replace <impl fmt::Display for ScriptError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/script/src/lib.rs
+++ replace <impl fmt::Display for ScriptError>::fmt -> fmt::Result with Ok(Default::default())
@@ -99,25 +99,17 @@
         stdout: String,
         stderr: String,
         exit_code: Option<i32>,
     },
 }
 
 impl fmt::Display for ScriptError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::Io(message) => write!(f, "script process failed: {message}"),
-            Self::CompileFailed {
-                stderr, exit_code, ..
-            } => write!(
-                f,
-                "script compilation failed with exit code {exit_code:?}: {stderr}"
-            ),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for ScriptError {}
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub struct ScriptRunner {
     cargo: PathBuf,

---- script_errors_have_display_messages stdout ----

thread 'script_errors_have_display_messages' panicked at crates/script/tests/rust_script.rs:197:5:
assertion `left == right` failed
  left: ""
 right: "script process failed: spawn failed"

failures:
    script_errors_have_display_messages

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.39s

*** result: Failure(101)
