*** crates/script/src/lib.rs:150:9: replace ScriptRunner::with_cargo -> Self with Default::default()

*** mutation diff:
--- crates/script/src/lib.rs
+++ replace ScriptRunner::with_cargo -> Self with Default::default()
@@ -142,18 +142,17 @@
 }
 
 impl ScriptRunner {
     pub fn new() -> Self {
         Self::default()
     }
 
     pub fn with_cargo(mut self, cargo: impl Into<PathBuf>) -> Self {
-        self.cargo = cargo.into();
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn with_rustc(mut self, rustc: impl Into<PathBuf>) -> Self {
         self.rustc = rustc.into();
         self
     }
 
     pub fn with_temp_root(mut self, temp_root: impl Into<PathBuf>) -> Self {

---- custom_cargo_path_is_used_for_dependency_scripts stdout ----

thread 'custom_cargo_path_is_used_for_dependency_scripts' panicked at crates/script/tests/rust_script.rs:122:10:
custom cargo path should be used for dependency scripts: ScriptOutput { stdout: "{}", stderr: "", exit_code: Some(0) }

failures:
    custom_cargo_path_is_used_for_dependency_scripts

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.77s

*** result: Failure(101)
