*** crates/script/src/lib.rs:155:9: replace ScriptRunner::with_rustc -> Self with Default::default()

*** mutation diff:
--- crates/script/src/lib.rs
+++ replace ScriptRunner::with_rustc -> Self with Default::default()
@@ -147,18 +147,17 @@
     }
 
     pub fn with_cargo(mut self, cargo: impl Into<PathBuf>) -> Self {
         self.cargo = cargo.into();
         self
     }
 
     pub fn with_rustc(mut self, rustc: impl Into<PathBuf>) -> Self {
-        self.rustc = rustc.into();
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn with_temp_root(mut self, temp_root: impl Into<PathBuf>) -> Self {
         self.temp_root = temp_root.into();
         self
     }
 
     pub fn compile(&self, request: &ScriptRequest) -> Result<CompiledScript, ScriptError> {

---- custom_rustc_path_is_used stdout ----

thread 'custom_rustc_path_is_used' panicked at crates/script/tests/rust_script.rs:133:10:
custom rustc path should be used: ScriptOutput { stdout: "{}", stderr: "", exit_code: Some(0) }

failures:
    custom_rustc_path_is_used

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.00s

*** result: Failure(101)
