*** crates/script/src/lib.rs:160:9: replace ScriptRunner::with_temp_root -> Self with Default::default()

*** mutation diff:
--- crates/script/src/lib.rs
+++ replace ScriptRunner::with_temp_root -> Self with Default::default()
@@ -152,18 +152,17 @@
     }
 
     pub fn with_rustc(mut self, rustc: impl Into<PathBuf>) -> Self {
         self.rustc = rustc.into();
         self
     }
 
     pub fn with_temp_root(mut self, temp_root: impl Into<PathBuf>) -> Self {
-        self.temp_root = temp_root.into();
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn compile(&self, request: &ScriptRequest) -> Result<CompiledScript, ScriptError> {
         if !request.dependencies.is_empty() {
             return self.compile_with_cargo(request);
         }
 
         self.compile_with_rustc(request)

---- custom_temp_root_is_used stdout ----

thread 'custom_temp_root_is_used' panicked at crates/script/tests/rust_script.rs:144:10:
missing custom temp root should be used: ScriptOutput { stdout: "{}", stderr: "", exit_code: Some(0) }

failures:
    custom_temp_root_is_used

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.61s

*** result: Failure(101)
