*** crates/script/src/lib.rs:165:12: delete ! in ScriptRunner::compile

*** mutation diff:
--- crates/script/src/lib.rs
+++ delete ! in ScriptRunner::compile
@@ -157,17 +157,17 @@
     }
 
     pub fn with_temp_root(mut self, temp_root: impl Into<PathBuf>) -> Self {
         self.temp_root = temp_root.into();
         self
     }
 
     pub fn compile(&self, request: &ScriptRequest) -> Result<CompiledScript, ScriptError> {
-        if !request.dependencies.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */request.dependencies.is_empty() {
             return self.compile_with_cargo(request);
         }
 
         self.compile_with_rustc(request)
     }
 
     fn compile_with_rustc(&self, request: &ScriptRequest) -> Result<CompiledScript, ScriptError> {
         let workspace = ScriptWorkspace::create(&self.temp_root)?;

---- runs_rust_source_with_path_library_dependency stdout ----

thread 'runs_rust_source_with_path_library_dependency' panicked at crates/script/tests/rust_script.rs:101:10:

---- custom_cargo_path_is_used_for_dependency_scripts stdout ----

thread 'custom_cargo_path_is_used_for_dependency_scripts' panicked at crates/script/tests/rust_script.rs:122:10:
custom cargo path should be used for dependency scripts: ScriptOutput { stdout: "{}", stderr: "", exit_code: Some(0) }

---- custom_rustc_path_is_used stdout ----

thread 'custom_rustc_path_is_used' panicked at crates/script/tests/rust_script.rs:133:10:
custom rustc path should be used: ScriptOutput { stdout: "{}", stderr: "", exit_code: Some(0) }

failures:
    custom_cargo_path_is_used_for_dependency_scripts
    custom_rustc_path_is_used
    runs_rust_source_with_path_library_dependency

test result: FAILED. 7 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.27s

*** result: Failure(101)
