*** crates/script/src/lib.rs:190:12: delete ! in ScriptRunner::compile_with_rustc

*** mutation diff:
--- crates/script/src/lib.rs
+++ delete ! in ScriptRunner::compile_with_rustc
@@ -182,17 +182,17 @@
             .arg("--edition")
             .arg(&self.edition)
             .arg(&wrapper_path)
             .arg("-o")
             .arg(&binary_path)
             .output()
             .map_err(to_io_error)?;
 
-        if !compile_output.status.success() {
+        if  /* ~ changed by cargo-mutants ~ */compile_output.status.success() {
             return Err(ScriptError::CompileFailed {
                 stdout: String::from_utf8_lossy(&compile_output.stdout).into_owned(),
                 stderr: String::from_utf8_lossy(&compile_output.stderr).into_owned(),
                 exit_code: compile_output.status.code(),
             });
         }
 
         Ok(CompiledScript {

---- compile_errors_are_reported_with_stderr stdout ----

thread 'compile_errors_are_reported_with_stderr' panicked at crates/script/tests/rust_script.rs:232:18:
expected compile failure, got Io("No such file or directory (os error 2)")

---- runtime_failures_capture_exit_code_and_stderr stdout ----

thread 'runtime_failures_capture_exit_code_and_stderr' panicked at crates/script/tests/rust_script.rs:250:10:
script should compile even when it exits with failure: CompileFailed { stdout: "", stderr: "", exit_code: Some(0) }

---- compiled_script_exposes_binary_workspace_and_input_until_dropped stdout ----

thread 'compiled_script_exposes_binary_workspace_and_input_until_dropped' panicked at crates/script/tests/rust_script.rs:178:10:
script should compile: CompileFailed { stdout: "", stderr: "", exit_code: Some(0) }

failures:
    compile_errors_are_reported_with_stderr
    compiled_script_exposes_binary_workspace_and_input_until_dropped
    runs_rust_source_by_passing_json_input_to_script_main
    runtime_failures_capture_exit_code_and_stderr
    temporary_script_workspace_is_removed_after_run

test result: FAILED. 5 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.89s

*** result: Failure(101)
