*** crates/script/src/lib.rs:292:9: replace CompiledScript::input_json -> &str with "xyzzy"

*** mutation diff:
--- crates/script/src/lib.rs
+++ replace CompiledScript::input_json -> &str with "xyzzy"
@@ -284,17 +284,17 @@
         &self.binary_path
     }
 
     pub fn workspace_path(&self) -> &Path {
         self.workspace.path()
     }
 
     pub fn input_json(&self) -> &str {
-        &self.input_json
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug)]
 struct ScriptWorkspace {
     path: PathBuf,
 }

---- compiled_script_exposes_binary_workspace_and_input_until_dropped stdout ----

thread 'compiled_script_exposes_binary_workspace_and_input_until_dropped' panicked at crates/script/tests/rust_script.rs:184:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "{}"

---- runs_rust_source_by_passing_json_input_to_script_main stdout ----

thread 'runs_rust_source_by_passing_json_input_to_script_main' panicked at crates/script/tests/rust_script.rs:78:5:
assertion `left == right` failed
  left: "{\"received\":xyzzy}"
 right: "{\"received\":{\"name\":\"manual\",\"count\":2}}"

---- runs_rust_source_with_path_library_dependency stdout ----

thread 'runs_rust_source_with_path_library_dependency' panicked at crates/script/tests/rust_script.rs:104:5:
assertion `left == right` failed
  left: "helper-len=5"
 right: "helper-len=21"

failures:
    compiled_script_exposes_binary_workspace_and_input_until_dropped
    runs_rust_source_by_passing_json_input_to_script_main
    runs_rust_source_with_path_library_dependency

test result: FAILED. 7 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.56s

*** result: Failure(101)
