*** crates/script/src/lib.rs:322:9: replace <impl Drop for ScriptWorkspace>::drop with ()

*** mutation diff:
--- crates/script/src/lib.rs
+++ replace <impl Drop for ScriptWorkspace>::drop with ()
@@ -314,17 +314,17 @@
 
     fn path(&self) -> &Path {
         &self.path
     }
 }
 
 impl Drop for ScriptWorkspace {
     fn drop(&mut self) {
-        let _ = fs::remove_dir_all(&self.path);
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn wrapper_source(user_source_path: &Path) -> String {
     format!(
         r#"
 mod manual_script {{
     include!({});

---- compiled_script_exposes_binary_workspace_and_input_until_dropped stdout ----

thread 'compiled_script_exposes_binary_workspace_and_input_until_dropped' panicked at crates/script/tests/rust_script.rs:188:5:
compiled script workspace should be removed when dropped

---- temporary_script_workspace_is_removed_after_run stdout ----

thread 'temporary_script_workspace_is_removed_after_run' panicked at crates/script/tests/rust_script.rs:160:5:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    compiled_script_exposes_binary_workspace_and_input_until_dropped
    temporary_script_workspace_is_removed_after_run

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.98s

*** result: Failure(101)
