*** crates/script/src/lib.rs:327:5: replace wrapper_source -> String with String::new()

*** mutation diff:
--- crates/script/src/lib.rs
+++ replace wrapper_source -> String with String::new()
@@ -319,41 +319,17 @@
 
 impl Drop for ScriptWorkspace {
     fn drop(&mut self) {
         let _ = fs::remove_dir_all(&self.path);
     }
 }
 
 fn wrapper_source(user_source_path: &Path) -> String {
-    format!(
-        r#"
-mod manual_script {{
-    include!({});
-
-    pub fn __manual_run(input_json: &str) -> impl std::fmt::Display {{
-        main(input_json)
-    }}
-}}
-
-fn main() {{
-    let mut input_json = String::new();
-    let mut stdin = std::io::stdin();
-
-    if let Err(error) = std::io::Read::read_to_string(&mut stdin, &mut input_json) {{
-        eprintln!("failed to read JSON input: {{error}}");
-        std::process::exit(125);
-    }}
-
-    let output = manual_script::__manual_run(&input_json);
-    print!("{{output}}");
-}}
-"#,
-        rust_string_literal(&user_source_path.display().to_string())
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn cargo_manifest(dependencies: &[ScriptDependency], edition: &str) -> String {
     let mut manifest = format!(
         r#"[package]
 name = "manual-script-runner"
 version = "0.1.0"
 edition = {}

---- runtime_failures_capture_exit_code_and_stderr stdout ----

thread 'runtime_failures_capture_exit_code_and_stderr' panicked at crates/script/tests/rust_script.rs:250:10:

---- temporary_script_workspace_is_removed_after_run stdout ----

thread 'temporary_script_workspace_is_removed_after_run' panicked at crates/script/tests/rust_script.rs:157:10:

---- compiled_script_exposes_binary_workspace_and_input_until_dropped stdout ----

thread 'compiled_script_exposes_binary_workspace_and_input_until_dropped' panicked at crates/script/tests/rust_script.rs:178:10:

failures:
    compile_errors_are_reported_with_stderr
    compiled_script_exposes_binary_workspace_and_input_until_dropped
    runs_rust_source_by_passing_json_input_to_script_main
    runs_rust_source_with_path_library_dependency
    runtime_failures_capture_exit_code_and_stderr
    temporary_script_workspace_is_removed_after_run

test result: FAILED. 4 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.38s

*** result: Failure(101)
