*** crates/script/src/lib.rs:355:5: replace cargo_manifest -> String with String::new()

*** mutation diff:
--- crates/script/src/lib.rs
+++ replace cargo_manifest -> String with String::new()
@@ -347,36 +347,17 @@
     print!("{{output}}");
 }}
 "#,
         rust_string_literal(&user_source_path.display().to_string())
     )
 }
 
 fn cargo_manifest(dependencies: &[ScriptDependency], edition: &str) -> String {
-    let mut manifest = format!(
-        r#"[package]
-name = "manual-script-runner"
-version = "0.1.0"
-edition = {}
-
-[dependencies]
-"#,
-        toml_string_literal(edition)
-    );
-
-    for dependency in dependencies {
-        manifest.push_str(&dependency.name);
-        manifest.push_str(" = ");
-        manifest.push_str(&dependency_manifest_value(dependency));
-        manifest.push('\n');
-    }
-
-    manifest.push_str("\n[workspace]\n");
-    manifest
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn dependency_manifest_value(dependency: &ScriptDependency) -> String {
     match &dependency.source {
         ScriptDependencySource::Version(version) => toml_string_literal(version),
         ScriptDependencySource::Path(path) => {
             format!(
                 "{{ path = {} }}",

---- tests::cargo_manifest_renders_supported_dependency_sources stdout ----

thread 'tests::cargo_manifest_renders_supported_dependency_sources' panicked at crates/script/src/lib.rs:457:9:
assertion failed: manifest.contains("edition = \"2024\"")

failures:
    tests::cargo_manifest_renders_supported_dependency_sources

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
