*** crates/script/src/lib.rs:378:5: replace dependency_manifest_value -> String with String::new()

*** mutation diff:
--- crates/script/src/lib.rs
+++ replace dependency_manifest_value -> String with String::new()
@@ -370,26 +370,17 @@
         manifest.push('\n');
     }
 
     manifest.push_str("\n[workspace]\n");
     manifest
 }
 
 fn dependency_manifest_value(dependency: &ScriptDependency) -> String {
-    match &dependency.source {
-        ScriptDependencySource::Version(version) => toml_string_literal(version),
-        ScriptDependencySource::Path(path) => {
-            format!(
-                "{{ path = {} }}",
-                toml_string_literal(&path.display().to_string())
-            )
-        }
-        ScriptDependencySource::ManifestValue(value) => value.clone(),
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn rust_string_literal(value: &str) -> String {
     quoted_string_literal(value)
 }
 
 fn toml_string_literal(value: &str) -> String {
     quoted_string_literal(value)

---- tests::cargo_manifest_renders_supported_dependency_sources stdout ----

thread 'tests::cargo_manifest_renders_supported_dependency_sources' panicked at crates/script/src/lib.rs:468:9:
assertion failed: manifest.contains("serde_json = \"1\"")

failures:
    tests::cargo_manifest_renders_supported_dependency_sources

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
