*** crates/script/src/lib.rs:391:5: replace rust_string_literal -> String with "xyzzy".into()

*** mutation diff:
--- crates/script/src/lib.rs
+++ replace rust_string_literal -> String with "xyzzy".into()
@@ -383,17 +383,17 @@
                 toml_string_literal(&path.display().to_string())
             )
         }
         ScriptDependencySource::ManifestValue(value) => value.clone(),
     }
 }
 
 fn rust_string_literal(value: &str) -> String {
-    quoted_string_literal(value)
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn toml_string_literal(value: &str) -> String {
     quoted_string_literal(value)
 }
 
 fn quoted_string_literal(value: &str) -> String {
     let mut escaped = String::with_capacity(value.len() + 2);

---- compiled_script_exposes_binary_workspace_and_input_until_dropped stdout ----

thread 'compiled_script_exposes_binary_workspace_and_input_until_dropped' panicked at crates/script/tests/rust_script.rs:178:10:

---- runs_rust_source_by_passing_json_input_to_script_main stdout ----

thread 'runs_rust_source_by_passing_json_input_to_script_main' panicked at crates/script/tests/rust_script.rs:75:10:

---- compile_errors_are_reported_with_stderr stdout ----

thread 'compile_errors_are_reported_with_stderr' panicked at crates/script/tests/rust_script.rs:230:13:
assertion failed: stderr.contains("missing_symbol")

failures:
    compile_errors_are_reported_with_stderr
    compiled_script_exposes_binary_workspace_and_input_until_dropped
    runs_rust_source_by_passing_json_input_to_script_main
    runs_rust_source_with_path_library_dependency
    runtime_failures_capture_exit_code_and_stderr
    temporary_script_workspace_is_removed_after_run

test result: FAILED. 4 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
