*** crates/script/src/lib.rs:395:5: replace toml_string_literal -> String with String::new()

*** mutation diff:
--- crates/script/src/lib.rs
+++ replace toml_string_literal -> String with String::new()
@@ -387,17 +387,17 @@
     }
 }
 
 fn rust_string_literal(value: &str) -> String {
     quoted_string_literal(value)
 }
 
 fn toml_string_literal(value: &str) -> String {
-    quoted_string_literal(value)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn quoted_string_literal(value: &str) -> String {
     let mut escaped = String::with_capacity(value.len() + 2);
     escaped.push('"');
 
     for character in value.chars() {
         match character {

---- tests::cargo_manifest_renders_supported_dependency_sources stdout ----

thread 'tests::cargo_manifest_renders_supported_dependency_sources' panicked at crates/script/src/lib.rs:476:9:
assertion failed: manifest.contains("edition = \"2024\"")

failures:
    tests::cargo_manifest_renders_supported_dependency_sources

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
