*** crates/script/src/lib.rs:399:5: replace quoted_string_literal -> String with "xyzzy".into()

*** mutation diff:
--- crates/script/src/lib.rs
+++ replace quoted_string_literal -> String with "xyzzy".into()
@@ -391,32 +391,17 @@
     quoted_string_literal(value)
 }
 
 fn toml_string_literal(value: &str) -> String {
     quoted_string_literal(value)
 }
 
 fn quoted_string_literal(value: &str) -> String {
-    let mut escaped = String::with_capacity(value.len() + 2);
-    escaped.push('"');
-
-    for character in value.chars() {
-        match character {
-            '\\' => escaped.push_str("\\\\"),
-            '"' => escaped.push_str("\\\""),
-            '\n' => escaped.push_str("\\n"),
-            '\r' => escaped.push_str("\\r"),
-            '\t' => escaped.push_str("\\t"),
-            other => escaped.push(other),
-        }
-    }
-
-    escaped.push('"');
-    escaped
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn binary_name() -> &'static str {
     if cfg!(windows) {
         "script.exe"
     } else {
         "script"
     }

---- tests::cargo_manifest_renders_supported_dependency_sources stdout ----

thread 'tests::cargo_manifest_renders_supported_dependency_sources' panicked at crates/script/src/lib.rs:461:9:
assertion failed: manifest.contains("edition = \"2024\"")

failures:
    tests::cargo_manifest_renders_supported_dependency_sources

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
