*** crates/script/src/lib.rs:418:5: replace binary_name -> &'static str with "xyzzy"

*** mutation diff:
--- crates/script/src/lib.rs
+++ replace binary_name -> &'static str with "xyzzy"
@@ -410,21 +410,17 @@
         }
     }
 
     escaped.push('"');
     escaped
 }
 
 fn binary_name() -> &'static str {
-    if cfg!(windows) {
-        "script.exe"
-    } else {
-        "script"
-    }
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }
 
 fn cargo_binary_name() -> &'static str {
     if cfg!(windows) {
         "manual-script-runner.exe"
     } else {
         "manual-script-runner"
     }

---- tests::binary_name_matches_host_executable_convention stdout ----

thread 'tests::binary_name_matches_host_executable_convention' panicked at crates/script/src/lib.rs:449:13:
assertion `left == right` failed
  left: "xyzzy"
 right: "script"

failures:
    tests::binary_name_matches_host_executable_convention

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
