*** crates/script/src/lib.rs:426:5: replace cargo_binary_name -> &'static str with ""

*** mutation diff:
--- crates/script/src/lib.rs
+++ replace cargo_binary_name -> &'static str with ""
@@ -418,21 +418,17 @@
     if cfg!(windows) {
         "script.exe"
     } else {
         "script"
     }
 }
 
 fn cargo_binary_name() -> &'static str {
-    if cfg!(windows) {
-        "manual-script-runner.exe"
-    } else {
-        "manual-script-runner"
-    }
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 fn timestamp_nanos() -> u128 {
     SystemTime::now()
         .duration_since(UNIX_EPOCH)
         .map(|duration| duration.as_nanos())
         .unwrap_or(0)
 }

---- runs_rust_source_with_path_library_dependency stdout ----

thread 'runs_rust_source_with_path_library_dependency' panicked at crates/script/tests/rust_script.rs:101:10:
script should compile and run with a path dependency: Io("Permission denied (os error 13)")

failures:
    runs_rust_source_with_path_library_dependency

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.30s

*** result: Failure(101)
