*** crates/script/src/lib.rs:434:5: replace timestamp_nanos -> u128 with 0

*** mutation diff:
--- crates/script/src/lib.rs
+++ replace timestamp_nanos -> u128 with 0
@@ -426,20 +426,17 @@
     if cfg!(windows) {
         "manual-script-runner.exe"
     } else {
         "manual-script-runner"
     }
 }
 
 fn timestamp_nanos() -> u128 {
-    SystemTime::now()
-        .duration_since(UNIX_EPOCH)
-        .map(|duration| duration.as_nanos())
-        .unwrap_or(0)
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn to_io_error(error: io::Error) -> ScriptError {
     ScriptError::Io(error.to_string())
 }
 
 #[cfg(test)]
 mod tests {

---- tests::timestamp_uses_current_unix_time stdout ----

thread 'tests::timestamp_uses_current_unix_time' panicked at crates/script/src/lib.rs:456:9:
assertion failed: timestamp_nanos() > 1

failures:
    tests::timestamp_uses_current_unix_time

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
