*** crates/skill/src/lib.rs:8:5: replace run -> Result<String, cli::CliError> with Ok(String::new())

*** mutation diff:
--- crates/skill/src/lib.rs
+++ replace run -> Result<String, cli::CliError> with Ok(String::new())
@@ -1,38 +1,16 @@
 const BUNDLED_SKILL_DIR: &str = concat!(env!("CARGO_MANIFEST_DIR"), "/templates/default-skill");
 
 pub fn run<I, S>(args: I) -> Result<String, cli::CliError>
 where
     I: IntoIterator<Item = S>,
     S: AsRef<str>,
 {
-    let mut forwarded = args
-        .into_iter()
-        .map(|value| value.as_ref().to_string())
-        .collect::<Vec<_>>();
-
-    if forwarded.is_empty() {
-        return cli::run(["cli", "about"]);
-    }
-
-    forwarded[0] = "manual-skill".to_string();
-
-    match forwarded.get(1).map(String::as_str) {
-        None => cli::run(["cli", "about"]),
-        Some("template-path") => Ok(BUNDLED_SKILL_DIR.to_string()),
-        Some("validate-bundled") => {
-            cli::run(["cli", "validate-skill", BUNDLED_SKILL_DIR])
-        }
-        Some(_) => {
-            forwarded[0] = "cli".to_string();
-            let forwarded_refs = forwarded.iter().map(String::as_str).collect::<Vec<_>>();
-            cli::run(forwarded_refs)
-        }
-    }
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::run;
 
     #[test]
     fn validate_bundled_template_uses_cli_validation() {

---- tests::validate_bundled_template_uses_cli_validation stdout ----

thread 'tests::validate_bundled_template_uses_cli_validation' panicked at crates/skill/src/lib.rs:20:9:
assertion failed: output.contains("validated skill template")

failures:
    tests::validate_bundled_template_uses_cli_validation

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
