*** crates/workflow-registry/src/lib.rs:37:9: replace WorkflowId::into_string -> String with "xyzzy".into()

*** mutation diff:
--- crates/workflow-registry/src/lib.rs
+++ replace WorkflowId::into_string -> String with "xyzzy".into()
@@ -29,17 +29,17 @@
         Ok(Self(value))
     }
 
     pub fn as_str(&self) -> &str {
         &self.0
     }
 
     pub fn into_string(self) -> String {
-        self.0
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for WorkflowId {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(&self.0)
     }
 }

*** result: Success
