*** crates/workflow-registry/src/lib.rs:55:9: replace <impl fmt::Display for WorkflowIdError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/workflow-registry/src/lib.rs
+++ replace <impl fmt::Display for WorkflowIdError>::fmt -> fmt::Result with Ok(Default::default())
@@ -47,22 +47,17 @@
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum WorkflowIdError {
     Empty,
     ContainsWhitespace(String),
 }
 
 impl fmt::Display for WorkflowIdError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::Empty => write!(f, "workflow id cannot be empty"),
-            Self::ContainsWhitespace(value) => {
-                write!(f, "workflow id cannot contain whitespace: {value}")
-            }
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for WorkflowIdError {}
 
 #[derive(Debug, Clone, Default, PartialEq, Eq)]
 pub struct WorkflowRegistry {
     workflows: BTreeMap<WorkflowId, Workflow>,

*** result: Success
