*** crates/workflow/src/lib.rs:143:9: replace WorkflowEdge::label -> Option<&str> with Some("")

*** mutation diff:
--- crates/workflow/src/lib.rs
+++ replace WorkflowEdge::label -> Option<&str> with Some("")
@@ -135,17 +135,17 @@
         &self.target
     }
 
     pub fn kind(&self) -> WorkflowEdgeKind {
         self.kind
     }
 
     pub fn label(&self) -> Option<&str> {
-        self.label.as_deref()
+        Some("") /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum WorkflowEdgeKind {
     Sequence,
     Branch,
     LoopBack,

---- workflow_combines_nodes_into_a_task_graph stdout ----

thread 'workflow_combines_nodes_into_a_task_graph' panicked at crates/workflow/tests/workflow_graph.rs:67:5:
assertion `left == right` failed
  left: Some("")
 right: Some("summarize")

failures:
    workflow_combines_nodes_into_a_task_graph

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
