*** crates/workflow/src/lib.rs:168:9: replace WorkflowEdgeKind::as_str -> &'static str with "xyzzy"

*** mutation diff:
--- crates/workflow/src/lib.rs
+++ replace WorkflowEdgeKind::as_str -> &'static str with "xyzzy"
@@ -160,24 +160,17 @@
         Self::Branch,
         Self::LoopBack,
         Self::Parallel,
         Self::Join,
         Self::Error,
     ];
 
     pub fn as_str(self) -> &'static str {
-        match self {
-            Self::Sequence => "sequence",
-            Self::Branch => "branch",
-            Self::LoopBack => "loop_back",
-            Self::Parallel => "parallel",
-            Self::Join => "join",
-            Self::Error => "error",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for WorkflowEdgeKind {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(self.as_str())
     }
 }

---- workflow_edge_kind_uses_workflow_spec_identifiers stdout ----

thread 'workflow_edge_kind_uses_workflow_spec_identifiers' panicked at crates/workflow/tests/workflow_graph.rs:8:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "sequence"

---- parses_workflow_edge_kind_from_workflow_spec_identifier stdout ----

thread 'parses_workflow_edge_kind_from_workflow_spec_identifier' panicked at crates/workflow/tests/workflow_graph.rs:24:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "parallel"

failures:
    parses_workflow_edge_kind_from_workflow_spec_identifier
    workflow_edge_kind_uses_workflow_spec_identifiers

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
