*** crates/workflow/src/lib.rs:208:9: replace <impl fmt::Display for WorkflowEdgeKindParseError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/workflow/src/lib.rs
+++ replace <impl fmt::Display for WorkflowEdgeKindParseError>::fmt -> fmt::Result with Ok(Default::default())
@@ -200,19 +200,17 @@
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum WorkflowEdgeKindParseError {
     Unknown(String),
 }
 
 impl fmt::Display for WorkflowEdgeKindParseError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::Unknown(value) => write!(f, "unknown workflow edge kind: {value}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for WorkflowEdgeKindParseError {}
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum WorkflowError {
     EmptyGraph,

---- parses_workflow_edge_kind_from_workflow_spec_identifier stdout ----

thread 'parses_workflow_edge_kind_from_workflow_spec_identifier' panicked at crates/workflow/tests/workflow_graph.rs:25:5:
assertion `left == right` failed
  left: ""
 right: "unknown workflow edge kind: unknown"

failures:
    parses_workflow_edge_kind_from_workflow_spec_identifier

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
