*** crates/workflow/src/lib.rs:235:9: replace <impl fmt::Display for WorkflowError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/workflow/src/lib.rs
+++ replace <impl fmt::Display for WorkflowError>::fmt -> fmt::Result with Ok(Default::default())
@@ -227,36 +227,17 @@
     SelfLoop {
         edge_index: usize,
         node_id: String,
     },
 }
 
 impl fmt::Display for WorkflowError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::EmptyGraph => write!(f, "workflow must contain at least one node"),
-            Self::DuplicateNode(id) => write!(f, "duplicate node id: {id}"),
-            Self::InvalidEntryNode(error) => write!(f, "invalid entry node id: {error}"),
-            Self::MissingEntryNode(node_id) => {
-                write!(f, "entry node does not exist: {node_id}")
-            }
-            Self::MissingEndpoint {
-                edge_index,
-                endpoint,
-                node_id,
-            } => write!(
-                f,
-                "edge {edge_index} references missing {endpoint} node: {node_id}"
-            ),
-            Self::SelfLoop {
-                edge_index,
-                node_id,
-            } => write!(f, "edge {edge_index} cannot point {node_id} to itself"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for WorkflowError {}
 
 fn validate_graph(
     entry_node: &NodeId,
     nodes: &[Node],

---- workflow_rejects_missing_entry_nodes stdout ----

thread 'workflow_rejects_missing_entry_nodes' panicked at crates/workflow/tests/workflow_graph.rs:155:5:
assertion `left == right` failed
  left: ""
 right: "entry node does not exist: trigger"

---- workflow_rejects_empty_graphs stdout ----

thread 'workflow_rejects_empty_graphs' panicked at crates/workflow/tests/workflow_graph.rs:112:5:
assertion `left == right` failed
  left: ""
 right: "workflow must contain at least one node"

---- workflow_rejects_duplicate_node_ids stdout ----

thread 'workflow_rejects_duplicate_node_ids' panicked at crates/workflow/tests/workflow_graph.rs:133:5:
assertion `left == right` failed
  left: ""
 right: "duplicate node id: inspect"

failures:
    workflow_rejects_direct_self_loops
    workflow_rejects_duplicate_node_ids
    workflow_rejects_empty_graphs
    workflow_rejects_graphs_with_missing_edge_endpoints
    workflow_rejects_missing_entry_nodes

test result: FAILED. 3 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
