*** crates/workflow/src/lib.rs:265:5: replace validate_graph -> Result<(), WorkflowError> with Ok(())

*** mutation diff:
--- crates/workflow/src/lib.rs
+++ replace validate_graph -> Result<(), WorkflowError> with Ok(())
@@ -257,51 +257,10 @@
 
 impl std::error::Error for WorkflowError {}
 
 fn validate_graph(
     entry_node: &NodeId,
     nodes: &[Node],
     edges: &[WorkflowEdge],
 ) -> Result<(), WorkflowError> {
-    if nodes.is_empty() {
-        return Err(WorkflowError::EmptyGraph);
-    }
-
-    let mut node_ids = BTreeSet::new();
-
-    for node in nodes {
-        if !node_ids.insert(node.id.as_str().to_string()) {
-            return Err(WorkflowError::DuplicateNode(node.id.to_string()));
-        }
-    }
-
-    if !node_ids.contains(entry_node.as_str()) {
-        return Err(WorkflowError::MissingEntryNode(entry_node.to_string()));
-    }
-
-    for (edge_index, edge) in edges.iter().enumerate() {
-        if edge.source == edge.target {
-            return Err(WorkflowError::SelfLoop {
-                edge_index,
-                node_id: edge.source.to_string(),
-            });
-        }
-
-        if !node_ids.contains(edge.source.as_str()) {
-            return Err(WorkflowError::MissingEndpoint {
-                edge_index,
-                endpoint: "source",
-                node_id: edge.source.to_string(),
-            });
-        }
-
-        if !node_ids.contains(edge.target.as_str()) {
-            return Err(WorkflowError::MissingEndpoint {
-                edge_index,
-                endpoint: "target",
-                node_id: edge.target.to_string(),
-            });
-        }
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }

---- workflow_rejects_duplicate_node_ids stdout ----

thread 'workflow_rejects_duplicate_node_ids' panicked at crates/workflow/tests/workflow_graph.rs:130:6:

---- workflow_rejects_missing_entry_nodes stdout ----

thread 'workflow_rejects_missing_entry_nodes' panicked at crates/workflow/tests/workflow_graph.rs:149:6:

---- workflow_rejects_direct_self_loops stdout ----

thread 'workflow_rejects_direct_self_loops' panicked at crates/workflow/tests/workflow_graph.rs:171:6:

failures:
    workflow_rejects_direct_self_loops
    workflow_rejects_duplicate_node_ids
    workflow_rejects_empty_graphs
    workflow_rejects_graphs_with_missing_edge_endpoints
    workflow_rejects_missing_entry_nodes

test result: FAILED. 3 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
