*** crates/workflow/src/lib.rs:272:12: delete ! in validate_graph

*** mutation diff:
--- crates/workflow/src/lib.rs
+++ delete ! in validate_graph
@@ -264,17 +264,17 @@
 ) -> Result<(), WorkflowError> {
     if nodes.is_empty() {
         return Err(WorkflowError::EmptyGraph);
     }
 
     let mut node_ids = BTreeSet::new();
 
     for node in nodes {
-        if !node_ids.insert(node.id.as_str().to_string()) {
+        if  /* ~ changed by cargo-mutants ~ */node_ids.insert(node.id.as_str().to_string()) {
             return Err(WorkflowError::DuplicateNode(node.id.to_string()));
         }
     }
 
     if !node_ids.contains(entry_node.as_str()) {
         return Err(WorkflowError::MissingEntryNode(entry_node.to_string()));
     }

---- workflow_rejects_missing_entry_nodes stdout ----

thread 'workflow_rejects_missing_entry_nodes' panicked at crates/workflow/tests/workflow_graph.rs:151:5:
assertion `left == right` failed
  left: DuplicateNode("inspect")
 right: MissingEntryNode("trigger")

---- workflow_combines_nodes_into_a_task_graph stdout ----

thread 'workflow_combines_nodes_into_a_task_graph' panicked at crates/workflow/tests/workflow_graph.rs:54:6:
workflow graph should be valid: DuplicateNode("trigger")

---- workflow_rejects_graphs_with_missing_edge_endpoints stdout ----

thread 'workflow_rejects_graphs_with_missing_edge_endpoints' panicked at crates/workflow/tests/workflow_graph.rs:85:5:
assertion `left == right` failed
  left: DuplicateNode("trigger")
 right: MissingEndpoint { edge_index: 0, endpoint: "target", node_id: "missing" }

failures:
    workflow_combines_nodes_into_a_task_graph
    workflow_rejects_direct_self_loops
    workflow_rejects_graphs_with_missing_edge_endpoints
    workflow_rejects_missing_entry_nodes

test result: FAILED. 4 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
