*** crates/workflow/src/lib.rs:282:24: replace == with != in validate_graph

*** mutation diff:
--- crates/workflow/src/lib.rs
+++ replace == with != in validate_graph
@@ -274,17 +274,17 @@
         }
     }
 
     if !node_ids.contains(entry_node.as_str()) {
         return Err(WorkflowError::MissingEntryNode(entry_node.to_string()));
     }
 
     for (edge_index, edge) in edges.iter().enumerate() {
-        if edge.source == edge.target {
+        if edge.source != /* ~ changed by cargo-mutants ~ */ edge.target {
             return Err(WorkflowError::SelfLoop {
                 edge_index,
                 node_id: edge.source.to_string(),
             });
         }
 
         if !node_ids.contains(edge.source.as_str()) {
             return Err(WorkflowError::MissingEndpoint {

---- workflow_combines_nodes_into_a_task_graph stdout ----

thread 'workflow_combines_nodes_into_a_task_graph' panicked at crates/workflow/tests/workflow_graph.rs:54:6:
workflow graph should be valid: SelfLoop { edge_index: 0, node_id: "trigger" }

---- workflow_rejects_direct_self_loops stdout ----

thread 'workflow_rejects_direct_self_loops' panicked at crates/workflow/tests/workflow_graph.rs:171:6:

---- workflow_rejects_graphs_with_missing_edge_endpoints stdout ----

thread 'workflow_rejects_graphs_with_missing_edge_endpoints' panicked at crates/workflow/tests/workflow_graph.rs:85:5:
assertion `left == right` failed
  left: SelfLoop { edge_index: 0, node_id: "trigger" }
 right: MissingEndpoint { edge_index: 0, endpoint: "target", node_id: "missing" }

failures:
    workflow_combines_nodes_into_a_task_graph
    workflow_rejects_direct_self_loops
    workflow_rejects_graphs_with_missing_edge_endpoints

test result: FAILED. 5 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
