*** crates/workflow/src/lib.rs:289:12: delete ! in validate_graph

*** mutation diff:
--- crates/workflow/src/lib.rs
+++ delete ! in validate_graph
@@ -281,17 +281,17 @@
     for (edge_index, edge) in edges.iter().enumerate() {
         if edge.source == edge.target {
             return Err(WorkflowError::SelfLoop {
                 edge_index,
                 node_id: edge.source.to_string(),
             });
         }
 
-        if !node_ids.contains(edge.source.as_str()) {
+        if  /* ~ changed by cargo-mutants ~ */node_ids.contains(edge.source.as_str()) {
             return Err(WorkflowError::MissingEndpoint {
                 edge_index,
                 endpoint: "source",
                 node_id: edge.source.to_string(),
             });
         }
 
         if !node_ids.contains(edge.target.as_str()) {

---- workflow_combines_nodes_into_a_task_graph stdout ----

thread 'workflow_combines_nodes_into_a_task_graph' panicked at crates/workflow/tests/workflow_graph.rs:54:6:
workflow graph should be valid: MissingEndpoint { edge_index: 0, endpoint: "source", node_id: "trigger" }

---- workflow_rejects_graphs_with_missing_edge_endpoints stdout ----

thread 'workflow_rejects_graphs_with_missing_edge_endpoints' panicked at crates/workflow/tests/workflow_graph.rs:85:5:
assertion `left == right` failed
  left: MissingEndpoint { edge_index: 0, endpoint: "source", node_id: "trigger" }
 right: MissingEndpoint { edge_index: 0, endpoint: "target", node_id: "missing" }

failures:
    workflow_combines_nodes_into_a_task_graph
    workflow_rejects_graphs_with_missing_edge_endpoints

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
