*** crates/workflow/src/lib.rs:297:12: delete ! in validate_graph

*** mutation diff:
--- crates/workflow/src/lib.rs
+++ delete ! in validate_graph
@@ -289,17 +289,17 @@
         if !node_ids.contains(edge.source.as_str()) {
             return Err(WorkflowError::MissingEndpoint {
                 edge_index,
                 endpoint: "source",
                 node_id: edge.source.to_string(),
             });
         }
 
-        if !node_ids.contains(edge.target.as_str()) {
+        if  /* ~ changed by cargo-mutants ~ */node_ids.contains(edge.target.as_str()) {
             return Err(WorkflowError::MissingEndpoint {
                 edge_index,
                 endpoint: "target",
                 node_id: edge.target.to_string(),
             });
         }
     }

---- workflow_combines_nodes_into_a_task_graph stdout ----

thread 'workflow_combines_nodes_into_a_task_graph' panicked at crates/workflow/tests/workflow_graph.rs:54:6:
workflow graph should be valid: MissingEndpoint { edge_index: 0, endpoint: "target", node_id: "inspect" }

---- workflow_rejects_graphs_with_missing_edge_endpoints stdout ----

thread 'workflow_rejects_graphs_with_missing_edge_endpoints' panicked at crates/workflow/tests/workflow_graph.rs:83:6:

failures:
    workflow_combines_nodes_into_a_task_graph
    workflow_rejects_graphs_with_missing_edge_endpoints

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
