*** crates/workflow/src/lib.rs:40:9: replace Workflow::id -> &str with "xyzzy"

*** mutation diff:
--- crates/workflow/src/lib.rs
+++ replace Workflow::id -> &str with "xyzzy"
@@ -32,17 +32,17 @@
             goal: goal.into(),
             entry_node,
             nodes,
             edges,
         })
     }
 
     pub fn id(&self) -> &str {
-        &self.id
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn name(&self) -> &str {
         &self.name
     }
 
     pub fn goal(&self) -> &str {
         &self.goal

---- workflow_combines_nodes_into_a_task_graph stdout ----

thread 'workflow_combines_nodes_into_a_task_graph' panicked at crates/workflow/tests/workflow_graph.rs:56:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "debug-voc"

failures:
    workflow_combines_nodes_into_a_task_graph

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
