*** crates/workflow/src/lib.rs:48:9: replace Workflow::goal -> &str with "xyzzy"

*** mutation diff:
--- crates/workflow/src/lib.rs
+++ replace Workflow::goal -> &str with "xyzzy"
@@ -40,17 +40,17 @@
         &self.id
     }
 
     pub fn name(&self) -> &str {
         &self.name
     }
 
     pub fn goal(&self) -> &str {
-        &self.goal
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn entry_node(&self) -> &NodeId {
         &self.entry_node
     }
 
     pub fn nodes(&self) -> &[Node] {
         &self.nodes

---- workflow_combines_nodes_into_a_task_graph stdout ----

thread 'workflow_combines_nodes_into_a_task_graph' panicked at crates/workflow/tests/workflow_graph.rs:58:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "Find the root cause and produce a verified report."

failures:
    workflow_combines_nodes_into_a_task_graph

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
