*** crates/workflow/src/lib.rs:60:9: replace Workflow::edges -> &[WorkflowEdge] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/workflow/src/lib.rs
+++ replace Workflow::edges -> &[WorkflowEdge] with Vec::leak(Vec::new())
@@ -52,17 +52,17 @@
         &self.entry_node
     }
 
     pub fn nodes(&self) -> &[Node] {
         &self.nodes
     }
 
     pub fn edges(&self) -> &[WorkflowEdge] {
-        &self.edges
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub struct WorkflowEdge {
     source: NodeId,
     target: NodeId,
     kind: WorkflowEdgeKind,

---- workflow_combines_nodes_into_a_task_graph stdout ----

thread 'workflow_combines_nodes_into_a_task_graph' panicked at crates/workflow/tests/workflow_graph.rs:64:16:
index out of bounds: the len is 0 but the index is 0

failures:
    workflow_combines_nodes_into_a_task_graph

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
